{
  "courses": {
    "ADV 150": [
      "Introduction to Advertising",
      {
        "A": [
          "10104",
          [
            [
              0,
              "",
              "ONLINE",
              0,
              [
                "Hall, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduction to the practice and profession of advertising. Course material covers various functional areas of advertising and integrated brand promotion, including account planning, creative, media, research, consumer behavior, sales promotion and interactive advertising. Topics also include how advertising relates to society in cultural, social, ethical and regulatory contexts. Open to all undergraduate majors.",
      []
    ],
    "AFAS 120": [
      "Intro to US Armed Forces",
      {
        "ONL": [
          "10096",
          [
            [
              0,
              "",
              "ONLINE",
              0,
              [
                "Ashworth, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as MILS 120 and NS 120. See MILS 120.",
      []
    ],
    "ANTH 103": [
      "Anthro in a Changing World",
      {
        "ONL": [
          "10141",
          [
            [
              0,
              "",
              "ONLINE",
              0,
              [
                "Patino, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "[IAI Code: S1901N] Presents the fundamental areas of anthropological analysis through a series of comparative cases that emphasize social and cultural relations in global contexts. Directs attention to the anthropological history of global empires and colonial states, their cultural exchanges, and contemporary studies of culture, society, and globalization.",
      []
    ],
    "ASTR 100": [
      "Introduction to Astronomy",
      {
        "ONL": [
          "10005",
          [
            [
              0,
              "",
              "ONLINE",
              0,
              [
                "Dunne, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "[IAI Code: P1906] Introduces the student to the basic concepts of modern astronomy. Covers topics including the night sky; the solar system and its origin; the nature and evolution of stars; stellar remnants, including white dwarfs, neutron stars, and black holes; extrasolar planetary systems; galaxies and quasars; dark matter and dark energy; the Big Bang and the fate of the universe; and life in the universe.",
      []
    ],
    "ATMS 120": [
      "Severe and Hazardous Weather",
      {
        "ONL": [
          "10002",
          [
            [
              0,
              "",
              "ONLINE",
              0,
              [
                "Choate, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Most extreme manifestations of weather and climate are analyzed in terms of their physical basis and their historical, economic and human consequences. Emphasis is placed on the interplay between technological advances, the evolution of meteorology as a science, and the impacts of extreme weather (winter storms, floods, severe thunderstorms, hurricanes, El Nino). Technological advances include satellites, weather radars and profilers, and computer models used for weather prediction.",
      []
    ],
    "BADM 275": [
      "Introduction to Operations and Supply Chain Management",
      {
        "OL": [
          "10121",
          [
            [
              0,
              "",
              "ONLINE",
              0,
              [
                "Sumkin, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Operations and Supply Chain Management is about sourcing, producing, and delivering goods and services that meet and exceed customer expectations. In this course, students will be introduced to decision-making frameworks and techniques for effectively and efficiently managing processes through coordinated efforts across different organizations in a supply chain and across multiple areas within an organization, such as: consumer analytics, research and development, finance, engineering, marketing, human resource management, sourcing, information systems, logistics, and accounting.",
      []
    ],
    "CLCV 102": [
      "Medical Terms-GRK & LAT Roots",
      {
        "A": [
          "10071",
          [
            [
              0,
              "",
              "ONLINE",
              0,
              [
                "Fenton, V"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduction to the study of Greek and Latin medical terms in various medical fields and to the linguistic patterns governing the combination of various roots through practical application of usage.",
      []
    ],
    "CMN 210": [
      "Public Communication in Everyday Life",
      {
        "A": [
          "10085",
          [
            [
              0,
              "",
              "ONLINE",
              0,
              [
                "Murphy, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduces concepts useful for the critical analysis of public communication in everyday life. Drawing on communication theory and practice, especially theories of rhetoric, the course investigates techniques of persuasion, offers tools for critical analysis of public discourse, and considers the political and ethical implications of various forms of public communication.",
      []
    ],
    "DANC 100": [
      "Intro to Contemporary Dance",
      {
        "OL1": [
          "10027",
          [
            [
              0,
              "",
              "ONLINE",
              0,
              [
                "Wahrendorf, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "[IAI Code: F1906] Overview of major works, figures, and trends responsible for shaping dance as an evolving contemporary art form. The course will have lecture, viewing, discussion and experiential (studio participation) components.",
      []
    ],
    "ECON 102": [
      "Microeconomic Principles",
      {
        "ONL": [
          "10019",
          [
            [
              0,
              "",
              "ONLINE",
              0,
              [
                "Ambardar, S",
                "DiIanni, I"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "[IAI Code: S3902] Introduction to the functions of individual decision-makers, both consumers and producers, within the larger economic system. Primary emphasis on the nature and functions of product markets, the theory of the firm under varying conditions of competition and monopoly, and the role of government in prompting efficiency in the economy.",
      []
    ]
  },
  "caches": {
    "periods": [
      "0000 - 0000"
    ],
    "dateRanges": [],
    "scheduleTypes": [
      "Online"
    ],
    "campuses": [],
    "attributes": [],
    "restrictions": [],
    "gradeBases": [],
    "locations": [
      {
        "lat": null,
        "long": null
      }
    ],
    "finalDates": [],
    "finalTimes": []
  },
  "updatedAt": "2026-01-12T00:17:42.681Z",
  "version": 3
}