{
  "subject": "ADV",
  "scrapedAt": 1768450447163,
  "courseCount": 47,
  "courses": {
    "ADV 270": [
      "Principles of Sales",
      {
        "A": [
          "70232",
          [
            [
              0,
              "MW",
              "ONLINE",
              8,
              [
                "Clifton, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "This course focuses on the development of the sales process and the role of sales and sales people within organizations. It will also consider consultative and persuasive selling and interpersonal relationship building. It will include sales proposals, and simulation exercises that will reinforce concepts learned within the classroom. It will also feature exposure to sales experts from different areas of business.",
      []
    ],
    "ADV 200": [
      "Data Literacy",
      {
        "AB1": [
          "74331",
          [
            [
              37,
              "W",
              "328 Armory",
              0,
              [
                "Ji, A",
                "Taneja, H"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ],
        "AB2": [
          "74332",
          [
            [
              52,
              "W",
              "328 Armory",
              0,
              [
                "Li, Y",
                "Taneja, H"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ],
        "AL1": [
          "73628",
          [
            [
              13,
              "",
              "ONLINE",
              8,
              [
                "Taneja, H"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "No matter what your major, or the job you plan to get, becoming fluent at working with data is a sought-after skill. Through lectures and guided workshops, this course provides hands-on- training on fundamentals of data exploration (asking the right questions), data gathering and data analysis (understanding and describing the situation) as well as communicating with data (telling a compelling story through data visualizations). Students learn how to find datasets in online archives and repositories, and are introduced to the commonly used software packages and techniques (spreadsheets, text analytics, social computing). We also focus on critical issues such as data ethics and privacy. We also learn basic computer programming aimed at data analysis. No prior knowledge of research methods, statistics or programming is required.",
      []
    ],
    "ADV 222": [
      "Copywriting",
      {
        "1": [
          "76812",
          [
            [
              2,
              "TR",
              "163 Noyes Laboratory",
              26,
              [
                "Meron, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "For students considering a career in persuasive writing or just striving to become better creative thinkers and communicators, this course explores advertising copywriting concepts, processes and best practices. We'll craft headlines, body copy and scripts for a variety of media, all in the context of audience, strategy, design and the Big Idea. Writing-intensive and portfolio-building, with consideration for cultural trends and artificial intelligence.",
      []
    ],
    "ADV 201": [
      "Social Media and Personal Branding",
      {
        "ONL": [
          "75663",
          [
            [
              13,
              "",
              "ONLINE",
              8,
              [
                "Oh, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Creating a personal brand is no longer a nice-to-have; it’s expected and vital to social media influencers, student athletes and online celebrities. This course focuses on practical strategies for building and maintaining a strong personal brand on social media for career advancement and social influence. Students will develop advanced social media strategy skills and identify risks involved in online reputation management. This course will help you create an authentic personal brand and amplify your career.",
      []
    ],
    "ADV 175": [
      "Introduction to Multicultural Advertising",
      {
        "A": [
          "74338",
          [
            [
              2,
              "MW",
              "101 Armory",
              0,
              [
                "Chambers, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Examines the multifaceted role diversity (including racial, gender, orientation, ability status) plays in the delivery and reception of advertising. Additionally, it examines the development of diversity as a marketplace practice and on the development of the advertising industry. We'll analyze advertising using a historical, cultural, and social perspective and address issues of diversity in the industry. We will also critically review current issues of multicultural, transcultural and multidimensional advertising and marketing. In the process we’ll grapple with current theories on race and implicit /explicit bias and prejudice and their impact upon the production of advertising and consumer communications.",
      []
    ],
    "ADV 214": [
      "Sports Advertising & Branding",
      {
        "A": [
          "77725",
          [
            [
              1,
              "TR",
              "1092 Lincoln Hall",
              2,
              [
                "Hall, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Explores sports advertising and branding. Students will learn about relationships between advertising, media, integrated communications, sports, athletes, events, experiences, and brand partners across amateur, collegiate, and professional sports. Students develop insights and skills related to research, segmenting audiences, consumer behavior, brand strategy, creative messaging, and media in the sports industry. Topics such as e-sports, gaming, Name-Image- Likeness, personal branding, and endorsements are discussed. Students explore historical, ethical and cultural considerations in sports advertising.",
      []
    ],
    "ADV 120": [
      "Consumer Data and Society",
      {
        "ONL": [
          "77774",
          [
            [
              13,
              "",
              "ONLINE",
              8,
              [
                "Ji, A",
                "Nelson, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          10,
          0,
          [],
          -1
        ]
      },
      [],
      "Data are everywhere! In our phones, our homes, our cars, the media, the shops, and more. But what do we know or think about that data and how data are being used in our everyday lives? This introductory course explores the intersection of consumer data and society, equipping students with the tools and knowledge necessary to navigate, analyze, and interpret data in everyday life. This is not a math course, but you will gain numeracy and understanding of data and statistics as you consider concepts, questions, and ways of thinking about data through the lens of advertising, media, politics, consumer behavior, and life. Through a combination of theoretical insights and practical applications, students will develop a critical understanding of how data shapes our world and how to use data responsibly and effectively to solve consumer and business problems.",
      []
    ],
    "ADV 150": [
      "Introduction to Advertising",
      {
        "AB1": [
          "74341",
          [
            [
              23,
              "R",
              "136 Davenport Hall",
              5,
              [
                "Cho, B",
                "Hall, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AB2": [
          "74342",
          [
            [
              23,
              "R",
              "304 Noyes Laboratory",
              26,
              [
                "Goodreau, A",
                "Hall, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AB3": [
          "74343",
          [
            [
              43,
              "R",
              "136 Davenport Hall",
              5,
              [
                "Hall, S",
                "Jois, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AB4": [
          "74344",
          [
            [
              43,
              "R",
              "304 Noyes Laboratory",
              26,
              [
                "Goodreau, A",
                "Hall, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AB5": [
          "74345",
          [
            [
              3,
              "F",
              "134 Armory",
              0,
              [
                "Goodreau, A",
                "Hall, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AB6": [
          "74346",
          [
            [
              3,
              "F",
              "144 Armory",
              0,
              [
                "Hall, S",
                "He, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AB7": [
          "74347",
          [
            [
              6,
              "F",
              "134 Armory",
              0,
              [
                "Hall, S",
                "Jois, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AB8": [
          "74348",
          [
            [
              6,
              "F",
              "144 Armory",
              0,
              [
                "Hall, S",
                "He, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AB9": [
          "74350",
          [
            [
              9,
              "W",
              "147 Armory",
              0,
              [
                "Hall, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AL1": [
          "60077",
          [
            [
              9,
              "TR",
              "112 Gregory Hall",
              3,
              [
                "Hall, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduction to the practice and profession of advertising. Course material covers various functional areas of advertising and integrated brand promotion, including account planning, creative, media, research, consumer behavior, sales promotion and interactive advertising. Topics also include how advertising relates to society in cultural, social, ethical and regulatory contexts. Open to all undergraduate majors.",
      []
    ],
    "ADV 280": [
      "Introduction to Advertising Media",
      {
        "1": [
          "76817",
          [
            [
              53,
              "MW",
              "113 David Kinley Hall",
              12,
              [
                "Sar, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "2": [
          "77726",
          [
            [
              1,
              "MW",
              "113 David Kinley Hall",
              12,
              [
                "Sar, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Students will be introduced to advertising in media, including an understanding of the contemporary media landscape and the ways in audiences use media. We will primarily discuss media concepts and media tools that are commonly used by advertising professionals to collect and interpret media insights for advertising.",
      []
    ],
    "ADV 250": [
      "Advertising and Brand Strategy",
      {
        "AB1": [
          "75527",
          [
            [
              23,
              "W",
              "311 Gregory Hall",
              3,
              [
                "Chang, J",
                "Hitchon, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AB2": [
          "75529",
          [
            [
              43,
              "W",
              "311 Gregory Hall",
              3,
              [
                "Chang, J",
                "Hitchon, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AB3": [
          "75530",
          [
            [
              9,
              "R",
              "144 Armory",
              0,
              [
                "Hitchon, J",
                "Kazybayeva, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AB4": [
          "75528",
          [
            [
              23,
              "R",
              "145 Armory",
              0,
              [
                "Chang, J",
                "Hitchon, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AB5": [
          "77465",
          [
            [
              5,
              "F",
              "317 Gregory Hall",
              3,
              [
                "Hitchon, J",
                "Kazybayeva, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AB6": [
          "78288",
          [
            [
              3,
              "F",
              "1027 Lincoln Hall",
              2,
              [
                "Hitchon, J",
                "Kazybayeva, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AL1": [
          "75526",
          [
            [
              5,
              "MW",
              "101 Armory",
              0,
              [
                "Hitchon, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Designed to help students acquire brand decision-making skills. Advertising and marketing theories, practical problems and traditional cases will be studied as they learn to build a strong brand strategy that will lead to a strong brand advertising strategy. This encompasses every facet of making advertising decisions for a brand. This involves understanding the content a consumer requires, how the consumer will come in contact with the brand, and what is the goal of the connection between consumer and content/contact.",
      []
    ],
    "ADV 284": [
      "Consumer Insight",
      {
        "D1": [
          "68858",
          [
            [
              2,
              "R",
              "156 Henry Administration Bldg",
              27,
              [
                "Pierre, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "D2": [
          "68859",
          [
            [
              2,
              "R",
              "144 Armory",
              0,
              [
                "Pierre, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "D3": [
          "68860",
          [
            [
              25,
              "R",
              "143 Henry Administration Bldg",
              27,
              [
                "Pierre, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "D4": [
          "68865",
          [
            [
              25,
              "R",
              "149 Henry Administration Bldg",
              27,
              [
                "Pierre, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "D5": [
          "60082",
          [
            [
              45,
              "F",
              "1066 Lincoln Hall",
              2,
              [
                "Pierre, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "L1": [
          "68857",
          [
            [
              25,
              "T",
              "101 Armory",
              0,
              [
                "Pierre, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Course focuses on methods of eliciting consumer insight. In particular, this class introduces the process and applied outcomes of consumer insight in terms of building brand strategy. Techniques for persuasive presentation of insight will also be introduced.",
      []
    ],
    "ADV 301": [
      "Becoming an Influencer",
      {
        "INF": [
          "74402",
          [
            [
              37,
              "MW",
              "132 Bevier Hall",
              21,
              [
                "Wilson, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Explores the everyday impact the influencer economy has on our purchasing decisions, political engagement, and social activism. This new celebrity class illustrates the critical importance that public relations, advertising, marketing, and communications management has on influencer marketing and influencer relations. The course will identify the evolving strategies, tactics, and techniques that drive the influencer ecosystem, evaluate the social and cultural impact of influencer marketing and engagement on organizations and audiences, and assess the racial and gender dynamics that are created and recreated within this quickly evolving marketing and creative arena. Finally, students will focus on the development of influencer generated branded content across for-profit, nonprofit, and human rights organizations. Eligible for the PR Minor: https://media.illinois.edu/pr_minor.",
      []
    ],
    "ADV 281": [
      "Advertising Research Methods",
      {
        "D1": [
          "68850",
          [
            [
              3,
              "F",
              "328 Armory",
              0,
              [
                "Paltaratskaya, V",
                "Vargas, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "D3": [
          "68854",
          [
            [
              6,
              "F",
              "328 Armory",
              0,
              [
                "Paltaratskaya, V",
                "Vargas, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "D4": [
          "68855",
          [
            [
              7,
              "F",
              "328 Armory",
              0,
              [
                "Paltaratskaya, V",
                "Vargas, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "D5": [
          "68856",
          [
            [
              8,
              "F",
              "328 Armory",
              0,
              [
                "Chick, C",
                "Vargas, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "L1": [
          "68852",
          [
            [
              6,
              "TR",
              "120 Architecture Building",
              25,
              [
                "Vargas, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduces students to the wide spectrum of qualitative and quantitative research techniques that are commonly used in the advertising industry. In addition to examining the principles, methods and techniques of advertising research, the course will address issues such as when research should and should not be conducted, analyzing data sets, forming meaningful research questions, figuring out how to answer the questions, and presenting the answers to these questions in a clear and compelling manner.",
      []
    ],
    "ADV 314": [
      "Sports Public Relations",
      {
        "A": [
          "73629",
          [
            [
              10,
              "TR",
              "209 Huff Hall",
              17,
              [
                "Brown, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Sports public relations is designed to show the management function of developing and sustaining two-way lines of communication, understanding, acceptance, and cooperation between a sports organization and all the other stakeholders, including team, athlete, league, organization, company and brand and its respective publics.",
      []
    ],
    "ADV 290": [
      "Special Topics in Advertising",
      {
        "ADD": [
          "73632",
          [
            [
              0,
              "MW",
              "1 Gregory Hall",
              3,
              [
                "Heede, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Designed to offer freshmen and sophomores opportunity to take courses in advertising's most recent developments.",
      []
    ],
    "ADV 310": [
      "Intro to Public Relations",
      {
        "A": [
          "54936",
          [
            [
              37,
              "MW",
              "1100 Wymer Hall",
              8,
              [
                "Yang, G"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduces the student to the practice and profession of public relations. Course material covers topics such as the history of public relations, the role of law and ethics in public relations, and theories that guide public relations research and practice. The course will also introduce roles played by public relations practitioners within organizations, such as media relations, consumer relations, employee relations, community relations, and investor relations.",
      []
    ],
    "ADV 350": [
      "Writing for Public Relations",
      {
        "A": [
          "55675",
          [
            [
              1,
              "MW",
              "31 Gregory Hall",
              3,
              [
                "Hitchon, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Focuses on the strategy of crafting and delivering PR messages to various audiences with special emphasis on pre-writing, preparation, revision and presentation.",
      []
    ],
    "ADV 320": [
      "Sales Management",
      {
        "ONL": [
          "70233",
          [
            [
              13,
              "",
              "ONLINE",
              8,
              [
                "Clifton, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "This course addresses conceptual and methodological issues related to the management of sales within organizations. Responsibilities, function and skills necessary to be an effective sales manager are covered, including an evaluation of sales organization structures, recruiting, selecting, testing, and training of salespeople. Related topics include compensation plans, controlling expenses, sales forecasting/projections, routing, quotas, ethics and motivation. It will consist of lectures, role playing exercises, and also may include guest lectures from industry leaders/alumni with experience in sales management.",
      []
    ],
    "ADV 333": [
      "Agency Experience",
      {
        "1": [
          "76813",
          [
            [
              2,
              "MW",
              "428 Armory",
              0,
              [
                "Meron, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "This is the class that runs like an agency: a fast-paced, hands-on environment where students plan, develop and execute innovative advertising campaigns and materials for real clients. Students take on specialized roles related to research, strategy, creative, media and account direction, and will apply creative problem solving, design thinking, data literacy and professionalism to address client goals and develop impactful work. Clients include the Department of Advertising, as well as other educational and nonprofit organizations.",
      []
    ],
    "ADV 360": [
      "Innovations in Advertising",
      {
        "AB1": [
          "75532",
          [
            [
              47,
              "W",
              "169 Davenport Hall",
              5,
              [
                "Kim, S",
                "Park, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AB2": [
          "75533",
          [
            [
              47,
              "W",
              "136 Davenport Hall",
              5,
              [
                "Liu, A",
                "Park, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AB3": [
          "75534",
          [
            [
              53,
              "W",
              "169 Davenport Hall",
              5,
              [
                "Kim, S",
                "Park, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AB4": [
          "75535",
          [
            [
              53,
              "W",
              "136 Davenport Hall",
              5,
              [
                "Lee, Y",
                "Park, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AL1": [
          "75531",
          [
            [
              47,
              "M",
              "23 Psychology Building",
              1,
              [
                "Park, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Intended to improve creative and critical thinking skill in advertising planning by understanding the core technology and perspective of digital and other innovative media in the context of integrated communication. This will allow students to understand how consumers perceive and process digital advertising messages; to research critical questions in digital consumer behavior; to learn how to utilize digital and non-digital media in the context of integrated communication; to apply knowledge of digital communication technology to the real-world advertising cases.",
      []
    ],
    "ADV 390": [
      "Content Creation",
      {
        "A": [
          "60085",
          [
            [
              1,
              "TR",
              "213 Gregory Hall",
              3,
              [
                "Meron, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Explores theories of creativity; situates creativity and creative practices within the social structure of organizations that develop creative content; examines the relationship between creative strategy, creative concepts and creative executions; exposes students to the practice of creating content for traditional and non-traditional media vehicles.",
      []
    ],
    "ADV 370": [
      "Sales and the Consumer",
      {
        "ONL": [
          "70234",
          [
            [
              13,
              "",
              "ONLINE",
              8,
              [
                "Clifton, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "This course focuses on different topics related to consumer behavior management, and the consumer's relationships to the sales process. It will include case studies and exercises that will facilitate application of effective sales techniques.",
      []
    ],
    "ADV 396": [
      "Research Experience in Advertising",
      {
        "": [
          "67032",
          [
            [
              13,
              "",
              "ONLINE",
              8,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Supervised participation in research and scholarly activities, usually as an assistant to an investigator.",
      []
    ],
    "ADV 391": [
      "Creative Advertising for Non-Majors",
      {
        "A": [
          "77831",
          [
            [
              1,
              "TR",
              "319 Gregory Hall",
              3,
              [
                "Heede, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Explore the creative side of advertising – writing and art, ideation through execution, for traditional and non-traditional media. This course also provides non-majors with some fundamentals of the field such as research, brand strategy, consumer insights, and media.",
      []
    ],
    "ADV 392": [
      "Advertising Immersion and Experiential Learning",
      {
        "AMZ": [
          "73423",
          [
            [
              1,
              "R",
              "1302 Siebel Center for Comp Sci",
              28,
              [
                "Nelson, M",
                "Sar, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          6,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Covers a variety of topics designed to help students learn more about, and be better prepared to enter, the advertising industry as professionals. Course content will include an overview of careers in the advertising industry while paying particular attention to areas of future career growth. This course is centered on experiential learning where students will participate in interactive discussions and create advertising strategies with industry professionals at media related agencies and other industry businesses.",
      []
    ],
    "ADV 400": [
      "Special Problems",
      {
        "": [
          "10112",
          [
            [
              13,
              "",
              "ONLINE",
              8,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Special projects, research, and independent reading in advertising for students capable of individual work under the guidance of a faculty adviser.",
      []
    ],
    "ADV 393": [
      "Advertising and Society",
      {
        "A": [
          "60086",
          [
            [
              41,
              "MW",
              "124 Burrill Hall",
              22,
              [
                "Vargas, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Provides a critical understanding of advertising's role in modern society. Advertising will be studied as a cultural force and social institution. Its role will be examined in relation to communications, economics, and political and legal systems.",
      []
    ],
    "ADV 399": [
      "Advertising Study Abroad",
      {
        "JPN": [
          "54569",
          [
            [
              54,
              "R",
              "31 Gregory Hall",
              3,
              [
                "Peacock, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          5,
          0,
          0,
          [],
          -1
        ],
        "ROM": [
          "54570",
          [
            [
              54,
              "T",
              "1 Gregory Hall",
              3,
              [
                "Hall, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          5,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Provides credit toward undergraduate degree for undertaking study and/or a research project through faculty led programs or from an accredited foreign institution or approved overseas program.",
      []
    ],
    "ADV 409": [
      "Media Entrepreneurship",
      {
        "A": [
          "68732",
          [
            [
              2,
              "TR",
              "1046 Siebel Center for Design",
              13,
              [
                "Kasdan, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduces students to the foundations of entrepreneurship and evolving business models for media. Students are introduced to the foundation and context of entrepreneurship. The course will cover the skills and practices necessary for new entrepreneurial ventures, as well as the processes of evaluating an idea, assessing the market, and implementing a new venture. Finally, students will examine business case studies for both successful and unsuccessful media start-ups.",
      []
    ],
    "ADV 410": [
      "Public Relations Strategies",
      {
        "A": [
          "50144",
          [
            [
              1,
              "MW",
              "312 David Kinley Hall",
              12,
              [
                "Wirtz, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "B": [
          "39501",
          [
            [
              10,
              "MW",
              "312 David Kinley Hall",
              12,
              [
                "Wirtz, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Examines the intersection of public relations strategies and communication tactics used by organizations to meet reputation and relationship management objectives with relevant publics and stakeholder groups, such as journalists, consumers, employees, investors, government officials and agencies and community members.",
      []
    ],
    "ADV 454": [
      "Creative Concepts II",
      {
        "A": [
          "52662",
          [
            [
              14,
              "TR",
              "31 Gregory Hall",
              3,
              [
                "Sheldon, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "This portfolio-oriented course builds upon the core competencies acquired in ADV 452 and applies them to solving real-world advertising problems with integrated creative consumer communications efforts than span traditional and new media.",
      []
    ],
    "ADV 483": [
      "Audience Analysis",
      {
        "E": [
          "68912",
          [
            [
              2,
              "TR",
              "31 Gregory Hall",
              3,
              [
                "Zhang, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Analyzes audiences and matches consumer insights with strategic ideas for brand communication, contact, and connection.",
      []
    ],
    "ADV 480": [
      "Social Media Analytics",
      {
        "A": [
          "74412",
          [
            [
              0,
              "TR",
              "31 Gregory Hall",
              3,
              [
                "Su, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "B": [
          "74411",
          [
            [
              1,
              "TR",
              "31 Gregory Hall",
              3,
              [
                "Su, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Social media analytics is the art and science of extracting valuable hidden insights from vast amounts of semi-structured and unstructured social media data to enable informed and insightful decision making. ADV 480 is an advanced course designed to provide the students with (1) well-grounded understanding of social media analytics, (2) techniques of extracting and analyzing Twitter analytics, and (3) skills of interpreting and aligning insights gained with organizational goals and objectives.",
      []
    ],
    "ADV 461": [
      "Computational Advertising",
      {
        "A": [
          "70249",
          [
            [
              37,
              "MW",
              "31 Gregory Hall",
              3,
              [
                "Maslowska, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Explores the emerging landscape of computational advertising and provides students with a thorough understanding of digital advertising mechanisms, including topics like programmatic advertising, auctions, (behavioral) targeting, and attribution. Students also discuss the role of the digital traces left by consumers and how they can be used to generate insights to improve communication efforts. An emphasis is placed on privacy and ethical issues. Legal issues entrenched in digital advertising are also discussed.",
      []
    ],
    "ADV 491": [
      "Digital Content and Social Media Management",
      {
        "A": [
          "41469",
          [
            [
              52,
              "MW",
              "31 Gregory Hall",
              3,
              [
                "Peacock, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Application of analytical planning concepts to advertising planning, decision making, and managing social media accounts. Covers all of the decision making areas of advertising and social media management.",
      []
    ],
    "ADV 492": [
      "Tech and Advertising Campaigns",
      {
        "U": [
          "64125",
          [
            [
              39,
              "MW",
              "31 Gregory Hall",
              3,
              [
                "Maslowska, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "With the maturation of the internet as an advertising and media channel, advertising, journalism, and communications students need to know more about technology and how that impacts their messages and designs. Likewise, computer scientists could benefit from knowledge of what the end user is looking for when designing web content, applications and other web-based media. Students in this course will gain design knowledge as well as a hands-on experience in completing a technology-driven advertising campaign. Students will participate in engineering, advertising and project management activities with individual as well as team responsibilities.",
      []
    ],
    "ADV 490": [
      "Advanced Special Topics in Advertising",
      {
        "AMZ": [
          "58648",
          [
            [
              1,
              "R",
              "1302 Siebel Center for Comp Sci",
              28,
              [
                "Nelson, M",
                "Sar, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "CCI": [
          "62620",
          [
            [
              10,
              "MW",
              "115 David Kinley Hall",
              12,
              [
                "Heede, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "DP": [
          "58647",
          [
            [
              55,
              "T",
              "31 Gregory Hall",
              3,
              [
                "Peloquin, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "POP": [
          "61427",
          [
            [
              45,
              "MW",
              "317 Gregory Hall",
              3,
              [
                "Oh, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Covers current issues in various advertising areas not studied extensively in other courses.",
      []
    ],
    "ADV 495": [
      "Internship Seminar",
      {
        "1": [
          "49210",
          [
            [
              13,
              "",
              "ONLINE",
              8,
              [
                "Almanza, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          3,
          0,
          [],
          -1
        ],
        "EF": [
          "73777",
          [
            [
              13,
              "",
              "ONLINE",
              8,
              [
                "Phillips, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          13,
          0,
          [],
          -1
        ],
        "MS": [
          "49825",
          [
            [
              13,
              "",
              "ONLINE",
              8,
              [
                "Clifton, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Seminar based on internship experience. Offered for College of Media students who complete an approved professional, industry related internship.",
      []
    ],
    "ADV 498": [
      "The Sandage Project",
      {
        "A": [
          "63424",
          [
            [
              18,
              "MWF",
              "31 Gregory Hall",
              3,
              [
                "Peacock, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "C": [
          "63426",
          [
            [
              56,
              "MWF",
              "1043 Sidney Lu Mech Engr Bldg",
              29,
              [
                "Peacock, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "D": [
          "63427",
          [
            [
              18,
              "MWF",
              "31 Gregory Hall",
              3,
              [
                "Yang, G"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "This course is named after the founder of the Advertising Department, Charles H. Sandage (known as the \"father of advertising education\"). His vision of educating the future of the industry was grounded in theoretical and foundational courses emphasizing the \"why of advertising\" - not just the \"how.\" In this course, students will integrate the concepts, experiences, and skills that have been learned in the curriculum with a service-learning project.",
      []
    ],
    "ADV 497": [
      "Colloquium in Advertising",
      {
        "A": [
          "77049",
          [
            [
              7,
              "F",
              "31 Gregory Hall",
              3,
              [
                "Wise, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Current topics, cases, and research in advertising are presented in a forum that fosters critical thinking and engagement. Weekly presentation and discussion of current research and cases by faculty, undergraduate/graduate students, visiting scholars and visiting professionals.",
      []
    ],
    "ADV 496": [
      "UG Research Project",
      {
        "": [
          "64102",
          [
            [
              13,
              "",
              "ONLINE",
              8,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Supervised investigation of student-driven research on special topics related to advertising in individual or collaborative format. Topic and nature of research may vary. Capstone paper required. Type of course: Lecture-discussion",
      []
    ],
    "ADV 582": [
      "Qualitative Rsrch in Advert",
      {
        "A": [
          "30749",
          [
            [
              57,
              "W",
              "219 Gregory Hall",
              3,
              [
                "Nelson, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Treatment of basic research concepts and procedures in the social sciences with emphasis on advertising.",
      []
    ],
    "ADV 509": [
      "Media Entrepreneurship",
      {
        "A": [
          "68920",
          [
            [
              2,
              "TR",
              "1046 Siebel Center for Design",
              13,
              [
                "Kasdan, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduces students to the foundations of entrepreneurship and evolving business models for media. Students are introduced to the foundation and context of entrepreneurship. The course will cover the skills and practices necessary for new entrepreneurial ventures, as well as the processes of evaluation an idea, assessing the market, and implementing a new venture. Finally, students will examine business case studies for both successful and unsuccessful media start-ups.",
      []
    ],
    "ADV 588": [
      "Graduate Seminar II",
      {
        "A": [
          "57001",
          [
            [
              10,
              "TR",
              "315 Gregory Hall",
              3,
              [
                "Wise, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Students write research proposals in this course.",
      []
    ],
    "ADV 598": [
      "Professional Project",
      {
        "1": [
          "67375",
          [
            [
              13,
              "",
              "ONLINE",
              8,
              [
                "Nelson, M",
                "Yao, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          6,
          14,
          0,
          [],
          -1
        ]
      },
      [],
      "This is a capstone course – where individuals will complete their final project for the MS Advertising degree. The project showcases the student’s mastery of knowledge in the primary areas of advertising.",
      []
    ],
    "ADV 597": [
      "Proseminar in Advertising",
      {
        "A": [
          "77050",
          [
            [
              7,
              "F",
              "31 Gregory Hall",
              3,
              [
                "Wise, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Current topics, cases, and research in advertising are presented in a forum that fosters critical thinking and engagement. Weekly presentation and discussion of current research and cases by faculty, undergraduate/graduate students, visiting scholars and visiting professionals.",
      []
    ],
    "ADV 590": [
      "Special Topics in Advertising",
      {
        "": [
          "10116",
          [
            [
              13,
              "",
              "ONLINE",
              8,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ],
        "CA": [
          "52664",
          [
            [
              37,
              "MW",
              "31 Gregory Hall",
              3,
              [
                "Maslowska, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ],
        "CCI": [
          "45525",
          [
            [
              10,
              "MW",
              "115 David Kinley Hall",
              12,
              [
                "Heede, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ],
        "POP": [
          "49538",
          [
            [
              45,
              "MW",
              "317 Gregory Hall",
              3,
              [
                "Oh, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "May be repeated in the same or in multiple semesters if topics vary. Prerequisite: Consent of department.",
      []
    ]
  },
  "caches": {
    "periods": [
      "0930 - 1050",
      "1100 - 1220",
      "1230 - 1350",
      "1000 - 1050",
      "1400 - 1650",
      "0900 - 0950",
      "1100 - 1150",
      "1200 - 1250",
      "1300 - 1350",
      "1400 - 1450",
      "1400 - 1520",
      "1600 - 1715",
      "0930 - 1045",
      "0000 - 0000",
      "1400 - 1550",
      "1600 - 1720",
      "1400 - 1720",
      "1500 - 1720",
      "1300 - 1450",
      "1500 - 1650",
      "0900 - 1150",
      "0800 - 0950",
      "0900 - 1020",
      "1500 - 1550",
      "1400 - 1630",
      "1530 - 1650",
      "0800 - 0920",
      "0800 - 0850",
      "1700 - 1820",
      "1530 - 1620",
      "2000 - 2050",
      "1200 - 1550",
      "1230 - 1620",
      "0830 - 0920",
      "0800 - 1150",
      "1300 - 1650",
      "1500 - 1750",
      "1500 - 1620",
      "1700 - 1850",
      "0900 - 1050",
      "1100 - 1250",
      "1200 - 1320",
      "1600 - 1750",
      "1600 - 1650",
      "1130 - 1250",
      "1000 - 1120",
      "1600 - 1730",
      "1300 - 1420",
      "1030 - 1150",
      "1230 - 1320",
      "1330 - 1520",
      "1530 - 1710",
      "1630 - 1750",
      "1430 - 1550",
      "1730 - 1850",
      "1730 - 1920",
      "1000 - 1150",
      "1530 - 1820"
    ],
    "dateRanges": [],
    "scheduleTypes": [
      "Lecture-Discussion",
      "Discussion/ Recitation",
      "Lecture",
      "Online",
      "Independent Study",
      "Laboratory",
      "Laboratory-Discussion",
      "Online Lecture",
      "Online Discussion",
      "Conference",
      "Online Lecture Discussion",
      "Seminar",
      "Study Abroad",
      "Internship",
      "Research"
    ],
    "campuses": [],
    "attributes": [],
    "restrictions": [],
    "gradeBases": [],
    "locations": [
      {
        "lat": 40.1047599,
        "long": -88.2319514
      },
      {
        "lat": 40.10755766472843,
        "long": -88.22995430218522
      },
      {
        "lat": 40.1065684,
        "long": -88.2281746
      },
      {
        "lat": 40.105732,
        "long": -88.2281018
      },
      {
        "lat": 40.10628,
        "long": -88.22621
      },
      {
        "lat": 40.1072225,
        "long": -88.2262016
      },
      {
        "lat": 40.10944320239664,
        "long": -88.22602522743233
      },
      {
        "lat": 40.103620555545135,
        "long": -88.22982720445013
      },
      {
        "lat": null,
        "long": null
      },
      {
        "lat": 40.107534,
        "long": -88.2281548
      },
      {
        "lat": 40.1020773,
        "long": -88.2296394
      },
      {
        "lat": 40.106778040727896,
        "long": -88.2194617156191
      },
      {
        "lat": 40.1035833,
        "long": -88.228405
      },
      {
        "lat": 40.102726858556835,
        "long": -88.23259991223857
      },
      {
        "lat": 40.11246109008789,
        "long": -88.22831726074219
      },
      {
        "lat": 40.10127390836906,
        "long": -88.2226073524728
      },
      {
        "lat": 40.1035872,
        "long": -88.2306061
      },
      {
        "lat": 40.1034533,
        "long": -88.2327596
      },
      {
        "lat": 40.103627234541904,
        "long": -88.22601765311099
      },
      {
        "lat": 40.0995003,
        "long": -88.223104
      },
      {
        "lat": 40.101862,
        "long": -88.231737
      },
      {
        "lat": 40.104794,
        "long": -88.224264
      },
      {
        "lat": 40.103587,
        "long": -88.230606
      },
      {
        "lat": 40.107811,
        "long": -88.2260761
      },
      {
        "lat": 40.10783362157985,
        "long": -88.22476189569741
      },
      {
        "lat": 40.1033599,
        "long": -88.2292111
      },
      {
        "lat": 40.108419421661715,
        "long": -88.2261156301609
      },
      {
        "lat": 40.1083446,
        "long": -88.2282555
      },
      {
        "lat": 40.11380515934119,
        "long": -88.22490788390387
      },
      {
        "lat": 40.110811306674734,
        "long": -88.2248467072371
      }
    ],
    "finalDates": [],
    "finalTimes": []
  }
}