{
  "subject": "ANTH",
  "scrapedAt": 1768370605575,
  "courseCount": 62,
  "courses": {
    "ANTH 104": [
      "Talking Culture",
      {
        "1": [
          "30033",
          [
            [
              13,
              "TR",
              "223 David Kinley Hall",
              8,
              [
                "Delfino, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduces you to language-in-use from the perspective of linguistic anthropology. We explore how the language(s) people use creates a specific \"worldview\" or cultural \"common sense\" and how this creates and maintains distinct concepts of self, society and culture. We will examine critically the ways in which differences in language and communication work in the USA in relation to power and politics, the media, gender, ethnicity/race, age, class, and identity, with comparisons to other cultures. During the semester you will encounter new information about language structure and use, and learn methods of investigation and analysis used in contemporary linguistic anthropology.",
      []
    ],
    "ANTH 199": [
      "Undergraduate Open Seminar",
      {
        "": [
          "10268",
          [
            [
              6,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          5,
          4,
          0,
          [],
          -1
        ],
        "AL1": [
          "78385",
          [
            [
              26,
              "TR",
              "Location Pending",
              0,
              [
                "Shackelford, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          5,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      null,
      []
    ],
    "ANTH 110": [
      "Humanizing Science",
      {
        "1": [
          "70671",
          [
            [
              4,
              "TR",
              "111A Pennsylvania Lounge Bld - PAR",
              0,
              [
                "Clancy, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Scientists are often taught that the skills they need are confined to conducting research in the lab, the field, or the observatory. Yet science is also a human endeavor. If scientists are not taught this lesson, mistakes can be made that have real implications for people's lives, for scientific progress, and for who gets to be a scientist. Therefore this course will introduce 1) a brief history of Western and non-Western science, 2) the influences of social categories and oppressions on scientific advancement, 3) the incentive and reward structure of science, and 4) stories of scientists who have chosen to walk a brave path in the way they conduct and disseminate their research. We will engage in a mix of ethnographic and case study work and bring interpretive and systematic analysis to bear on what it means to be a scientist. The ultimate goal of the course is to provide a substantive, rigorous, and broad introduction to the culture of science, and how that culture affects the people of science, its practice, and its process.",
      []
    ],
    "ANTH 126": [
      "Humans and Animals - Food or Friend?",
      {
        "1": [
          "74329",
          [
            [
              7,
              "TR",
              "326 David Kinley Hall",
              8,
              [
                "Cortez, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Emphasizes questions of how we can move toward a more sustainable future by focusing on two key realms of human relations with non-human animals: as food, and as “friend,” or pets/companion animals. A third category, of animals as “fauna” or avatars of the wild will be touched on briefly. Anchored in humanistic social science, this course also exposes students to the benefits and challenges of interdisciplinary thinking and research, and provides an opportunity for active experiential learning and public engagement",
      []
    ],
    "ANTH 182": [
      "Latin American Cultures",
      {
        "AL1": [
          "40158",
          [
            [
              3,
              "TR",
              "242 Bevier Hall",
              13,
              [
                "Quinones-Rivera, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Latin America considered as a theater of conflict and cultural experimentation among Native American, African, and Iberian peoples; their survival and transformation as reported in selected ethnographies and eyewitness sources; and some modern theories and controversies about their experience.",
      []
    ],
    "ANTH 103": [
      "Anthro in a Changing World",
      {
        "ONL": [
          "54206",
          [
            [
              6,
              "",
              "ONLINE",
              0,
              [
                "Pavlovic, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "[IAI Code: S1901N] Presents the fundamental areas of anthropological analysis through a series of comparative cases that emphasize social and cultural relations in global contexts. Directs attention to the anthropological history of global empires and colonial states, their cultural exchanges, and contemporary studies of culture, society, and globalization.",
      []
    ],
    "ANTH 106": [
      "Hist Arch Americas",
      {
        "1": [
          "43560",
          [
            [
              7,
              "TR",
              "1306 Everitt Laboratory",
              18,
              [
                "Naidoo, N"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Explores recent theoretical, methodological, and thematic developments in historical archaeology in North America and the Caribbean. The temporal coverage is 1500-1900 AD. Examines how historical archaeologists use artifactual, documentary and oral history evidence in interpreting the past, and how historical archaeology can contribute to our understanding of the ways by which material culture can be used to study race, class, gender, and ethnic identities.",
      []
    ],
    "ANTH 180": [
      "The Archaeology of Death",
      {
        "ONL": [
          "46439",
          [
            [
              6,
              "",
              "ONLINE",
              0,
              [
                "Shaw, G"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Cross-cultural introduction to the celebration of death across time and space. Examines the anthropological and archaeological literature on death, particularly in terms of death ritual and burial practices. Students study popular films on death in different cultures.",
      []
    ],
    "ANTH 109": [
      "Religion & Society in West II",
      {
        "E": [
          "37859",
          [
            [
              9,
              "MWF",
              "160 English Building",
              5,
              [
                "King, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as PHIL 109 and REL 109. See REL 109.",
      []
    ],
    "ANTH 101": [
      "Introduction to Anthropology",
      {
        "ONL": [
          "54598",
          [
            [
              6,
              "",
              "ONLINE",
              0,
              [
                "Wong, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Anthropology was first envisioned as a holistic discipline, combining insights from the study of human anatomy and evolution, research on material remains of human settlements, and the analysis of social interaction in language and other cultural practices. Following this tradition, this course explores the questions about where humans came from, how societies live and communicate, and why human cultural groups vary.",
      []
    ],
    "ANTH 210": [
      "Families in Global Perspective",
      {
        "AL1": [
          "33812",
          [
            [
              4,
              "TR",
              "ONLINE",
              0,
              [
                "Kramer, K",
                "Wang, I",
                "Zhang, F"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as HDFS 220. See HDFS 220.",
      []
    ],
    "ANTH 230": [
      "Sociocultural Anthropology",
      {
        "ADB": [
          "30045",
          [
            [
              5,
              "F",
              "209A Davenport Hall",
              4,
              [
                "Akin, T",
                "Dominguez, V"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ],
        "ADC": [
          "30047",
          [
            [
              9,
              "F",
              "209A Davenport Hall",
              4,
              [
                "Akin, T",
                "Dominguez, V"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ],
        "AL1": [
          "30048",
          [
            [
              9,
              "TR",
              "162 Education Building",
              6,
              [
                "Dominguez, V"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduction to the anthropological study of contemporary human societies; emphasis on the comparative study of social organization, interpersonal relations, cultural ecology, and processes of sociocultural change, but also includes some consideration of the method and theory of ethnographic field research.",
      []
    ],
    "ANTH 222": [
      "Introduction to Modern Africa",
      {
        "A": [
          "56394",
          [
            [
              11,
              "F",
              "307 Gregory Hall",
              2,
              [
                "Toure, V"
              ],
              -1,
              -1,
              -1
            ],
            [
              11,
              "MW",
              "307 Gregory Hall",
              2,
              [
                "Toure, V"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as AFST 222, PS 242, and SOC 222. See AFST 222.",
      []
    ],
    "ANTH 221": [
      "Archaeology of South Asia",
      {
        "1": [
          "73121",
          [
            [
              4,
              "MW",
              "320 Mumford Hall",
              0,
              [
                "Riggs, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Explores the archaeology of South Asia from the earliest occupations of the subcontinent to the present. South Asia is home to one of the first urbanized societies, over 40 World Heritage sites, and some of the 21st century's largest megacities. We will critically examine how these diverse archaeological resources have been investigated by different communities through time and how this has informed modern understandings of cultural, national, religious, regional and gender identities.",
      []
    ],
    "ANTH 247": [
      "Forensic Science DNA Lab",
      {
        "1": [
          "65164",
          [
            [
              71,
              "W",
              "ARR Institute for Genomic Biology",
              0,
              [
                "Cheng, V",
                "Hughes, C",
                "Malhi, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          6,
          0,
          [],
          -1
        ]
      },
      [],
      "Forensic science is the application of science to the law and encompasses a wide variety of scientific disciplines. This course introduces students to general laboratory practice, molecular biology and DNA analysis skill that are commonly used by forensic DNA scientists. Students will learn using a “hands-on” and interactive approach with many of the same tools used by professional forensic DNA scientists.",
      []
    ],
    "ANTH 243": [
      "Sociality of the Great Apes",
      {
        "1": [
          "30057",
          [
            [
              7,
              "R",
              "116 Davenport Hall",
              4,
              [
                "Stumpf, R"
              ],
              -1,
              -1,
              -1
            ],
            [
              7,
              "T",
              "ONLINE",
              0,
              [
                "Stumpf, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Examines the social organization, mating patterns, and group structure of free-ranging chimpanzees, gorillas, and orangutans. Presents historical perspective focusing on misconceptions that have colored our understanding of ape social behavior; addresses questions concerned with learning potential, food sharing, social cooperation, aggressive behavior, self-awareness, and the appropriateness of the apes as models for understanding human behavior.",
      []
    ],
    "ANTH 240": [
      "Biological Anthropology",
      {
        "ADA": [
          "30050",
          [
            [
              8,
              "F",
              "116 Davenport Hall",
              4,
              [
                "Jelinek, P",
                "Pierson, Z",
                "Winful, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ],
        "ADB": [
          "30051",
          [
            [
              5,
              "F",
              "116 Davenport Hall",
              4,
              [
                "Jelinek, P",
                "Pierson, Z",
                "Winful, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ],
        "AL1": [
          "30054",
          [
            [
              5,
              "MW",
              "307 Gregory Hall",
              2,
              [
                "Jelinek, P",
                "Winful, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "[IAI Code: S1902] Past and present evolution of the human species and population and individual biological variation; topics include genetic principles relevant to human evolution, primate phylogeny and behavior, fossil evidence for human evolution, and the origin and significance of biological diversity in modern humans.",
      []
    ],
    "ANTH 246": [
      "Forensic Science",
      {
        "OL2": [
          "70382",
          [
            [
              6,
              "",
              "ONLINE",
              0,
              [
                "Houkes, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ],
        "ONL": [
          "63359",
          [
            [
              6,
              "",
              "ONLINE",
              0,
              [
                "Reich, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "History and theory underlying methods used in forensic science. Topics include the courtroom, the units of a crime laboratory, methods of securing and investigating a crime scene, and the analysis of evidence collected from a crime scene such as blood, fibers, hair, DNA, and fingerprints.",
      []
    ],
    "ANTH 250": [
      "The World Through Museums",
      {
        "1": [
          "57616",
          [
            [
              5,
              "MWF",
              "1010 Wymer Hall",
              0,
              [
                "Frankenberg, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as MUSE 250. See MUSE 250.",
      []
    ],
    "ANTH 261": [
      "Intro to the African Diaspora",
      {
        "A": [
          "69411",
          [
            [
              4,
              "MW",
              "1064 Lincoln Hall",
              3,
              [
                "Smalls, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as AFRO 261. See AFRO 261.",
      []
    ],
    "ANTH 270": [
      "Language in Culture",
      {
        "AD1": [
          "30078",
          [
            [
              5,
              "F",
              "326 David Kinley Hall",
              8,
              [
                "Calhoun, K",
                "Hernandez, O"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ],
        "AD2": [
          "30080",
          [
            [
              9,
              "F",
              "326 David Kinley Hall",
              8,
              [
                "Calhoun, K",
                "Hernandez, O"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ],
        "AD3": [
          "43580",
          [
            [
              5,
              "F",
              "322 David Kinley Hall",
              8,
              [
                "Calhoun, K",
                "Pilibbossian, H"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ],
        "AD4": [
          "58654",
          [
            [
              9,
              "F",
              "322 David Kinley Hall",
              8,
              [
                "Calhoun, K",
                "Pilibbossian, H"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ],
        "AL1": [
          "30081",
          [
            [
              12,
              "MW",
              "132 Bevier Hall",
              13,
              [
                "Calhoun, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Examines the intersections of culture and language. Topics include the definition of language; the cultural shaping of discourse and narrative; how different linguistic systems guide speakers to think differently about the world; and how ideologies about language relate to beliefs about the nation, modernity, race, and gender.",
      []
    ],
    "ANTH 272": [
      "Language and Culture in Turkey",
      {
        "A": [
          "70895",
          [
            [
              4,
              "T",
              "Location Pending",
              0,
              [
                "Ozcan, A",
                "Saadah, E"
              ],
              -1,
              -1,
              -1
            ],
            [
              4,
              "R",
              "ONLINE",
              0,
              [
                "Ozcan, A",
                "Saadah, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as GLBL 272, SAME 272, and TURK 270. See TURK 270.",
      []
    ],
    "ANTH 342": [
      "Animal Behavior",
      {
        "A": [
          "56887",
          [
            [
              22,
              "MWF",
              "2079 Natural History Building",
              0,
              [
                "Legare, T",
                "Suarez, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as ANSC 366, IB 329, and PSYC 329. See IB 329.",
      []
    ],
    "ANTH 278": [
      "Climate Change & Civilization",
      {
        "1": [
          "56878",
          [
            [
              4,
              "TR",
              "157 Noyes Laboratory",
              0,
              [
                "Lucero, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Examination of how climate change impacts society. With the increasing need to understand how climate changes and society intersect at present, it is becoming important that we address critical questions about how lessons from the past inform present needs. Case studies from around the world are discussed.",
      []
    ],
    "ANTH 347": [
      "Human Osteology",
      {
        "AS1": [
          "74334",
          [
            [
              9,
              "MW",
              "116 Davenport Hall",
              4,
              [
                "Konigsberg, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ],
        "AY1": [
          "74335",
          [
            [
              9,
              "F",
              "116 Davenport Hall",
              4,
              [
                "Diaz, J",
                "Konigsberg, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ],
        "AY2": [
          "74336",
          [
            [
              10,
              "F",
              "116 Davenport Hall",
              4,
              [
                "Diaz, J",
                "Konigsberg, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Comprehensive knowledge of the human skeleton is central to reconstructing the anatomy, demography, health and evolution of past populations because most of our evidence is derived from preserved skeletal and dental remains. The primary goal of this course is the identification of isolated and fragmentary skeletal remains given that this is a prerequisite to all subsequent analysis. In addition to identifying the bones and landmarks of the human skeleton, students will learn about the structure and function of bone, understand the growth and development of the human skeleton and be introduced to analytical techniques used in human osteology including paleopathology, paleodemography and forensics.",
      []
    ],
    "ANTH 352": [
      "Language and Gender",
      {
        "1": [
          "75699",
          [
            [
              7,
              "TR",
              "313 Gregory Hall",
              2,
              [
                "Kramer, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "The relationship between language and gender is complex, contentious, and often misunderstood. In this course, we explore the many connections between language and gender. Topics include what gender is and how it is socially and linguistically constituted; real and perceived differences — grammatical, phonological, conversational — in how men and women speak; how the ways we talk about gender shape the ways we think about gender; and how all of these things vary cross-culturally and cross-linguistically.",
      []
    ],
    "ANTH 288": [
      "American Indians of Illinois",
      {
        "AL1": [
          "30092",
          [
            [
              4,
              "TR",
              "108 English Building",
              5,
              [
                "Rand, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "An interdisciplinary survey of the Native American experience in the Illinois region from pre-Columbian times to the present. Introduces theories, concepts and methods in archaeology, history, and sociocultural anthropology. Includes archaeological field site and museum visits, plus guest lectures by American Indian scholars and community members.",
      []
    ],
    "ANTH 287": [
      "Contemporary East Asia",
      {
        "A": [
          "62021",
          [
            [
              7,
              "TR",
              "140 Burrill Hall",
              14,
              [
                "Pu, Y"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as EALC 288. See EALC 288.",
      []
    ],
    "ANTH 361": [
      "Ecology and Human Health",
      {
        "A": [
          "56918",
          [
            [
              3,
              "TR",
              "213 Gregory Hall",
              2,
              [
                "Allan, B",
                "McFarland, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      null,
      []
    ],
    "ANTH 368": [
      "'America' in the World",
      {
        "1": [
          "70378",
          [
            [
              3,
              "TR",
              "389 Education Building",
              6,
              [
                "Dominguez, V"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Study of the lure and rejection of the U.S. around the world, by drawing on long-standing anthropological approaches to the histories of peoplehood, selfhood, and otherness. Examines the historical, political, cultural, economic, and social context of both anti- and pro-Americanism, in various parts of the globe.",
      []
    ],
    "ANTH 372": [
      "Topics in Lang & Culture",
      {
        "3": [
          "65188",
          [
            [
              13,
              "TR",
              "326 David Kinley Hall",
              8,
              [
                "Calhoun, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Advanced topics in language and culture.",
      []
    ],
    "ANTH 387": [
      "Anthropology of Crime",
      {
        "1": [
          "77893",
          [
            [
              7,
              "TR",
              "219 David Kinley Hall",
              8,
              [
                "Moodie, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "This course takes an anthropological perspective to challenge \"common-sense\" notions about crime. We will compare ideas about and representations of lawbreaking, criminality, danger, policing, and violence in different parts of the world, considering how they diverge from, and yet also overlap with, each other. Our goal is to find new ways to understand both how something becomes \"crime\" and also how it then quickly becomes sensationalized, stereotyped and simplified as it enters public debate.",
      []
    ],
    "ANTH 390": [
      "Individual Study",
      {
        "": [
          "10274",
          [
            [
              6,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Supervised reading and research on anthropological topics chosen by the student with staff approval. Especially (but not exclusively) for students who are preparing for a summer field-work project, or who have some justifiable reason for doing independent study, but who do not qualify for the honors (departmental distinction) courses.",
      []
    ],
    "ANTH 399": [
      "Special Topics",
      {
        "AD1": [
          "68903",
          [
            [
              12,
              "W",
              "329 Armory",
              1,
              [
                "Vaez Afshar, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          6,
          0,
          [],
          -1
        ],
        "AD2": [
          "68904",
          [
            [
              22,
              "W",
              "329 Armory",
              1,
              [
                "Vaez Afshar, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          6,
          0,
          [],
          -1
        ],
        "AD3": [
          "68905",
          [
            [
              43,
              "W",
              "329 Armory",
              1,
              [
                "Vaez Afshar, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          6,
          0,
          [],
          -1
        ],
        "AL1": [
          "68881",
          [
            [
              26,
              "TR",
              "1302 Everitt Laboratory",
              18,
              [
                "Shackelford, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Topics are given on a one-time only, experimental basis. Faculty offer special topics in their areas of expertise that provide an opportunity for undergraduates to be exposed to some of the most current developments in faculty research.",
      []
    ],
    "ANTH 379": [
      "Medical Anthropology",
      {
        "1": [
          "69108",
          [
            [
              41,
              "MW",
              "326 David Kinley Hall",
              8,
              [
                "Rabanes, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "An anthropological approach is used to explore human health by integrating perspectives from biological and medical anthropology, as well as human biology. By the end of the course, students will be able to conceptualize health holistically, encompassing wellness and well-being. They will learn how to define, measure, and incorporate embodiment theory using genetic, epigenetic, and human biological methods. Students will also gain a strong understanding of the biological mechanisms through which environmental factors influence health outcomes and contribute to health disparities.",
      []
    ],
    "ANTH 420": [
      "Case Studies Global Heritage",
      {
        "1G": [
          "54620",
          [
            [
              74,
              "T",
              "209A Davenport Hall",
              4,
              [
                "Riggs, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ],
        "1U": [
          "54619",
          [
            [
              74,
              "T",
              "209A Davenport Hall",
              4,
              [
                "Riggs, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Cultural heritage encompasses major domains of social, economic, political, religious and environmental practice and policy-making under today's conditions of globalization. Students will critically examine cultural heritage case studies from around the world.",
      []
    ],
    "ANTH 411": [
      "Research Methods in Socio-Cultural Anthropology",
      {
        "1G": [
          "30142",
          [
            [
              3,
              "TR",
              "230 Davenport Hall",
              4,
              [
                "Orta, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ],
        "1U": [
          "77896",
          [
            [
              3,
              "TR",
              "230 Davenport Hall",
              4,
              [
                "Delfino, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Exploration of qualitative forms of research used by sociocultural anthropologists when conducting field research. Emphasis is on formulating research questions, research design, and application of these ethnographic methods to a substantial research project.",
      []
    ],
    "ANTH 432": [
      "Genes and Behavior",
      {
        "AL1": [
          "48569",
          [
            [
              25,
              "TR",
              "2020 Natural History Building",
              0,
              [
                "Barley, T",
                "Dolezal, A",
                "Prayugo, V"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as IB 432, NEUR 432, and PSYC 432. See IB 432.",
      []
    ],
    "ANTH 436": [
      "Biogeography",
      {
        "A": [
          "52942",
          [
            [
              13,
              "TR",
              "2083 Natural History Building",
              0,
              [
                "Punyasena, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as ESE 439, GGIS 436, IB 439 and NRES 441. See IB 439.",
      []
    ],
    "ANTH 426": [
      "Narrative",
      {
        "1G": [
          "78171",
          [
            [
              4,
              "TR",
              "1062 Lincoln Hall",
              3,
              [
                "Kramer, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ],
        "1U": [
          "78172",
          [
            [
              4,
              "TR",
              "1062 Lincoln Hall",
              3,
              [
                "Kramer, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Narratives serve a central function in human life: at the most fundamental level, they enable us to make sense of a complex and chaotic world, but we also use narratives strategically to persuade, manipulate, create social bonds and social divisions, establish authority and deny responsibility. Narratives may be a human universal, but the rules of narrativity are intensely culturally specific. This course explores what narratives are and how they work, and considers a range of analytical techniques for studying them.",
      []
    ],
    "ANTH 444": [
      "Methods in Bioanthropology",
      {
        "": [
          "10292",
          [
            [
              6,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Supervised participation in biological anthropology research projects; techniques, methods, and procedures discussed and practiced under actual field or laboratory working conditions. Normally taken concurrently with ANTH 445.",
      []
    ],
    "ANTH 445": [
      "Research in Bioanthropology",
      {
        "": [
          "10294",
          [
            [
              6,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Analysis, interpretation, evaluation, and organization of field and laboratory data in biological anthropology; preparation of written reports on research. May be taken concurrently with ANTH 444 or subsequently.",
      []
    ],
    "ANTH 447": [
      "Advanced Skeletal Biology",
      {
        "1": [
          "67040",
          [
            [
              5,
              "MWF",
              "113 Davenport Hall",
              4,
              [
                "Konigsberg, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Human skeletal and dental remains form the basis for research in both bioarchaeology and forensic anthropology. We will examine the bases for making inferences about individual skeletons and past populations, with particular emphasis placed on paleodemography, reconstruction of diet, paleopathology, and biological distance analysis.",
      []
    ],
    "ANTH 450": [
      "Zooarchaeology",
      {
        "1G": [
          "72329",
          [
            [
              71,
              "M",
              "116 Davenport Hall",
              4,
              [
                "Bishop, K",
                "Evans, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          7,
          0,
          [],
          -1
        ],
        "1U": [
          "72330",
          [
            [
              71,
              "M",
              "116 Davenport Hall",
              4,
              [
                "Bishop, K",
                "Evans, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Zooarchaeology is the study of the many ways that animals fit into past human societies—including diet, economy, and ideology—through the analysis of animal remains (bones, teeth, and shell) recovered from archaeological sites. Given the broad range of ways that animals were involved in past human life, and the ubiquity of faunal remains in the archaeological record, faunal analysis is a method suitable for addressing many kinds of archaeological and anthropological research questions. This course will provide students with a practical working knowledge of basic laboratory identification and quantification techniques, and provide a framework for the interpretation of archaeological faunal assemblages.",
      []
    ],
    "ANTH 451": [
      "Archaeological Surveying",
      {
        "1G": [
          "39023",
          [
            [
              7,
              "TR",
              "209A Davenport Hall",
              4,
              [
                "Ritchison, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          7,
          0,
          [],
          -1
        ],
        "1U": [
          "50155",
          [
            [
              7,
              "TR",
              "209A Davenport Hall",
              4,
              [
                "Ritchison, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Familiarization with methods used in the location and recording of archaeological sites, including techniques of mapping especially adapted to the needs of archaeology; attention given to means of presenting results and interpreting data derived from this work; and work both in the field and in the laboratory.",
      []
    ],
    "ANTH 454": [
      "Archaeological Field School",
      {
        "": [
          "10298",
          [
            [
              6,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Participation in archaeological excavations; techniques, methods, and procedures discussed and practiced under actual working conditions. Normally taken concurrently with ANTH 455.",
      []
    ],
    "ANTH 455": [
      "Lab Analysis in Archaeology",
      {
        "": [
          "10301",
          [
            [
              6,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Laboratory work including processing, classifying, dating, interpretation, evaluation, and preparation of written reports of archaeological research. May be taken concurrently with ANTH 454 or subsequently.",
      []
    ],
    "ANTH 461": [
      "Hist of Archaeological Theory",
      {
        "1G": [
          "46176",
          [
            [
              34,
              "W",
              "109A Davenport Hall",
              4,
              [
                "Ambrose, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ],
        "1U": [
          "46175",
          [
            [
              34,
              "W",
              "109A Davenport Hall",
              4,
              [
                "Ambrose, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Examines the prominent theories in archaeology from its inception to the present day and does so within the context of general developments in anthropological thought. Provides a foundation for graduate students and a capstone for major emphasizing archaeology.",
      []
    ],
    "ANTH 468": [
      "Primate Microbial Seminar",
      {
        "1G": [
          "75704",
          [
            [
              21,
              "R",
              "109A Davenport Hall",
              4,
              [
                "Stumpf, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ],
        "1U": [
          "75705",
          [
            [
              21,
              "R",
              "109A Davenport Hall",
              4,
              [
                "Stumpf, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "This bioanthropology research seminar is focused on interdisciplinary projects for undergraduate and graduate students. Students will create individualized projects related to biological anthropology, primatology, ecology, microbe-host interactions, evolution, endocrinology, ontogeny or closely-related areas. Additional emphasis will be placed on developing presentation skills and scientific paper writing.",
      []
    ],
    "ANTH 462": [
      "Museum Theory and Practice",
      {
        "1G": [
          "46499",
          [
            [
              9,
              "MWF",
              "1010 Wymer Hall",
              0,
              [
                "Frankenberg, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ],
        "1U": [
          "46498",
          [
            [
              9,
              "MWF",
              "1010 Wymer Hall",
              0,
              [
                "Frankenberg, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "A foundational introduction to museology consisting of a critical examination of the history and social life of museums and how museums have been studied by scholars in a range of academic disciplines. Includes visits to campus and local museums.",
      []
    ],
    "ANTH 467": [
      "Cultures of Africa",
      {
        "1G": [
          "50157",
          [
            [
              2,
              "M",
              "209A Davenport Hall",
              4,
              [
                "Smalls, K",
                "Telep, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ],
        "1U": [
          "50156",
          [
            [
              2,
              "M",
              "209A Davenport Hall",
              4,
              [
                "Smalls, K",
                "Telep, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Culture and social organization in traditional African societies with emphasis on the politics, kinship, and religion of a small sample of societies illustrating the main cultural variations found in sub-Saharan Africa; some discussion of ecological factors and ethnic group relations in precolonial times.",
      []
    ],
    "ANTH 496": [
      "Individual Field Research",
      {
        "": [
          "10304",
          [
            [
              6,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Supervised participation in field research in ethnography, ethnology, linguistics, or social anthropology; techniques, methods, and procedures discussed and practiced under actual working conditions.",
      []
    ],
    "ANTH 495": [
      "Honors Senior Thesis II",
      {
        "": [
          "10284",
          [
            [
              6,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "The second of a two-term individual study and research project for those students who are candidates for departmental distinction in anthropology.",
      []
    ],
    "ANTH 497": [
      "Individual Field Data Analysis",
      {
        "": [
          "10310",
          [
            [
              6,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Analysis, interpretation, evaluation, and organization of field data in cultural anthropology; preparation of written reports on research in ethnography, ethnology, linguistics, or social anthropology. May be taken concurrently with ANTH 496 or subsequently.",
      []
    ],
    "ANTH 499": [
      "Topics in Anthropology",
      {
        "AO": [
          "30170",
          [
            [
              2,
              "W",
              "209A Davenport Hall",
              4,
              [
                "Orta, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Research seminar on specialized topics in anthropology.",
      []
    ],
    "ANTH 511": [
      "Research Proposal Seminar",
      {
        "1": [
          "43615",
          [
            [
              74,
              "M",
              "109A Davenport Hall",
              4,
              [
                "Lucero, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "This seminar guides graduate students in designing a doctoral research project and writing a grant proposal. Focus is on developing a cogent theoretical framework, articulating significance of the project, identifying appropriate research methods, and considering ethical issues. Seminar format allows regular feedback from peers to clarify and hone ideas. Prerequisite: Graduate standing in anthropology or consent of instructor.",
      []
    ],
    "ANTH 565": [
      "Race and Cultural Critique",
      {
        "A": [
          "52841",
          [
            [
              17,
              "T",
              "ARR 1208 W Nevada",
              0,
              [
                "Rana, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as AAS 561, AFRO 531, GWS 561, and LLS 561. See AAS 561.",
      []
    ],
    "ANTH 504": [
      "Colonialism & Postcolonialism",
      {
        "1": [
          "56944",
          [
            [
              18,
              "R",
              "1126 Literatures, Cultures, & Ling",
              0,
              [
                "Baul, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          9,
          0,
          [],
          -1
        ]
      },
      [],
      "Course examines the history of colonialism and post-colonialism in anthropological perspective. The relations of history and anthropology are explored through ethnographic studies that problematize historical memory. Theoretical works about colonized people will be debated and discussed.",
      []
    ],
    "ANTH 589": [
      "Readings in Anthropology",
      {
        "": [
          "10319",
          [
            [
              6,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Individual guidance in intensive readings in the literature of one or more subdivisions of the field of anthropology, selected in consultation with the adviser in accordance with the needs and interest of the student.",
      []
    ],
    "ANTH 594": [
      "Cultural Heritage",
      {
        "DFR": [
          "50110",
          [
            [
              2,
              "T",
              "325 Temple Hoyne Buell Hall",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      null,
      []
    ],
    "ANTH 590": [
      "Dissertation Readings",
      {
        "": [
          "10327",
          [
            [
              6,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          16,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Supervised individual investigation or study of a topic not covered by regular courses. The topic selected by the student and the proposed plan of study are approved by the adviser and the staff member who supervises the work.",
      []
    ],
    "ANTH 515": [
      "Seminar in Anthropology",
      {
        "AC": [
          "30180",
          [
            [
              74,
              "W",
              "209A Davenport Hall",
              4,
              [
                "Cortez, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          11,
          0,
          [],
          -1
        ],
        "FH": [
          "65206",
          [
            [
              2,
              "T",
              "ONLINE",
              0,
              [
                "Harrison, F"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ],
        "JD2": [
          "67022",
          [
            [
              71,
              "F",
              "109A Davenport Hall",
              4,
              [
                "Desmond, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          11,
          0,
          [],
          -1
        ],
        "MK2": [
          "51080",
          [
            [
              3,
              "TR",
              "ONLINE",
              0,
              [
                "Koven, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ],
        "SC2": [
          "50204",
          [
            [
              75,
              "W",
              "133 1207 W Oregon",
              0,
              [
                "Rosas, G"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          11,
          0,
          [],
          -1
        ],
        "ST": [
          "30178",
          [
            [
              2,
              "T",
              "109A Davenport Hall",
              4,
              [
                "Telep, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          11,
          0,
          [],
          -1
        ]
      },
      [],
      "Analysis of selected topics of special interest in anthropology.",
      []
    ]
  },
  "caches": {
    "periods": [
      "1600 - 1715",
      "0930 - 1045",
      "1400 - 1650",
      "1230 - 1350",
      "1100 - 1220",
      "1000 - 1050",
      "0000 - 0000",
      "1400 - 1520",
      "0900 - 0950",
      "1100 - 1150",
      "1200 - 1250",
      "1300 - 1350",
      "1400 - 1450",
      "0930 - 1050",
      "1400 - 1550",
      "1500 - 1720",
      "1600 - 1720",
      "1400 - 1720",
      "1300 - 1450",
      "0800 - 0950",
      "1500 - 1650",
      "0900 - 1150",
      "1500 - 1550",
      "0900 - 1020",
      "1400 - 1630",
      "0800 - 0920",
      "1530 - 1650",
      "0800 - 0850",
      "1700 - 1820",
      "1530 - 1620",
      "2000 - 2050",
      "1200 - 1550",
      "1230 - 1620",
      "0830 - 0920",
      "1500 - 1750",
      "1300 - 1650",
      "0800 - 1150",
      "1700 - 1850",
      "1500 - 1620",
      "0900 - 1050",
      "1100 - 1250",
      "1200 - 1320",
      "1600 - 1750",
      "1600 - 1650",
      "1000 - 1120",
      "1130 - 1250",
      "1030 - 1150",
      "1600 - 1730",
      "1300 - 1420",
      "1330 - 1520",
      "1530 - 1710",
      "1230 - 1320",
      "1430 - 1550",
      "1630 - 1750",
      "1730 - 1850",
      "1730 - 1920",
      "1000 - 1150",
      "1530 - 1820",
      "1700 - 1750",
      "1100 - 1215",
      "0800 - 0959",
      "1530 - 1730",
      "1500 - 1700",
      "1700 - 1900",
      "1730 - 1930",
      "0600 - 0730",
      "1700 - 1950",
      "1200 - 1450",
      "1500 - 1730",
      "0930 - 1020",
      "1730 - 2030",
      "1300 - 1550",
      "1730 - 1900",
      "1830 - 1950",
      "1100 - 1350",
      "1800 - 2050"
    ],
    "dateRanges": [],
    "scheduleTypes": [
      "Lecture-Discussion",
      "Online",
      "Discussion/ Recitation",
      "Lecture",
      "Independent Study",
      "Online Lecture",
      "Laboratory",
      "Laboratory-Discussion",
      "Online Discussion",
      "Conference",
      "Online Lecture Discussion",
      "Seminar",
      "Internship",
      "Study Abroad",
      "Research",
      "Travel"
    ],
    "campuses": [],
    "attributes": [],
    "restrictions": [],
    "gradeBases": [],
    "locations": [
      {
        "lat": null,
        "long": null
      },
      {
        "lat": 40.1047599,
        "long": -88.2319514
      },
      {
        "lat": 40.105732,
        "long": -88.2281018
      },
      {
        "lat": 40.1065684,
        "long": -88.2281746
      },
      {
        "lat": 40.1072225,
        "long": -88.2262016
      },
      {
        "lat": 40.107534,
        "long": -88.2281548
      },
      {
        "lat": 40.1020773,
        "long": -88.2296394
      },
      {
        "lat": 40.11246109008789,
        "long": -88.22831726074219
      },
      {
        "lat": 40.1035833,
        "long": -88.228405
      },
      {
        "lat": 40.1035872,
        "long": -88.2306061
      },
      {
        "lat": 40.0995003,
        "long": -88.223104
      },
      {
        "lat": 40.101862,
        "long": -88.231737
      },
      {
        "lat": 40.1034533,
        "long": -88.2327596
      },
      {
        "lat": 40.104794,
        "long": -88.224264
      },
      {
        "lat": 40.103587,
        "long": -88.230606
      },
      {
        "lat": 40.107811,
        "long": -88.2260761
      },
      {
        "lat": 40.1033599,
        "long": -88.2292111
      },
      {
        "lat": 40.1083446,
        "long": -88.2282555
      },
      {
        "lat": 40.1109722,
        "long": -88.2282631
      },
      {
        "lat": 40.1108856,
        "long": -88.2269806
      },
      {
        "lat": 40.1131317,
        "long": -88.2264552
      },
      {
        "lat": 40.1110937,
        "long": -88.2232348
      },
      {
        "lat": 40.1149296,
        "long": -88.2280589
      },
      {
        "lat": 40.111691,
        "long": -88.2242511
      },
      {
        "lat": 40.1149521,
        "long": -88.2267561
      },
      {
        "lat": 40.1028373,
        "long": -88.2251326
      }
    ],
    "finalDates": [],
    "finalTimes": []
  }
}