{
  "subject": "ASTR",
  "scrapedAt": 1768434211057,
  "courseCount": 18,
  "courses": {
    "ASTR 210": [
      "Introduction to Astrophysics",
      {
        "1": [
          "30855",
          [
            [
              17,
              "MWF",
              "2233 Everitt Laboratory",
              11,
              [
                "Young, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ],
        "2": [
          "63574",
          [
            [
              23,
              "MWF",
              "2233 Everitt Laboratory",
              11,
              [
                "Young, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Survey of modern astronomy for students with background in physics. Topics include: the solar system; nature and evolution of stars; white dwarfs, neutron stars, and black holes; galaxies, quasars and dark matter; large scale structure of the universe; the Big Bang; and Inflation. Emphasis will be on the physical principles underlying the astronomical phenomena.",
      []
    ],
    "ASTR 350": [
      "The Big Bang, Black Holes, and the End of the Universe",
      {
        "CHP": [
          "48250",
          [
            [
              21,
              "MWF",
              "134 Astronomy Building",
              0,
              [
                "Fields, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Studies the origin, evolution, and eventual fate of the universe, and the scientific tools used to study these issues. Topics include aspects of special and general relativity; curved spacetime; the Big Bang; inflation; primordial element synthesis; the cosmic microwave background; dark matter and the formation of galaxies; observational evidence for dark matter, dark energy, and black holes.",
      []
    ],
    "ASTR 310": [
      "Computing in Astronomy",
      {
        "1": [
          "68851",
          [
            [
              20,
              "TR",
              "2039 Campus Instructional Facility",
              1,
              [
                "Ricker, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "An introduction to the use of computers in astrophysics research. Topics covered include a basic introduction to computing hardware concepts, Unix shell commands, programming in Python, data structures, astronomical libraries, modern software engineering concepts and tools, plotting and visualization of data, and fundamental numerical algorithms. Applications and examples drawn from astrophysics are stressed throughout.",
      []
    ],
    "ASTR 121": [
      "Solar System and Worlds Beyond",
      {
        "AD1": [
          "30816",
          [
            [
              12,
              "F",
              "207 Gregory Hall",
              6,
              [
                "Moon, Y",
                "Winans, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          8,
          0,
          [],
          -1
        ],
        "AD2": [
          "30820",
          [
            [
              21,
              "F",
              "207 Gregory Hall",
              6,
              [
                "Moon, Y",
                "Winans, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          8,
          0,
          [],
          -1
        ],
        "AD3": [
          "30823",
          [
            [
              22,
              "F",
              "207 Gregory Hall",
              6,
              [
                "Moon, Y",
                "Winans, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          8,
          0,
          [],
          -1
        ],
        "AD4": [
          "30825",
          [
            [
              16,
              "F",
              "207 Gregory Hall",
              6,
              [
                "Rodriguez-Bueno, J",
                "Winans, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          8,
          0,
          [],
          -1
        ],
        "AD5": [
          "30828",
          [
            [
              17,
              "F",
              "207 Gregory Hall",
              6,
              [
                "Rodriguez-Bueno, J",
                "Winans, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          8,
          0,
          [],
          -1
        ],
        "AD6": [
          "30831",
          [
            [
              23,
              "F",
              "207 Gregory Hall",
              6,
              [
                "Rodriguez-Bueno, J",
                "Winans, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          8,
          0,
          [],
          -1
        ],
        "AD8": [
          "57295",
          [
            [
              23,
              "F",
              "ONLINE",
              0,
              [
                "Winans, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          11,
          0,
          [],
          -1
        ],
        "AL1": [
          "30832",
          [
            [
              16,
              "MW",
              "3031 Campus Instructional Facility",
              1,
              [
                "Winans, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "[IAI Code: P1906] Introductory survey of the Solar System; structure and motions of the Earth and Moon; planetary motions; natures and characteristics of the planets and smaller solar system bodies; planetary moons and rings; meteors, meteoroids, and meteorites; properties of the Sun; origin and evolution of the Solar System; discovery of extrasolar planetary systems; architecture of extrasolar planetary systems and comparison to our solar system; habitable extrasolar planets. Emphasis will be placed on problem-solving and scientific methods.",
      []
    ],
    "ASTR 330": [
      "Extraterrestrial Life",
      {
        "ONL": [
          "63575",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Dunne, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Scientific discussion of the search for extraterrestrial life. Topics include: cosmic evolution (protons to heavy elements to molecules); terrestrial evolution (chemical, biological, and cultural); high technology searches for extraterrestrial life in the solar system (Mars, Venus, outer planets); and beyond the solar system (Drake equation and current SETI projects).",
      []
    ],
    "ASTR 100": [
      "Introduction to Astronomy",
      {
        "A": [
          "57339",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Winans, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "B": [
          "57338",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Winans, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "[IAI Code: P1906] Introduces the student to the basic concepts of modern astronomy. Covers topics including the night sky; the solar system and its origin; the nature and evolution of stars; stellar remnants, including white dwarfs, neutron stars, and black holes; extrasolar planetary systems; galaxies and quasars; dark matter and dark energy; the Big Bang and the fate of the universe; and life in the universe.",
      []
    ],
    "ASTR 390": [
      "Individual Study",
      {
        "": [
          "10396",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Individual study at an advanced undergraduate level.",
      []
    ],
    "ASTR 401": [
      "Scientific Writing for Astronomy",
      {
        "1": [
          "30858",
          [
            [
              30,
              "F",
              "ONLINE",
              0,
              [
                "Mouschovias, T"
              ],
              -1,
              -1,
              -1
            ],
            [
              23,
              "W",
              "ONLINE",
              0,
              [
                "Mouschovias, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          12,
          0,
          [],
          -1
        ]
      },
      [],
      "Development of journal-style writing skills. Papers written in accordance with The Astrophysical Journal or The Monthly Notices of the Royal Astronomical Society Manuals of Style on topics approved by the instructor. Emphasis on developing adequate and critical coverage of the topic, brevity compatible with clarity, and effective presentation. Proper sentence, paragraph, section and subsection structure (including Abstract and Introduction, Figures and Captions), citation, footnotes, and bibliography are covered.",
      []
    ],
    "ASTR 122": [
      "Stars and Galaxies",
      {
        "AD1": [
          "30834",
          [
            [
              12,
              "R",
              "382 Education Building",
              5,
              [
                "Engholm, A",
                "Shen, Y"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          8,
          0,
          [],
          -1
        ],
        "AD2": [
          "30836",
          [
            [
              21,
              "R",
              "382 Education Building",
              5,
              [
                "Engholm, A",
                "Shen, Y"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          8,
          0,
          [],
          -1
        ],
        "AD3": [
          "30839",
          [
            [
              22,
              "R",
              "382 Education Building",
              5,
              [
                "Engholm, A",
                "Shen, Y"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          8,
          0,
          [],
          -1
        ],
        "AD4": [
          "30840",
          [
            [
              16,
              "R",
              "382 Education Building",
              5,
              [
                "Shen, Y",
                "Yin, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          8,
          0,
          [],
          -1
        ],
        "AD5": [
          "30841",
          [
            [
              17,
              "R",
              "382 Education Building",
              5,
              [
                "Shen, Y",
                "Yin, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          8,
          0,
          [],
          -1
        ],
        "AD6": [
          "30842",
          [
            [
              23,
              "R",
              "382 Education Building",
              5,
              [
                "Shen, Y",
                "Yin, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          8,
          0,
          [],
          -1
        ],
        "AD8": [
          "57296",
          [
            [
              22,
              "R",
              "134 Astronomy Building",
              0,
              [
                "Shen, Y"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          8,
          0,
          [],
          -1
        ],
        "AL1": [
          "30845",
          [
            [
              21,
              "MW",
              "1024 Chemistry Annex",
              12,
              [
                "Shen, Y"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduction to celestial objects and phenomena beyond the Solar System, and their governing basic physical principles; galaxies, quasars, and structure of the universe; dark matter and dark energy; the Big Bang and the fate of the universe; the Milky Way; the interstellar medium and the birth of stars; stellar distances, motions, radiation, structure, evolution, and remnants, including neutron stars and black holes. Emphasis will be placed on problem-solving and scientific methods.",
      []
    ],
    "ASTR 405": [
      "Planetary Systems",
      {
        "1": [
          "39316",
          [
            [
              22,
              "MWF",
              "112 Transportation Building",
              0,
              [
                "Young, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Traces, from a physical perspective, the evolution of planetary systems from star formation in molecular clouds to the emergence of habitable worlds. Topics include the properties of HII regions and molecular clouds, gravitational collapse and disk formation, formation of planetesimals and planets, dynamics of the solar system, physics of planetary atmospheres, properties of individual planets and their rings and satellites, detection and characterization of extra-solar planets, and searches for life in the Solar System and beyond.",
      []
    ],
    "ASTR 490": [
      "Senior Thesis",
      {
        "": [
          "63598",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Research with thesis, under the direction of a faculty member in astronomy. This course is recommended for all students who plan to do research and graduate study, and it is a prerequisite for graduation with highest distinction in astronomy. In the term preceding their initial enrollment, those interested in taking the course should consult with an academic advisor as well as the potential research advisor. A thesis must be presented for credit to be received.",
      []
    ],
    "ASTR 593": [
      "Astronomy Internship",
      {
        "DGS": [
          "71288",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Fields, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          0,
          10,
          0,
          [],
          -1
        ]
      },
      [],
      "Full-time or part-time practice of graduate-level astronomy and astrophysics in an off-campus government, industrial, or research facility environment. Summary report required.",
      []
    ],
    "ASTR 507": [
      "Physical Cosmology",
      {
        "1": [
          "57083",
          [
            [
              17,
              "MWF",
              "134 Astronomy Building",
              0,
              [
                "Barrow, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "A survey of the essentials of modern cosmology, providing an overview of the state of the field, of open questions, and of observational and theoretical tools. Topics include: classical cosmology--the Friedmann universe; the early universe--inflation, nucleosynthesis, dark matter; the cosmic microwave background--basic physics, anisotropies, polarization; large scale structure formation--theoretical models and observational tests; dark energy--observational evidence, theoretical ideas. Emphasizes applying physical principles to understand observations, and on using observations to constrain the nature of matter and spacetime on cosmic scales--viewing the universe as a laboratory for fundamental physics. Course work focuses heavily on problem solving.",
      []
    ],
    "ASTR 414": [
      "Astronomical Techniques",
      {
        "AT": [
          "43741",
          [
            [
              17,
              "MWF",
              "158 Loomis Laboratory",
              8,
              [
                "Kemball, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduction to techniques used in modern optical and radio astronomy with emphasis on the physical and mathematical understanding of the detection of electromagnetic radiation; includes such topics as fundamental properties of radio and optical telescopes and the detectors that are used with telescopes. Lectures and laboratory.",
      []
    ],
    "ASTR 496": [
      "Seminar in Astronomy",
      {
        "RAD": [
          "46918",
          [
            [
              31,
              "MW",
              "134 Astronomy Building",
              0,
              [
                "Looney, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Lectures on topics of current interest in astronomy and astrophysics; for advanced undergraduates and graduates. See Class Schedule for current topics.",
      []
    ],
    "ASTR 406": [
      "Galaxies and the Universe",
      {
        "1": [
          "61936",
          [
            [
              12,
              "MWF",
              "134 Astronomy Building",
              0,
              [
                "French, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Nature of the Milky Way galaxy: stellar statistics and distributions, stellar populations, spiral structure, the nucleus and halo. Nature of ordinary galaxies; galaxies in our Local Group, structure of voids and superclusters. Nature of peculiar objects: Seyfert galaxies, starburst galaxies, and quasars. Elementary aspects of physical cosmology.",
      []
    ],
    "ASTR 596": [
      "Seminar in Special Topics",
      {
        "AI": [
          "69020",
          [
            [
              20,
              "MW",
              "134 Astronomy Building",
              0,
              [
                "Liu, X"
              ],
              -1,
              -1,
              -1
            ]
          ],
          16,
          7,
          0,
          [],
          -1
        ],
        "APA": [
          "60569",
          [
            [
              25,
              "R",
              "134 Astronomy Building",
              0,
              [
                "Fields, B",
                "Gammie, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          16,
          7,
          0,
          [],
          -1
        ],
        "CT": [
          "46316",
          [
            [
              22,
              "T",
              "236 Astronomy Building",
              0,
              [
                "Wong, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          16,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Approved for both letter and S/U grading. May be repeated. Prerequisite: Consent of instructor.",
      []
    ],
    "ASTR 590": [
      "Individual Study",
      {
        "": [
          "10399",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          16,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Individual study or non-thesis research.",
      []
    ]
  },
  "caches": {
    "periods": [
      "1600 - 1840",
      "1700 - 1940",
      "1300 - 1540",
      "0900 - 1140",
      "1400 - 1640",
      "0000 - 0000",
      "0930 - 1210",
      "1700 - 1820",
      "1130 - 1250",
      "1400 - 1700",
      "0900 - 1150",
      "0800 - 0850",
      "0900 - 0950",
      "0930 - 1050",
      "1030 - 1150",
      "0900 - 1020",
      "1200 - 1250",
      "1300 - 1350",
      "1100 - 1220",
      "1230 - 1350",
      "1400 - 1520",
      "1000 - 1050",
      "1100 - 1150",
      "1400 - 1450",
      "1500 - 1550",
      "1600 - 1650",
      "1200 - 1320",
      "1500 - 1620",
      "1530 - 1650",
      "1630 - 1750",
      "1400 - 1550",
      "1600 - 1750"
    ],
    "dateRanges": [],
    "scheduleTypes": [
      "Studio",
      "Online",
      "Laboratory",
      "Conference",
      "Independent Study",
      "Travel",
      "Seminar",
      "Lecture",
      "Discussion/ Recitation",
      "Lecture-Discussion",
      "Internship",
      "Online Discussion",
      "Online Lecture"
    ],
    "campuses": [],
    "attributes": [],
    "restrictions": [],
    "gradeBases": [],
    "locations": [
      {
        "lat": null,
        "long": null
      },
      {
        "lat": 40.11246109008789,
        "long": -88.22831726074219
      },
      {
        "lat": 40.1083446,
        "long": -88.2282555
      },
      {
        "lat": 40.1131317,
        "long": -88.2264552
      },
      {
        "lat": 40.107534,
        "long": -88.2281548
      },
      {
        "lat": 40.1020773,
        "long": -88.2296394
      },
      {
        "lat": 40.105732,
        "long": -88.2281018
      },
      {
        "lat": 40.1072225,
        "long": -88.2262016
      },
      {
        "lat": 40.1110937,
        "long": -88.2232348
      },
      {
        "lat": 40.103587,
        "long": -88.230606
      },
      {
        "lat": 40.1108856,
        "long": -88.2269806
      },
      {
        "lat": 40.1109722,
        "long": -88.2282631
      },
      {
        "lat": 40.107811,
        "long": -88.2260761
      }
    ],
    "finalDates": [],
    "finalTimes": []
  }
}