{
  "subject": "ATMS",
  "scrapedAt": 1768434212975,
  "courseCount": 26,
  "courses": {
    "ATMS 120": [
      "Severe and Hazardous Weather",
      {
        "A": [
          "39412",
          [
            [
              20,
              "TR",
              "THEAT Lincoln Hall",
              13,
              [
                "Choate, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ],
        "HA": [
          "51498",
          [
            [
              20,
              "TR",
              "THEAT Lincoln Hall",
              13,
              [
                "Choate, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Most extreme manifestations of weather and climate are analyzed in terms of their physical basis and their historical, economic and human consequences. Emphasis is placed on the interplay between technological advances, the evolution of meteorology as a science, and the impacts of extreme weather (winter storms, floods, severe thunderstorms, hurricanes, El Nino). Technological advances include satellites, weather radars and profilers, and computer models used for weather prediction.",
      []
    ],
    "ATMS 307": [
      "Climate Processes",
      {
        "A": [
          "57309",
          [
            [
              13,
              "TR",
              "137 Henry Administration Bldg",
              2,
              [
                "Raghuraman, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          9,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduces students to Earth's climates and the processes that determine them. Examines factors that control natural climate change over long and short time scales, processes by which humans impact climate and climate change, methods to predict climate change, and climate change response by policymakers.",
      []
    ],
    "ATMS 306": [
      "Cloud Physics",
      {
        "A": [
          "51095",
          [
            [
              18,
              "TR",
              "1071 Natural History Building",
              0,
              [
                "Riemer, N"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Develops an understanding of microphysical processes occurring within clouds through use of in-situ observations, modeling, and theoretical studies; topics covered include nucleation, diffusional growth of water and ice particles, the warm rain process, the cold rain process (including riming, aggregation, graupel and hail), weather modification, and an introduction to radar meteorology.",
      []
    ],
    "ATMS 140": [
      "Climate and Global Change",
      {
        "A": [
          "30894",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Hence, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduces climate change and its interactions with the global environment; surveys the physical, chemical, biological and social factors contributing to global change; includes topics such as greenhouse warming, acid rain, ozone depletion, distinguishes anthropogenic influences and natural variability of the earth system; addresses societal impacts, mitigation strategies, policy options and other human responses to global change.",
      []
    ],
    "ATMS 304": [
      "Radiative Transfer-Remote Sens",
      {
        "A": [
          "50295",
          [
            [
              22,
              "MWF",
              "1071 Natural History Building",
              0,
              [
                "Di Girolamo, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduction to the laws governing the propagation of electromagnetic radiation in the Earth's atmosphere. Topics include absorption, emission, and scattering of radiation, absorption and scattering properties of atmospheric constituents, the Sun as a source of radiation, the radiative transfer equation, and simple radiative balance models. Emphasis will be placed on the role of radiation in weather and climate, the description of atmospheric optical phenomena, and the application to remote sensing.",
      []
    ],
    "ATMS 313": [
      "Synoptic Weather Forecasting",
      {
        "AB1": [
          "57095",
          [
            [
              12,
              "F",
              "1020 Natural History Building",
              0,
              [
                "Frame, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ],
        "AE1": [
          "51090",
          [
            [
              20,
              "TR",
              "1071 Natural History Building",
              0,
              [
                "Frame, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          9,
          0,
          [],
          -1
        ]
      },
      [],
      "Examines the tools and techniques of weather forecasting, with heavy emphasis on actual forecasting. Numerical models used to forecast weather are reviewed and compared. Forecasting using numerical, statistical and probabilistic forecasting techniques is studied. Forecasts of significant winter weather, convection, floods and other weather hazards are emphasized. Students learn the process behind Severe Weather Watches and Warnings, Quantitative Precipitation Forecasts, precipitation type forecasts, flood forecasts and forecasts of other significant weather.",
      []
    ],
    "ATMS 201": [
      "General Physical Meteorology",
      {
        "A": [
          "48377",
          [
            [
              18,
              "TR",
              "3101 Sidney Lu Mech Engr Bldg",
              0,
              [
                "Choate, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          9,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduction to physical processes in the atmosphere, focusing on those relevant to weather and storms. Emphasizes quantitative problem solving. Topics include atmospheric structure, atmospheric thermodynamics, clouds, synoptic meteorology, weather forecasting, and storms. For students in atmospheric sciences, physics, mathematics, engineering, and other physical and natural sciences.",
      []
    ],
    "ATMS 207": [
      "Weather and Climate Data Science",
      {
        "A": [
          "70922",
          [
            [
              16,
              "MWF",
              "1020 Natural History Building",
              0,
              [
                "Jewett, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          9,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduces python programming fundamentals as applied to real-world problems in the atmospheric sciences. Students will develop an understanding of the structure and use of weather and climate datasets; use computers for data representation, presentation, and visualization; and implement introductory methods for weather and climate data reduction and statistical analysis.",
      []
    ],
    "ATMS 100": [
      "Introduction to Meteorology",
      {
        "ADC": [
          "48351",
          [
            [
              22,
              "R",
              "G27 Literatures, Cultures, & Ling",
              14,
              [
                "Frame, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          8,
          0,
          [],
          -1
        ],
        "ADE": [
          "30876",
          [
            [
              17,
              "R",
              "G27 Literatures, Cultures, & Ling",
              14,
              [
                "Frame, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          8,
          0,
          [],
          -1
        ],
        "ADK": [
          "30880",
          [
            [
              21,
              "F",
              "122 1203 1/2 W Nevada",
              0,
              [
                "Frame, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          8,
          0,
          [],
          -1
        ],
        "ADL": [
          "30881",
          [
            [
              22,
              "F",
              "122 1203 1/2 W Nevada",
              0,
              [
                "Frame, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          8,
          0,
          [],
          -1
        ],
        "ADM": [
          "30883",
          [
            [
              16,
              "F",
              "G7 Literatures, Cultures, & Ling",
              14,
              [
                "Frame, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          8,
          0,
          [],
          -1
        ],
        "ADN": [
          "30885",
          [
            [
              17,
              "F",
              "G27 Literatures, Cultures, & Ling",
              14,
              [
                "Frame, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          8,
          0,
          [],
          -1
        ],
        "AL2": [
          "39350",
          [
            [
              17,
              "MW",
              "1092 Lincoln Hall",
              13,
              [
                "Frame, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "[IAI Code: P1910] Introduces the student to the basic concepts and principles of meteorology via the interpretation of weather maps and charts; uses current weather information to illustrate key concepts, emphasizes the physical atmospheric processes responsible for weather. By the end of the class students will be able to interpret and make basic weather forecasts as well as be able to explain basic atmospheric phenomena.",
      []
    ],
    "ATMS 202": [
      "General Physical Climate",
      {
        "B": [
          "75638",
          [
            [
              13,
              "TR",
              "301 Noyes Laboratory",
              0,
              [
                "Dominguez, F"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Study of the physical process that govern Earth's climate. Students will learn basic principles of large-scale circulations, radiation and energy balances and the role of greenhouse gases, paleoclimate, how climate is changing in the present day, and how climate is projected to change in the future. Societal impacts of climate change and climate change policy are also addressed. Students gain hands-on experience by performing data analysis on historical and projected climate data.",
      []
    ],
    "ATMS 402": [
      "Applied Meteorology and Climate Services",
      {
        "G": [
          "77016",
          [
            [
              16,
              "MWF",
              "1071 Natural History Building",
              0,
              [
                "Zhang, G"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          7,
          0,
          [],
          -1
        ],
        "UG": [
          "76919",
          [
            [
              16,
              "MWF",
              "1071 Natural History Building",
              0,
              [
                "Zhang, G"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "With the ongoing climate change, students, the public, and the private sector have developed a keen interest in the intersection of meteorology, climate science, and service-oriented applications. This course will introduce the science and technology foundation that contributes the real-world decision-making, and delve into the diverse arenas where weather and climate information play a pivotal role, including agriculture, (renewable) energy, transportation, disaster responses, and public health.",
      []
    ],
    "ATMS 314": [
      "Mesoscale Dynamics",
      {
        "1": [
          "51093",
          [
            [
              21,
              "MWF",
              "1071 Natural History Building",
              0,
              [
                "Trapp, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Examination of the structure and dynamics of weather systems that occur on the mesoscale. The course first reviews what is meant by \"mesoscale\". Examines the structure and dynamics of both free and forced mesoscale circulations. Free circulations are those internal to the atmosphere, such as thunderstorms, mesoscale convective systems, squall lines, hurricanes, jet streaks, and fronts. Forced circulations are those tied to features external to the atmosphere, such as shorelines (the sea breeze), lakes (lake effect storms), and mountains.",
      []
    ],
    "ATMS 322": [
      "Soc Impacts Weather & Climate",
      {
        "A": [
          "58617",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Brown, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as ENSU 301. See ENSU 301.",
      []
    ],
    "ATMS 492": [
      "Capstone Undergraduate Research",
      {
        "SN": [
          "70965",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Choate, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "All senior Atmospheric Sciences undergraduate majors have the opportunity to take a Capstone Undergraduate Research experience. Students will be engaged in an atmospheric science research project with an ATMS faculty supervisor.",
      []
    ],
    "ATMS 502": [
      "Numerical Fluid Dynamics",
      {
        "A": [
          "63423",
          [
            [
              23,
              "MWF",
              "G7 Literatures, Cultures, & Ling",
              14,
              [
                "Jewett, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          9,
          0,
          [],
          -1
        ]
      },
      [],
      "Addresses numerical techniques for solving linear and nonlinear differential equations in initial value fluid flow problems. Students receive a thorough background in the principles used to evaluate numerical methods, the ability to critically interpret these methods as presented in the literature, and in particular, the practical application of these techniques in modeling multi-dimensional flow on high-performance computers. Temporal and directional splitting, finite differencing/volume methods, and adaptive nesting will be discussed.",
      []
    ],
    "ATMS 390": [
      "Internship in Atmospheric Sciences",
      {
        "CP": [
          "77649",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Choate, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Facilitates participation of students in unpaid, part-time internships in the atmospheric sciences. The tasks performed as part of the internships will vary depending on the student and host, but will allow the students to: apply concepts from atmospheric sciences coursework to real problems, develop a familiarity with tools and methods used by practicing atmospheric scientists, practice communicating technical information, and gain experience in multi-tasking and time management.",
      []
    ],
    "ATMS 490": [
      "Individual Study",
      {
        "JC": [
          "71252",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Choate, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Individual study or reading at an advanced undergraduate level in a subject not covered in normal course offerings or undergraduate research performed under faculty supervision.",
      []
    ],
    "ATMS 405": [
      "Boundary Layer Processes",
      {
        "A": [
          "56937",
          [
            [
              19,
              "TR",
              "1071 Natural History Building",
              0,
              [
                "Kristovich, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          9,
          0,
          [],
          -1
        ]
      },
      [],
      "Course will qualitatively and quantitatively describe atmospheric boundary layer characteristics and processes. The course will focus on the turbulent structure of the boundary layer and the factors that influence this structure over a variety of surfaces (e.g., soil, vegetation, marine) and under a variety of atmospheric conditions (e.g., stability, diurnal/nocturnal). This atmospheric layer is important to our daily lives because it is where humans live and it connects the small-scale fluxes of energy and mass to the large-scale atmospheric circulation.",
      []
    ],
    "ATMS 505": [
      "Weather Systems",
      {
        "A": [
          "51030",
          [
            [
              13,
              "TR",
              "1071 Natural History Building",
              0,
              [
                "Frame, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          9,
          0,
          [],
          -1
        ]
      },
      [],
      "Examination of the structure and dynamics of mid-latitude weather systems, integrating weather observations, with the current state of dynamic theory, numerical weather prediction models, and the physical principles of atmospheric thermodynamics, cloud and precipitation physics, and radiation to the problems of weather analysis and forecasting. Students will be required to give weather forecast briefings to develop an understanding of the weather forecasting process, and gain experience in communicating weather forecasts.",
      []
    ],
    "ATMS 507": [
      "Climate Dynamics",
      {
        "A": [
          "57310",
          [
            [
              23,
              "MWF",
              "1071 Natural History Building",
              0,
              [
                "Zhang, G"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          9,
          0,
          [],
          -1
        ]
      },
      [],
      "Investigates the dynamical and physical processes that govern Earth's paleo, current, and future climates. Emphasizes principles of climate change, natural and anthropogenic, and regional, national, and global. Global climate models and their predictions are examined in the context of scenarios for future population growth and energy consumption.",
      []
    ],
    "ATMS 517": [
      "Data Science for the Geosciences",
      {
        "AL1": [
          "74515",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Klees, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          12,
          0,
          [],
          -1
        ],
        "BL1": [
          "72256",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Klees, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          12,
          0,
          [],
          -1
        ],
        "OA1": [
          "74517",
          [
            [
              32,
              "M",
              "ONLINE",
              0,
              [
                "Klees, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          13,
          0,
          [],
          -1
        ],
        "OA2": [
          "74518",
          [
            [
              33,
              "M",
              "ONLINE",
              0,
              [
                "Klees, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          13,
          0,
          [],
          -1
        ],
        "OB1": [
          "72258",
          [
            [
              32,
              "M",
              "ONLINE",
              0,
              [
                "Klees, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          13,
          0,
          [],
          -1
        ],
        "OB2": [
          "73126",
          [
            [
              33,
              "M",
              "ONLINE",
              0,
              [
                "Klees, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          13,
          0,
          [],
          -1
        ]
      },
      [],
      "Many petabytes of geosciences data have been observed and curated by NASA and NOAA in anticipation of new data science tools designed to yield insights and improve forecasts of Earth processes. Students will learn the fundamentals of data science using publicly available datasets toward the end of conducting novel research in the geosciences. Topics include data ethics, uncertainty, data curation and management, version control, cluster and cloud computing, introductory Unix and Python, and visualization.",
      []
    ],
    "ATMS 526": [
      "Risk Analysis in the Geosciences",
      {
        "AL1": [
          "74530",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Sriver, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          12,
          0,
          [],
          -1
        ],
        "BL1": [
          "72042",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Sriver, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          12,
          0,
          [],
          -1
        ],
        "OA1": [
          "74531",
          [
            [
              33,
              "T",
              "ONLINE",
              0,
              [
                "Sriver, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          13,
          0,
          [],
          -1
        ],
        "OA2": [
          "74532",
          [
            [
              20,
              "T",
              "ONLINE",
              0,
              [
                "Sriver, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          13,
          0,
          [],
          -1
        ],
        "OB1": [
          "72043",
          [
            [
              33,
              "T",
              "ONLINE",
              0,
              [
                "Sriver, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          13,
          0,
          [],
          -1
        ],
        "OB2": [
          "73128",
          [
            [
              20,
              "T",
              "ONLINE",
              0,
              [
                "Sriver, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          13,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduces concepts and methods in quantitative risk analysis in the Earth, atmospheric, and environmental sciences. Key concepts will include probability, impacts, risk, uncertainty, statistical estimation, and decision making. Students will use simple risk analysis methods to apply these concepts to example problems related to drought, flooding, weather extremes, and anthropogenic climate change. The students will learn the R programming language for statistical computing, which will be used to integrate concepts and methods using observational data and model output, and we will focus on real-world multi-disciplinary applications.",
      []
    ],
    "ATMS 591": [
      "Atmospheric Sciences Seminar",
      {
        "A": [
          "30900",
          [
            [
              28,
              "T",
              "2079 Natural History Building",
              0,
              [
                "Trapp, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          0,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Seminar on topics of current interest.",
      []
    ],
    "ATMS 590": [
      "Individual Study",
      {
        "SWN": [
          "14045",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Nesbitt, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Individual study or reading in a subject not covered in normal course offerings.",
      []
    ],
    "ATMS 596": [
      "Non-Thesis Research",
      {
        "AK": [
          "51674",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Klees, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Non-thesis research in the Atmospheric Sciences.",
      []
    ],
    "ATMS 599": [
      "Thesis Research",
      {
        "HH": [
          "10394",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Horowitz, H"
              ],
              -1,
              -1,
              -1
            ]
          ],
          16,
          4,
          0,
          [],
          -1
        ],
        "SN": [
          "51667",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Nesbitt, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          16,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Check with the department to identify which CRN is needed for your advisor and any related registration questions.",
      []
    ]
  },
  "caches": {
    "periods": [
      "1600 - 1840",
      "1700 - 1940",
      "1300 - 1540",
      "0900 - 1140",
      "1400 - 1640",
      "0000 - 0000",
      "0930 - 1210",
      "1700 - 1820",
      "1130 - 1250",
      "1400 - 1700",
      "0900 - 1150",
      "0800 - 0850",
      "0900 - 0950",
      "0930 - 1050",
      "1030 - 1150",
      "0900 - 1020",
      "1200 - 1250",
      "1300 - 1350",
      "1100 - 1220",
      "1230 - 1350",
      "1400 - 1520",
      "1000 - 1050",
      "1100 - 1150",
      "1400 - 1450",
      "1500 - 1550",
      "1600 - 1650",
      "1200 - 1320",
      "1500 - 1620",
      "1530 - 1650",
      "1630 - 1750",
      "1400 - 1550",
      "1600 - 1750",
      "1300 - 1420",
      "1930 - 2050"
    ],
    "dateRanges": [],
    "scheduleTypes": [
      "Studio",
      "Online",
      "Laboratory",
      "Conference",
      "Independent Study",
      "Travel",
      "Seminar",
      "Lecture",
      "Discussion/ Recitation",
      "Lecture-Discussion",
      "Internship",
      "Online Discussion",
      "Online Lecture",
      "Online Lab"
    ],
    "campuses": [],
    "attributes": [],
    "restrictions": [],
    "gradeBases": [],
    "locations": [
      {
        "lat": null,
        "long": null
      },
      {
        "lat": 40.11246109008789,
        "long": -88.22831726074219
      },
      {
        "lat": 40.1083446,
        "long": -88.2282555
      },
      {
        "lat": 40.1131317,
        "long": -88.2264552
      },
      {
        "lat": 40.107534,
        "long": -88.2281548
      },
      {
        "lat": 40.1020773,
        "long": -88.2296394
      },
      {
        "lat": 40.105732,
        "long": -88.2281018
      },
      {
        "lat": 40.1072225,
        "long": -88.2262016
      },
      {
        "lat": 40.1110937,
        "long": -88.2232348
      },
      {
        "lat": 40.103587,
        "long": -88.230606
      },
      {
        "lat": 40.1108856,
        "long": -88.2269806
      },
      {
        "lat": 40.1109722,
        "long": -88.2282631
      },
      {
        "lat": 40.107811,
        "long": -88.2260761
      },
      {
        "lat": 40.1065684,
        "long": -88.2281746
      },
      {
        "lat": 40.10628,
        "long": -88.22621
      }
    ],
    "finalDates": [],
    "finalTimes": []
  }
}