{
  "subject": "BSE",
  "scrapedAt": 1768434229115,
  "courseCount": 38,
  "courses": {
    "BSE 636": [
      "Digestion, Nutrition, & Metabolism",
      {
        "A": [
          "71337",
          [
            [
              56,
              "MWF",
              "274 Medical Sciences Building",
              0,
              [
                "Thomas, D",
                "Yodh, J"
              ],
              -1,
              -1,
              -1
            ],
            [
              57,
              "TR",
              "274 Medical Sciences Building",
              0,
              [
                "Thomas, D",
                "Yodh, J"
              ],
              -1,
              -1,
              -1
            ],
            [
              54,
              "MWF",
              "274 Medical Sciences Building",
              0,
              [
                "Thomas, D",
                "Yodh, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          5,
          8,
          0,
          [],
          -1
        ]
      },
      [],
      "Topics include malabsorption syndrome, vitamin D deficiency, G6PD deficiency, TPN, obesity, GERD with stricture/Barretts, Crohn's disease, peptic ulcer disease with hemorrhage, chronic diarrhea, pyloric stenosis – peds hepatitis C, and colonic polyposis.",
      []
    ],
    "BSE 644": [
      "Multisystem Conditions",
      {
        "A": [
          "73371",
          [
            [
              5,
              "MWF",
              "ONLINE",
              0,
              [
                "Park, G",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "The Multisystem Conditions course is a required course for students in Phase 1 of the Carle Illinois College of Medicine Curriculum. In this course, students work in small groups to approach complex diseases and conditions they may see in the clinical environment.",
      []
    ],
    "BSE 660": [
      "Self-Designed Study",
      {
        "A": [
          "73242",
          [
            [
              5,
              "MTWRF",
              "ONLINE",
              0,
              [
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          16,
          4,
          0,
          [],
          -1
        ],
        "B": [
          "74558",
          [
            [
              5,
              "MTWRF",
              "ONLINE",
              0,
              [
                "Orban, J",
                "Zimmerman, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          16,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Students will develop skills and gain experience working collaboratively with other professional through a self-designed study. Develop a self-guided study when students have an interest in an intellectual issue that is best studied through an integrative approach based in multiple academic disciplines. This course will introduce the student to a selected multi-disciplinary study or project in the medical/engineering field, addresses appropriate methodology, provides opportunities for advanced level research or other creative projects, and culminates in an integrative experience. It must be arranged between the student and an individual faculty member or external collaborator, and subsequently approved by the dean of Academic Affairs.",
      []
    ],
    "BSE 634": [
      "Clinical Neuroscience",
      {
        "A": [
          "69028",
          [
            [
              56,
              "MWF",
              "274 Medical Sciences Building",
              0,
              [
                "Llano, D",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ],
            [
              57,
              "TR",
              "274 Medical Sciences Building",
              0,
              [
                "Llano, D",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ],
            [
              54,
              "MWF",
              "274 Medical Sciences Building",
              0,
              [
                "Llano, D",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          5,
          8,
          0,
          [],
          -1
        ]
      },
      [],
      "Topics include neurovascular disorders, seizures, brain injury, dementia, tumors of the brain, disorders involving neuroinflammation, psychotic disorders, affective disorders, anxiety disorders, as well as disorders of the peripheral nervous system and neuromuscular junction.",
      []
    ],
    "BSE 666": [
      "Academic Progress I (Longitudinal)",
      {
        "A": [
          "73244",
          [
            [
              5,
              "MTWRF",
              "ONLINE",
              0,
              [
                "Ghasemi, A",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          0,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Provides students with an opportunity to demonstrate core medical skills. The course includes assessment of students' understanding of clinical skills, professionalism, anatomy, and medical knowledge. Areas covered in the course include: cardiovascular, respiratory, renal, neurology, musculoskeletal, digestive, nutrition, metabolism, endocrine, genitourinary, oncology, hematology, infection, and immunity.",
      []
    ],
    "BSE 655": [
      "Research Elective",
      {
        "A": [
          "73241",
          [
            [
              5,
              "MTWRF",
              "ONLINE",
              0,
              [
                "Orban, J",
                "Thomas, D",
                "Zimmerman, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          16,
          4,
          0,
          [],
          -1
        ],
        "B": [
          "73514",
          [
            [
              5,
              "MTWRF",
              "ONLINE",
              0,
              [
                "Orban, J",
                "Zimmerman, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          16,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "The goal of this course is to introduce the students to the foundations of selected multi-disciplinary research in medical/engineering field. Students will learn about the purpose for research; identifying researchable issues; finding, evaluating, and using sources effectively; recognizing methods associated with different types of data and disciplines; and writing a literature review.",
      []
    ],
    "BSE 645": [
      "Synthesis & Summary",
      {
        "A": [
          "71029",
          [
            [
              54,
              "MWF",
              "Location Pending",
              0,
              [
                "Swigart, J",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          6,
          9,
          0,
          [],
          -1
        ]
      },
      [],
      "This course will review critical concepts in the areas of Behavioral Science, Biochemistry, Cells and Tissues, Human Development and Genetics, Microbiology, Immunology, Pathology, and Pharmacology, Population Health. The course will be organized around the major organ systems: Blood and Lymphoreticular System, Cardiovascular, Endocrine, Gastrointestinal, Hematology and Oncology, Musculoskeletal, Neurology, Psychiatry, Renal, Reproductive, Respiratory, Skin and Subcutaneous Tissue.",
      []
    ],
    "BSE 680": [
      "Innovation, Design, Engineering and Analysis Projects (Longitudinal)",
      {
        "A": [
          "71330",
          [
            [
              5,
              "F",
              "ONLINE",
              0,
              [
                "Shah, S",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          6,
          7,
          0,
          [],
          -1
        ],
        "B": [
          "73347",
          [
            [
              58,
              "F",
              "Location Pending",
              0,
              [
                "Shah, S",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          6,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Innovation, Design, Engineering and Analysis Projects (IDEA) is a required course for students in Phase 2 of the Carle Illinois College of Medicine curriculum. In this course, students work independently and in small groups to solve challenges they are presented with in the clinical environment.",
      []
    ],
    "BSE 602": [
      "Public Health Clinical Applications",
      {
        "A": [
          "74556",
          [
            [
              5,
              "MTWRF",
              "ONLINE",
              0,
              [
                "Sander, W",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "The Public Health Clinical Applications rotation was developed in 2006 for veterinary students. However, this rotation is applicable for medical students with an interest in public health that want to expand on concepts of study design, surveillance, sampling, sample handling, field epidemiology and biostatistics. The rotation will integrate medical and veterinary medical students around epidemiology to understand components affecting health from food safety and production to obesity to water systems at the interface of human, animal and ecosystem health. Additionally, students will work in close contact with local and state health departments, gain an understanding of the scope of activities in which local and state health departments are involved, study major and current health threats to humans, animals and the ecosystem and consider policy initiatives to address those threats. Day long field trips and one overnight trip within the state are possible.",
      []
    ],
    "BSE 635": [
      "Musculoskeletal and Integumentary System",
      {
        "A": [
          "69029",
          [
            [
              56,
              "MWF",
              "274 Medical Sciences Building",
              0,
              [
                "Hernandez, M",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ],
            [
              57,
              "TR",
              "274 Medical Sciences Building",
              0,
              [
                "Hernandez, M",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ],
            [
              54,
              "MWF",
              "274 Medical Sciences Building",
              0,
              [
                "Hernandez, M",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          8,
          0,
          [],
          -1
        ]
      },
      [],
      "Topics include primary inflammatory diseases such as rheumatoid arthritis, lupus, polymyalgia rheumatica and associated disorders, degenerative diseases of the joints such as osteoarthritis, primary diseases of muscle, primary diseases of bone such as osteoporosis and osteogenesis imperfecta as well as mechanical trauma to bone leading to fracture. The course will also cover disorders of the integumentary system.",
      []
    ],
    "BSE 711": [
      "Climate Change, Planetary Health and Sustainability",
      {
        "A": [
          "73340",
          [
            [
              5,
              "MTWRF",
              "ONLINE",
              0,
              [
                "Lavey, W",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Medical students should learn how to practice medicine in the context of the current health impacts of climate change. Throughout the U.S. and globally, climate change contributes to increasing morbidity and mortality, including heat illness, respiratory and cardiovascular disease from air pollution, vector and water borne diseases, food and water insecurity, mental stress, and injuries. We highlight health threats, policies, and actions for physicians, engineering/medical researchers, and medical students.",
      []
    ],
    "BSE 706": [
      "Literature Reviews in Pathology",
      {
        "A": [
          "73251",
          [
            [
              5,
              "MTWRF",
              "ONLINE",
              0,
              [
                "Hegazy, S",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Pathology is a multidisciplinary science that connects theory (basic sciences) with practice (clinical sciences). This elective provides students with opportunities to explore the role of pathology in medical education. This course might be of particular interest to those who are generally interested in medical education and/or pathology as a future specialty.",
      []
    ],
    "BSE 704": [
      "Medicine in Literature",
      {
        "A": [
          "73249",
          [
            [
              5,
              "MTWRF",
              "ONLINE",
              0,
              [
                "Jacobsen, E",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "The medical encounter between patients and physicians has been represented in literary texts such as poems, short stories and novels for centuries. In this elective, students will be given the opportunity to reflect on the medical experience through an analysis of literary texts from various time periods and cultural contexts. Particular attention will be paid to the difference in perspective by patients, physicians and other actors in the healthcare setting. Our reading of literature will be complemented by texts from the field of narrative medicine, which uses the tools of literary analysis and close reading to understand patients’ histories and fine-tunes awareness of the cultural and social determinants of health.",
      []
    ],
    "BSE 685": [
      "Medicine - Capstone Project (Longitudinal)",
      {
        "A": [
          "73325",
          [
            [
              5,
              "MTWRF",
              "ONLINE",
              0,
              [
                "Oelze, M",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          15,
          0,
          [],
          -1
        ],
        "B": [
          "73348",
          [
            [
              5,
              "MTWRF",
              "ONLINE",
              0,
              [
                "Oelze, M",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          15,
          0,
          [],
          -1
        ]
      },
      [],
      "Selecting one of the clinical challenges investigated during the Innovation, Design, Engineering and Analysis Projects (Longitudinal), students will work to potentially translate new approaches, technologies, and treatments in healthcare.",
      []
    ],
    "BSE 686": [
      "Medicine - Data Science Project (Longitudinal)",
      {
        "A": [
          "73326",
          [
            [
              5,
              "MTWRF",
              "ONLINE",
              0,
              [
                "Blatti, C",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          15,
          0,
          [],
          -1
        ],
        "B": [
          "73349",
          [
            [
              5,
              "MTWRF",
              "ONLINE",
              0,
              [
                "Blatti, C",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          15,
          0,
          [],
          -1
        ]
      },
      [],
      "Develop skills in data science for health care through the Data Science Project. Identify an exciting data-driven question, find data sources to address the question, and access and utilize those data to improve clinical care. Students will interact with databases, utilize tools for analyzing clinical or molecular data, and learn about the immense potential of medical data science while familiarizing themselves with the issues of human subject's protection and privacy regulations around data.",
      []
    ],
    "BSE 705": [
      "Race in Medicine",
      {
        "A": [
          "73250",
          [
            [
              5,
              "MTWRF",
              "ONLINE",
              0,
              [
                "Archey, J",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "This elective provides an opportunity to explore the topics of unconscious bias, history of race in medicine and effects on systemic racism in medicine. The goal is to give time to grow in personal insight and development in this area to progress to become a compassionate and unbiased health care provider. Progress towards this goal will be made through the personal journey of completing a 21 day equity challenge and reflection paper, participation in online discussion boards, and group projects looking at the history and current state of racism and social determinants of health in medicine.",
      []
    ],
    "BSE 707": [
      "Interreligious Perspectives on Health and Medicine",
      {
        "A": [
          "74033",
          [
            [
              5,
              "MTWRF",
              "ONLINE",
              0,
              [
                "Ebel, J",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Explores and develops an appreciation for the many ways in which religion and religious identities are present in, and absent from, medical spaces in the United States. This course is intended to support physicians-in-training develop the background, vocabulary, and experiences necessary to practice medicine thoughtfully and sensitively in a religiously diverse society.",
      []
    ],
    "BSE 702": [
      "Medical Spanish",
      {
        "A": [
          "73247",
          [
            [
              5,
              "MTWR",
              "ONLINE",
              0,
              [
                "Teran-Garcia, M",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Carle Illinois College of Medicine strives to support physicians who want to serve diverse populations. To that end, students may enroll in a medical Spanish course. This hybrid online course allows students to increase their proficiency in Spanish, while also practicing with a standardized patient.",
      []
    ],
    "BSE 720": [
      "Advanced Anatomy",
      {
        "A": [
          "73253",
          [
            [
              5,
              "MTWRF",
              "ONLINE",
              0,
              [
                "Ibrahim, W",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          16,
          0,
          [],
          -1
        ]
      },
      [],
      "Provides a focused concentration on gross anatomy via literature review and intensive cadaver dissection related to the student’s specific clinical interest. Topics will emphasize clinical conditions that have clear anatomic correlates. Key topics will include the 3D relationships of gross anatomical structures, foundational anatomical knowledge required to interpret results of different imaging modalities, and the application of anatomical knowledge in carrying out surgical, diagnostic, or therapeutic clinical procedures.",
      []
    ],
    "BSE 712": [
      "Artificial Intelligence in Health",
      {
        "A": [
          "78379",
          [
            [
              5,
              "MTWRF",
              "ONLINE",
              0,
              [
                "Blake, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Artificial Intelligence (AI) has been proposed to address a variety of challenges in health, both within a clinical setting and beyond the direct patient-physician interaction. The goal of this course is to critically engage with readings on timely topics in AI and health. The strengths and weaknesses of each paper will be discussed both from an AI and evidence-based medicine perspective. Those constructive debates will inform the student’s final project that will propose a computational intervention that is more likely to successfully improve health.",
      []
    ],
    "BSE 730": [
      "Introduction to Deep Learning on Healthcare Data",
      {
        "A": [
          "73289",
          [
            [
              5,
              "MTWRF",
              "ONLINE",
              0,
              [
                "Sun, J",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Covers deep learning methods, healthcare data and applications using deep learning methods. Includes activities such as online lectures or video lectures, programming labs, literature review, and individual or group presentations. The overall goal is to understand basic data science workflow for healthcare data such as electronic health records, clinical notes, and medical images, to learn basic deep learning models, and to learn the structure of data science projects.",
      []
    ],
    "BSE 738": [
      "Advanced Anatomy for Teaching",
      {
        "A": [
          "75764",
          [
            [
              5,
              "MTWRF",
              "ONLINE",
              0,
              [
                "Shackelford, L",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Advanced Anatomy for Teaching is an elective course designed to enhance regional anatomy knowledge and teaching skills. Through one-on-one and small group lab instruction, students will learn best practices in anatomy education, reflect on their teaching principles, and create educational resources. Students will create either an educational resource to be used for teaching anatomy or an in-depth literature review of medical education pedagogy.",
      []
    ],
    "BSE 740": [
      "Artificial Intelligence in Medicine",
      {
        "A": [
          "77610",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Sun, J",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "This course offers a comprehensive exploration of AI's impact on healthcare. Healthcare professionals will gain a conceptual understanding of AI applications through medical case studies and machine learning models. The course empowers participants to confidently read AI literature, make data-driven decisions, identify AI tools, and actively participate in the selection and deployment of AI-based medical software.",
      []
    ],
    "BSE 735": [
      "Leadership in PBL I",
      {
        "A": [
          "75766",
          [
            [
              5,
              "MTWRF",
              "ONLINE",
              0,
              [
                "Park, G",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Students will delve into the world of Project-Based Learning (PBL) from the perspective of a facilitator. Through training, participants will gain a comprehensive understanding of leadership characteristics and the correct implementation of PBL principles. The course aims to equip interested students with the necessary background and context to become student leaders in PBL sessions. Students may engage in the student leader role by enrolling in the second part of this two-part elective series.",
      []
    ],
    "BSE 732": [
      "Healthcare Process Management",
      {
        "A": [
          "75010",
          [
            [
              5,
              "MTWRF",
              "ONLINE",
              0,
              [
                "Seshadri, S",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "In this elective we will apply principles and tools of operations management to explore improvement opportunities in the design, delivery, and management of the health care value chain. We will be examining the health care operation from the perspective of operations metrics such as: cost, quality, time (access), and variety/customization.",
      []
    ],
    "BSE 734": [
      "Medical Chinese",
      {
        "A": [
          "76358",
          [
            [
              5,
              "MTWRF",
              "ONLINE",
              0,
              [
                "Liu, Z",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Medical students with basic conversational Chinese skills will be provided opportunities to learn phrases commonly used in the patient interview as well as practice patient interviews in Mandarin. Students will also be introduced to basic concepts of Traditional Chinese Medicine in the context of patient interaction. The goal is to equip students with basic Medical Chinese needed to provide care and advocate for the Chinese community.",
      []
    ],
    "BSE 733": [
      "Introduction to Research",
      {
        "A": [
          "76365",
          [
            [
              5,
              "MTWRF",
              "ONLINE",
              0,
              [
                "Smith, B",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          15,
          0,
          [],
          -1
        ]
      },
      [],
      "This elective course offers a comprehensive understanding of research fundamentals at Carle Illinois and the University of Illinois. Students will learn study design, literature searches, hypothesis generation, and research methodologies. They will also gain skills in statistics, outcome assessment, budgeting, ethics, safety protocols, mentorship, collaboration, and securing funding. Upon completion, students will have a solid foundation and skills to excel academically and professionally in research.",
      []
    ],
    "BSE 737": [
      "Exploring Anatomy through the Virtual Reality Lens",
      {
        "A": [
          "75768",
          [
            [
              5,
              "MTWRF",
              "ONLINE",
              0,
              [
                "Ibrahim, W",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "In this immersive elective, students have the opportunity to better understand and visualize the 3D view of several complex anatomical areas and their related clinical/surgical applications. Integrating this technology into anatomy won’t only allow students to practice hands-on dissection of a complex anatomical area of their choice, after consultation with the anatomy faculty, but also give them a chance to use VR to dive deeper and enhance their understanding of the human body.",
      []
    ],
    "BSE 744": [
      "Simulation I",
      {
        "A": [
          "77037",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Chen, T",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          14,
          0,
          [],
          -1
        ]
      },
      [],
      "Simulation I is an immersive, dynamic, two-week introduction to medical simulation activities, providing a gateway to a profound understanding of medical scenarios and their management through simulation techniques. Functioning as supervised participants, students will actively engage in diverse day-to-day simulation activities, collaborating with a team of educators and facilitators. This hands-on experience will culminate in a simulation experience with reports, and self-reflection of needs within the community/medical curriculum to drive the development of their simulation.",
      []
    ],
    "BSE 743": [
      "Introduction to Health Systems Science",
      {
        "A": [
          "77381",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Fowler, K",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Health Systems Science is a cornerstone for aspiring physician innovators. It equips students with the tools to navigate and improve healthcare systems, emphasizing the integration of health systems science with professional identity development. Through modules and reflective case studies, students become prepared to lead and innovate within the healthcare landscape by applying key concepts to real-world scenarios and enhancing their roles as system-aware physicians.",
      []
    ],
    "BSE 750": [
      "Clinical Pharmacology and Therapeutics",
      {
        "A": [
          "77624",
          [
            [
              5,
              "MTWRF",
              "ONLINE",
              0,
              [
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          9,
          0,
          [],
          -1
        ]
      },
      [],
      "This is self-directed learning in pharmacology, where students review drug classes, covering mechanisms of action, side effects, therapeutic uses, and contraindications. Weekly case-based session integrate pharmacological principles with clinical decision-making.",
      []
    ],
    "BSE 770": [
      "Service Learning Elective",
      {
        "B": [
          "78303",
          [
            [
              5,
              "MTWRF",
              "ONLINE",
              0,
              [
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          16,
          9,
          0,
          [],
          -1
        ]
      },
      [],
      "Service Learning offers educational experiences that involve students providing non-clinical service to the community in response to identified community needs. Through this course, Carle Illinois students have the opportunity to engage in service-learning activities, collaborate with diverse community members, and develop essential skills for independent and continuous learning throughout their lives. Students will reflect on the connections between their participation in these activities, their medical school curriculum, and their responsibilities as both citizens and future medical professionals.",
      []
    ],
    "BSE 746": [
      "Medical Hindi",
      {
        "A": [
          "78378",
          [
            [
              5,
              "MTWRF",
              "ONLINE",
              0,
              [
                "Kumar, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Students will complete specific modules of readings and videos daily and practice medical vocabulary in Hindi/Urdu as a group virtually twice weekly. The group meeting will allow for reviewing module content and practicing patient interview skills in Hindi/Urdu with a focus on recognizing cultural differences that are specific to the South Asia healthcare system. The goal is to encourage medical students to provide more culturally sensitive care and advocate for the local Hindi-speaking patient population.",
      []
    ],
    "BSE 745": [
      "Medical Ethics at the Beginning and End of Life",
      {
        "A": [
          "77075",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Ben Moshe, N",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "We will examine issues in medical ethics at the beginning and end of life, namely, those pertaining to abortion, the treatment of newborns, dementia, physician assisted suicide, and euthanasia. We will discuss, among other things, ethics-based versus policy-based arguments, different types of patient interests (short-term experiential interests vs. long-term critical interests), and various prima facie rights (the right to life, the right over one’s body, and the right to die).",
      []
    ],
    "BSE 747": [
      "Survey of Health Systems Science",
      {
        "A": [
          "77386",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Fowler, K",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Survey of Health Systems is a follow-up elective to Introduction to Health Systems Science. The goal is for students to shadow administrators at various healthcare practices to compare and contrast. The focus will be on understanding common threads and differences between types of practices and deepening understanding of practicing high-value care.",
      []
    ],
    "BSE 749": [
      "Comprehensive Immunology Course-Level 1",
      {
        "A": [
          "77526",
          [
            [
              34,
              "TR",
              "Location Pending",
              0,
              [
                "Laouar, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          9,
          0,
          [],
          -1
        ]
      },
      [],
      "Immunology is a cornerstone of modern medicine, impacting all clinical specialties. The elective is designed to provide M2-M4 students, with an in-depth understanding of immunological principles, to address gaps in their M1 immunology education. It provides a detailed exploration of the immune system, reinforcing key concepts in both innate and adaptive immunity through focused, comprehensive content.",
      []
    ],
    "BSE 748": [
      "Residency-Ready: Writing A Review Paper on Medical Innovations in Your Chosen Specialty",
      {
        "A": [
          "77284",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Laouar, A",
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Third- and fourth-year medical students will be empowered with the skills and knowledge necessary to become physician-innovators in their chosen clinical specialties as they prepare for residency. Participants will explore cutting-edge breakthroughs, refine critical thinking, and enhance scientific writing and problem-solving skills. By strengthening residency applications, this course positions students as standout candidates ready to make a meaningful impact in their future clinical field.",
      []
    ],
    "BSE 799": [
      "Advanced Non-Clinical Electives",
      {
        "D": [
          "78429",
          [
            [
              17,
              "MWF",
              "Location Pending",
              0,
              [
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          9,
          0,
          [],
          -1
        ],
        "D4": [
          "78428",
          [
            [
              17,
              "MWF",
              "ONLINE",
              0,
              [
                "Thomas, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          11,
          0,
          [],
          -1
        ]
      },
      [],
      "Third- and fourth-year students are eligible to participate in short-term elective opportunities that can enhance their medical education. The AAMC Visiting Student Learning Opportunities program enables eligible students to pursue these opportunities other than at their home institutions. They offer clinical, clinical and research, non-clinical, hybrid, and research experiences in the U.S. and globally at teaching hospitals, community clinics, and urban or rural sites. Eligibility and availability are determined by the host institution.",
      []
    ]
  },
  "caches": {
    "periods": [
      "1600 - 1840",
      "1700 - 1940",
      "1300 - 1540",
      "0900 - 1140",
      "1400 - 1640",
      "0000 - 0000",
      "0930 - 1210",
      "1700 - 1820",
      "1130 - 1250",
      "1400 - 1700",
      "0900 - 1150",
      "0800 - 0850",
      "0900 - 0950",
      "0930 - 1050",
      "1030 - 1150",
      "0900 - 1020",
      "1200 - 1250",
      "1300 - 1350",
      "1100 - 1220",
      "1230 - 1350",
      "1400 - 1520",
      "1000 - 1050",
      "1100 - 1150",
      "1400 - 1450",
      "1500 - 1550",
      "1600 - 1650",
      "1200 - 1320",
      "1500 - 1620",
      "1530 - 1650",
      "1630 - 1750",
      "1400 - 1550",
      "1600 - 1750",
      "1300 - 1420",
      "1930 - 2050",
      "0800 - 0920",
      "0930 - 1020",
      "1700 - 1950",
      "1100 - 1250",
      "1700 - 1750",
      "1530 - 1820",
      "0800 - 1050",
      "1300 - 1550",
      "0930 - 1220",
      "1830 - 2020",
      "1500 - 1650",
      "1400 - 1720",
      "0900 - 1220",
      "1300 - 1620",
      "1200 - 1450",
      "1100 - 1450",
      "1500 - 1850",
      "1400 - 1650",
      "1600 - 1850",
      "0900 - 1050",
      "1000 - 1150",
      "1000 - 1120",
      "0800 - 0950",
      "0800 - 1150",
      "1300 - 1520"
    ],
    "dateRanges": [],
    "scheduleTypes": [
      "Studio",
      "Online",
      "Laboratory",
      "Conference",
      "Independent Study",
      "Travel",
      "Seminar",
      "Lecture",
      "Discussion/ Recitation",
      "Lecture-Discussion",
      "Internship",
      "Online Discussion",
      "Online Lecture",
      "Online Lab",
      "Laboratory-Discussion",
      "Research",
      "Practice"
    ],
    "campuses": [],
    "attributes": [],
    "restrictions": [],
    "gradeBases": [],
    "locations": [
      {
        "lat": null,
        "long": null
      },
      {
        "lat": 40.11246109008789,
        "long": -88.22831726074219
      },
      {
        "lat": 40.1083446,
        "long": -88.2282555
      },
      {
        "lat": 40.1131317,
        "long": -88.2264552
      },
      {
        "lat": 40.107534,
        "long": -88.2281548
      },
      {
        "lat": 40.1020773,
        "long": -88.2296394
      },
      {
        "lat": 40.105732,
        "long": -88.2281018
      },
      {
        "lat": 40.1072225,
        "long": -88.2262016
      },
      {
        "lat": 40.1110937,
        "long": -88.2232348
      },
      {
        "lat": 40.103587,
        "long": -88.230606
      },
      {
        "lat": 40.1108856,
        "long": -88.2269806
      },
      {
        "lat": 40.1109722,
        "long": -88.2282631
      },
      {
        "lat": 40.107811,
        "long": -88.2260761
      },
      {
        "lat": 40.1065684,
        "long": -88.2281746
      },
      {
        "lat": 40.10628,
        "long": -88.22621
      },
      {
        "lat": 40.1035872,
        "long": -88.2306061
      },
      {
        "lat": 40.10593795776367,
        "long": -88.2270736694336
      },
      {
        "lat": 40.101862,
        "long": -88.231737
      },
      {
        "lat": 40.1149296,
        "long": -88.2280589
      }
    ],
    "finalDates": [],
    "finalTimes": []
  }
}