{
  "subject": "CPSC",
  "scrapedAt": 1768434260630,
  "courseCount": 33,
  "courses": {
    "CPSC 304": [
      "Plant Pathology",
      {
        "AB3": [
          "76848",
          [
            [
              72,
              "W",
              "W9 Turner Hall",
              0,
              [
                "Schroeder, N"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ],
        "AL1": [
          "76823",
          [
            [
              12,
              "TR",
              "W115 Turner Hall",
              0,
              [
                "Schroeder, N"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Lecture and laboratory cover concepts relating to causal agents of plant diseases, pathogen biology, symptoms and diagnosis, modes of infection and spread, effects of environment on disease development, and methods of control.",
      []
    ],
    "CPSC 395": [
      "Undergrad Research or Thesis",
      {
        "": [
          "76224",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Independent research, special problems, thesis, development and/or design work under the supervision of an appropriate member of the faculty.",
      []
    ],
    "CPSC 265": [
      "Genetic Engineering Lab",
      {
        "A": [
          "31495",
          [
            [
              91,
              "M",
              "M5 Turner Hall",
              0,
              [
                "Lambert, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Laboratory/discussion course that provides a hands-on introduction to the techniques and principles of genetic engineering, recombinant DNA and the impact of molecular genetics on society. Students will isolate DNA from plants and clone specific genes into bacterial plasmids, perform polymerase chain reactions, DNA restriction analysis and DNA blotting, and discuss the relevance of these techniques to both medicine and agriculture.",
      []
    ],
    "CPSC 414": [
      "Forage Crops & Pasture Ecology",
      {
        "OLP": [
          "78025",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Villamil, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Forages, their plant characteristics, ecology, and production; grasslands of farm and range as related to animal production and soil conservation.",
      []
    ],
    "CPSC 116": [
      "The Global Food Production Web",
      {
        "A": [
          "48193",
          [
            [
              92,
              "MW",
              "W109 Turner Hall",
              0,
              [
                "Bohn, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          9,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduces students to the global web involved in the production of food we consume on a daily basis. Selected ecosystems of plants, people, and cultures in Asia, Africa, and Latin America will be studied based on involvement with various crops. Presents the origin and biology of plants; their evolution with humankind in various cultures; the spread and economic importance of crops around the world; and considers current hunger and environmental issues resulting from the global food web. Interactive communications with selected scientists, producers, and traders around the world through the World Wide Web and email system of the INTERNET permit students to get personal exposure to information and activities.",
      []
    ],
    "CPSC 113": [
      "Environment, Agriculture, and Society",
      {
        "A": [
          "71645",
          [
            [
              20,
              "TR",
              "W109 Turner Hall",
              0,
              [
                "Lee, D",
                "Vittore, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          9,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduction to agriculture and the environment; examine the largest managed ecosystem and its influence on natural ecosystems; develop a working understanding of natural and agriculture ecosystems and their interaction; examine various agriculture management strategies that can be used to produce food for an increasing world population while maintaining or improving environmental quality.",
      []
    ],
    "CPSC 180": [
      "Medicinal Plants and Herbology",
      {
        "A": [
          "34188",
          [
            [
              22,
              "MWF",
              "W109 Turner Hall",
              0,
              [
                "Riggins, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          9,
          0,
          [],
          -1
        ],
        "OLP": [
          "69405",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Riggins, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "The use of cultivated and wild plants in medicines and health products according to Eastern and Western medical traditions. Consideration of herbal medicine use from ancient times to the present, important medicinal chemicals produced by plants, and the evaluation of plant chemical products as potential human medicines.",
      []
    ],
    "CPSC 393": [
      "Crop Sciences Internship",
      {
        "": [
          "70102",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          5,
          10,
          0,
          [],
          -1
        ]
      },
      [],
      "Supervised experience in a field directly pertaining to a subject matter in crop sciences.",
      []
    ],
    "CPSC 241": [
      "Intro to Applied Statistics",
      {
        "A": [
          "31493",
          [
            [
              18,
              "TR",
              "W223 Turner Hall",
              0,
              [
                "Klimasmith, I"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduces fundamental statistical procedures used to analyze and interpret data. General principles of descriptive and inferential statistics, measures of central tendency and dispersion, probability, correlation and regression, and tests of hypotheses are covered. An emphasis is placed on biological, environmental, and agricultural sciences, but numerous examples from other areas are discussed. Course content enhances students' ability to critically assess statistical information encountered in professional and every day activities.",
      []
    ],
    "CPSC 261": [
      "Biotechnology in Agriculture",
      {
        "A": [
          "31518",
          [
            [
              13,
              "TR",
              "W203 Turner Hall",
              0,
              [
                "Moose, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          9,
          0,
          [],
          -1
        ]
      },
      [],
      "Basic introduction to the techniques and application of biotechnology to a wide range of agricultural areas, and specific examples are given. May serve as either a terminal course explaining the techniques or as an introductory base for future studies.",
      []
    ],
    "CPSC 440": [
      "Applied Statistical Methods I",
      {
        "OLP": [
          "44338",
          [
            [
              74,
              "T",
              "ONLINE",
              0,
              [
                "Klimasmith, I"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ],
        "ONL": [
          "31578",
          [
            [
              74,
              "T",
              "ONLINE",
              0,
              [
                "Klimasmith, I"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Statistical methods involving relationships between populations and samples; collection, organization, and analysis of data; and techniques in testing hypotheses with an introduction to regression, correlation, and analysis of variance limited to the completely randomized design and the randomized complete-block design.",
      []
    ],
    "CPSC 436": [
      "Conservation Biology",
      {
        "AB2": [
          "39494",
          [
            [
              69,
              "T",
              "G7 Literatures, Cultures, & Ling",
              14,
              [
                "Anderson, N",
                "Wargin, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ],
        "AB3": [
          "47629",
          [
            [
              69,
              "W",
              "G7 Literatures, Cultures, & Ling",
              14,
              [
                "Anderson, N",
                "Wargin, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ],
        "AL1": [
          "39487",
          [
            [
              13,
              "TR",
              "2020B Natural History Building",
              0,
              [
                "Anderson, N",
                "Cullum, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as ENVS 420 and IB 451. See IB 451.",
      []
    ],
    "CPSC 431": [
      "Plants and Global Change",
      {
        "A": [
          "31539",
          [
            [
              18,
              "TR",
              "2020B Natural History Building",
              0,
              [
                "Ainsworth, L",
                "Leakey, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          9,
          0,
          [],
          -1
        ]
      },
      [],
      "The science of global atmospheric and climate change in the 21st Century. Understanding of how plants, including crops, will respond and may be adapted to these changes. Using plants to ameliorate predicted climate change.",
      []
    ],
    "CPSC 480": [
      "Cannabis Classification and Management",
      {
        "A": [
          "71659",
          [
            [
              18,
              "TR",
              "W203 Turner Hall",
              0,
              [
                "Behnke, G"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          9,
          0,
          [],
          -1
        ]
      },
      [],
      "Designed to provide students with an understanding of the cannabis classification system and proper management practices for target compounds and products. Understanding cannabis biology and taxonomic classification is critical for proper management practices for the production of essential oils, psychoactive compounds, fiber, and seed oil and protein, and applications of those products. Discrepancies between scientific and vernacular names of cannabis and the inconsistency of vernacular names mislead producers and consumers. This course will discuss the taxonomy and vernacular nomenclature of cannabis and cannabis biology will be discussed based on individual subspecies. The subspecies classification will be necessary for proper management practices and harvesting of target compounds and products.",
      []
    ],
    "CPSC 418": [
      "Crop Growth and Management",
      {
        "OLP": [
          "78024",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Villamil, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Crop physiology and management as influenced by environment, plant species, and cropping system; relates plant growth processes to crop production practices based on current research.",
      []
    ],
    "CPSC 428": [
      "Weed Science Practicum",
      {
        "A": [
          "44813",
          [
            [
              72,
              "R",
              "W9 Turner Hall",
              0,
              [
                "Tranel, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          14,
          0,
          [],
          -1
        ]
      },
      [],
      "Intensive course on field diagnostic skills in weed science. Topics include weed and weed seed identification, sprayer calibration, herbicide application, herbicide injury symptomatology, and field diagnostics. Students who complete the course will be encouraged to enter the North Central Weed Science Society weeds contest, which occurs during the summer.",
      []
    ],
    "CPSC 453": [
      "Principles of Plant Breeding",
      {
        "A": [
          "31550",
          [
            [
              30,
              "T",
              "W115 Turner Hall",
              0,
              [
                "Rutkoski, J"
              ],
              -1,
              -1,
              -1
            ],
            [
              23,
              "R",
              "W115 Turner Hall",
              0,
              [
                "Rutkoski, J"
              ],
              -1,
              -1,
              -1
            ],
            [
              17,
              "TR",
              "W115 Turner Hall",
              0,
              [
                "Rutkoski, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Principles, concepts and tools used in plant breeding. Includes methods and breeding schemes used with different plant species.",
      []
    ],
    "CPSC 481": [
      "Principles and Practices of Cannabis Flower Production",
      {
        "ONL": [
          "75936",
          [
            [
              93,
              "W",
              "ONLINE",
              0,
              [
                "Behnke, G"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          19,
          0,
          [],
          -1
        ]
      },
      [],
      "Explores indoor and outdoor cannabis flower production management practices. Topics covered include botany, growth and development, cultivar selection, planting and harvesting, growing systems and media, nutrient and water management, pest management, environmental controls such as lighting, media, ventilation.",
      []
    ],
    "CPSC 488": [
      "Soil Fertility and Fertilizers",
      {
        "L1": [
          "49708",
          [
            [
              21,
              "MWF",
              "W115 Turner Hall",
              0,
              [
                "Mulvaney, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ],
        "MSU": [
          "49710",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Mulvaney, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as NRES 488. See NRES 488.",
      []
    ],
    "CPSC 489": [
      "Photosynthesis",
      {
        "100": [
          "40423",
          [
            [
              55,
              "MW",
              "ARR Institute for Genomic Biology",
              0,
              [
                "Lawson, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as BIOP 432 and IB 421. See IB 421.",
      []
    ],
    "CPSC 491": [
      "Ugrad Bioinformatics Seminar",
      {
        "A": [
          "55646",
          [
            [
              16,
              "R",
              "ONLINE",
              0,
              [
                "Rodriguez Zas, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          1,
          0,
          [],
          -1
        ],
        "B": [
          "68682",
          [
            [
              16,
              "R",
              "ONLINE",
              0,
              [
                "Rodriguez Zas, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          1,
          0,
          [],
          -1
        ],
        "C": [
          "71687",
          [
            [
              16,
              "R",
              "ONLINE",
              0,
              [
                "Rodriguez Zas, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as INFO 491. See INFO 491.",
      []
    ],
    "CPSC 499": [
      "Advanced Special Topics",
      {
        "CSE": [
          "77496",
          [
            [
              94,
              "TR",
              "337 National Soybean Res Ctr",
              0,
              [
                "Ersoz, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          9,
          0,
          [],
          -1
        ],
        "EH": [
          "57618",
          [
            [
              83,
              "M",
              "ONLINE",
              0,
              [
                "Heaton, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ],
        "JDA": [
          "76007",
          [
            [
              25,
              "M",
              "W223 Turner Hall",
              0,
              [
                "Arbelaez, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          9,
          0,
          [],
          -1
        ],
        "MH": [
          "56348",
          [
            [
              72,
              "T",
              "M205 Turner Hall",
              0,
              [
                "Hudson, M"
              ],
              -1,
              -1,
              -1
            ],
            [
              5,
              "T",
              "ONLINE",
              0,
              [
                "Hudson, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          14,
          0,
          [],
          -1
        ]
      },
      [],
      "Advanced experimental course on a special topic in crop sciences.",
      []
    ],
    "CPSC 554": [
      "Quantitative Genetics and Genomics",
      {
        "A": [
          "71660",
          [
            [
              18,
              "TR",
              "W115 Turner Hall",
              0,
              [
                "Rutkoski, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          9,
          0,
          [],
          -1
        ]
      },
      [],
      "Most important traits in plant species are quantitative, which means that they are affected by large numbers of genes and their interaction with the environment. Many techniques and tools have developed to try to accelerate quantitative trait improvement, however understanding these methods and how to apply them appropriately remains a significant challenge for breeders and breeding organizations. Through this course, students will gain knowledge on fundamental quantitative genetics concepts and learn how to apply this knowledge to everyday plant breeding situations. Special attention will be given to the application of QTL discovery, population improvement, and genomic selection in plant breeding programs. Each class will consist of a combination of lecture and in-class computer exercises conducted in small groups that the instructor will coach individually. Weekly readings from textbooks and/or primary sources will be assigned to help deepen student’s understanding of the topics covered in class.",
      []
    ],
    "CPSC 518": [
      "Crop Growth and Development",
      {
        "A": [
          "31648",
          [
            [
              12,
              "MWF",
              "W115 Turner Hall",
              0,
              [
                "Below, F"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          9,
          0,
          [],
          -1
        ],
        "OLP": [
          "44523",
          [
            [
              95,
              "W",
              "ONLINE",
              0,
              [
                "Sible, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Study of the physiological processes involved in growth and development of crop plants and the interaction of these processes with the environment that influences productivity.",
      []
    ],
    "CPSC 505": [
      "Research Methods in Crop Sciences",
      {
        "OLP": [
          "65758",
          [
            [
              95,
              "R",
              "ONLINE",
              0,
              [
                "Behnke, G"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          19,
          0,
          [],
          -1
        ]
      },
      [],
      "Lectures, discussions, and seminars dealing with research in crop sciences.",
      []
    ],
    "CPSC 540": [
      "Applied Statistical Methods II",
      {
        "AB1": [
          "71657",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Lipka, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          13,
          0,
          [],
          -1
        ],
        "AB2": [
          "71658",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Lipka, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          13,
          0,
          [],
          -1
        ],
        "AL1": [
          "71656",
          [
            [
              28,
              "TR",
              "150 Animal Sciences Laboratory",
              24,
              [
                "Lipka, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Statistical methods as tools for research. Principles of designing experiments and methods of analysis for various kinds of designs, experimental (completely randomized, randomized complete block, split plots, Latin square) and treatment (complete factorial); covariate analysis.",
      []
    ],
    "CPSC 567": [
      "Bioinformatics & Systems Biol",
      {
        "A": [
          "48285",
          [
            [
              54,
              "MW",
              "ONLINE",
              0,
              [
                "Caetano-Anolles, G"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          19,
          0,
          [],
          -1
        ]
      },
      [],
      "Bioinformatics and Systems Biology are emerging disciplines that address the need to manage and interpret the massive quantities of data generated by genomic research. In systems biology, advances in genomics, bioinformatics, and structural biology are used to generate global and unified views that integrate fragmentary knowledge of biological systems, their components and their interrelationships. This course is intended for students interested in the crossroads of biology and computational science and includes both lectures and hands-on experience.",
      []
    ],
    "CPSC 543": [
      "Appl. Multivariate Statistics",
      {
        "A": [
          "61169",
          [
            [
              72,
              "M",
              "M205 Turner Hall",
              0,
              [
                "Monteverde Dominguez, E"
              ],
              -1,
              -1,
              -1
            ],
            [
              96,
              "MW",
              "W223 Turner Hall",
              0,
              [
                "Monteverde Dominguez, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "This class introduces students to statistical methods that consider several variables at once. Emphasis will be given to the applications of multivariate methods to data sets in biology and ecology. Students will develop good knowledge as to how multivariate methods work, they will be able to apply these methods using SAS and R and they will be able to make inferences on the results of the analyses for subsequent scientific publication.",
      []
    ],
    "CPSC 566": [
      "Plant Gene Regulation",
      {
        "A": [
          "43483",
          [
            [
              13,
              "TR",
              "M5 Turner Hall",
              0,
              [
                "Studer, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          9,
          0,
          [],
          -1
        ]
      },
      [],
      "Current topics and literature on the function and regulation of higher plant genes. Topics of emphasis: transposable elements, their effect on gene expression and variation, and uses in tagging and isolating genes; the developmental, tissue specific, or environmental regulations of plant genes; the structure, synthesis, subcellular targeting, and regulation of major cereal and legume seed proteins; the use of genetic engineering to explore the regulation of plant genes or to alter traits of agricultural importance.",
      []
    ],
    "CPSC 569": [
      "Applied Bioinformatics",
      {
        "A": [
          "40264",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Caetano-Anolles, G",
                "Rodriguez Zas, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as ANSC 542 and IB 506. See ANSC 542.",
      []
    ],
    "CPSC 591": [
      "Grad Bioinformatics Seminar",
      {
        "A": [
          "55648",
          [
            [
              16,
              "R",
              "ONLINE",
              0,
              [
                "Rodriguez Zas, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          1,
          0,
          [],
          -1
        ],
        "B": [
          "68685",
          [
            [
              16,
              "R",
              "ONLINE",
              0,
              [
                "Rodriguez Zas, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          1,
          0,
          [],
          -1
        ],
        "C": [
          "71690",
          [
            [
              16,
              "R",
              "ONLINE",
              0,
              [
                "Rodriguez Zas, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as ANSC 591 and INFO 591. See INFO 591.",
      []
    ],
    "CPSC 598": [
      "Seminar",
      {
        "G1": [
          "31638",
          [
            [
              16,
              "W",
              "W109 Turner Hall",
              0,
              [
                "Marks, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          6,
          0,
          [],
          -1
        ]
      },
      [],
      "Current research in crops, genetic engineering, plant protection and other topics relevant to Crop Sciences.",
      []
    ],
    "CPSC 593": [
      "Adv Studies in Crop Sciences",
      {
        "": [
          "10567",
          [
            [
              5,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Directed studies of selected problems or topics relevant to Crop Sciences. Study may be in one of the following fields: 1) Plant Breeding and Genetics; 2) Plant Molecular Biology; 3) Plant Physiology; 4) Crop Production and Ecology; 5) Biometrics; 6) Plant Pathology; 7) Entomology; and 8) Weed Science.",
      []
    ]
  },
  "caches": {
    "periods": [
      "1600 - 1840",
      "1700 - 1940",
      "1300 - 1540",
      "0900 - 1140",
      "1400 - 1640",
      "0000 - 0000",
      "0930 - 1210",
      "1700 - 1820",
      "1130 - 1250",
      "1400 - 1700",
      "0900 - 1150",
      "0800 - 0850",
      "0900 - 0950",
      "0930 - 1050",
      "1030 - 1150",
      "0900 - 1020",
      "1200 - 1250",
      "1300 - 1350",
      "1100 - 1220",
      "1230 - 1350",
      "1400 - 1520",
      "1000 - 1050",
      "1100 - 1150",
      "1400 - 1450",
      "1500 - 1550",
      "1600 - 1650",
      "1200 - 1320",
      "1500 - 1620",
      "1530 - 1650",
      "1630 - 1750",
      "1400 - 1550",
      "1600 - 1750",
      "1300 - 1420",
      "1930 - 2050",
      "0800 - 0920",
      "0930 - 1020",
      "1700 - 1950",
      "1100 - 1250",
      "1700 - 1750",
      "1530 - 1820",
      "0800 - 1050",
      "1300 - 1550",
      "0930 - 1220",
      "1830 - 2020",
      "1500 - 1650",
      "1400 - 1720",
      "0900 - 1220",
      "1300 - 1620",
      "1200 - 1450",
      "1100 - 1450",
      "1500 - 1850",
      "1400 - 1650",
      "1600 - 1850",
      "0900 - 1050",
      "1000 - 1150",
      "1000 - 1120",
      "0800 - 0950",
      "0800 - 1150",
      "1300 - 1520",
      "1530 - 1645",
      "1100 - 1215",
      "1400 - 1515",
      "1700 - 1815",
      "1830 - 1945",
      "0930 - 1045",
      "1230 - 1345",
      "1530 - 1620",
      "1630 - 1720",
      "1600 - 1740",
      "1200 - 1350",
      "1800 - 1950",
      "1330 - 1450",
      "1300 - 1450",
      "1600 - 1720",
      "1830 - 1950",
      "1300 - 1750",
      "1300 - 1650",
      "1700 - 1850",
      "1230 - 1320",
      "1900 - 2050",
      "1530 - 1720",
      "1800 - 2100",
      "0900 - 1120",
      "1800 - 2050",
      "1800 - 1920",
      "1200 - 1650",
      "1100 - 1330",
      "1630 - 1920",
      "0930 - 1200",
      "1530 - 1800",
      "1000 - 2000",
      "1200 - 1550",
      "1300 - 1430",
      "1830 - 2130",
      "1600 - 1700",
      "1830 - 2100",
      "1430 - 1550"
    ],
    "dateRanges": [],
    "scheduleTypes": [
      "Studio",
      "Online",
      "Laboratory",
      "Conference",
      "Independent Study",
      "Travel",
      "Seminar",
      "Lecture",
      "Discussion/ Recitation",
      "Lecture-Discussion",
      "Internship",
      "Online Discussion",
      "Online Lecture",
      "Online Lab",
      "Laboratory-Discussion",
      "Research",
      "Practice",
      "Study Abroad",
      "Quiz",
      "Online Lecture Discussion"
    ],
    "campuses": [],
    "attributes": [],
    "restrictions": [],
    "gradeBases": [],
    "locations": [
      {
        "lat": null,
        "long": null
      },
      {
        "lat": 40.11246109008789,
        "long": -88.22831726074219
      },
      {
        "lat": 40.1083446,
        "long": -88.2282555
      },
      {
        "lat": 40.1131317,
        "long": -88.2264552
      },
      {
        "lat": 40.107534,
        "long": -88.2281548
      },
      {
        "lat": 40.1020773,
        "long": -88.2296394
      },
      {
        "lat": 40.105732,
        "long": -88.2281018
      },
      {
        "lat": 40.1072225,
        "long": -88.2262016
      },
      {
        "lat": 40.1110937,
        "long": -88.2232348
      },
      {
        "lat": 40.103587,
        "long": -88.230606
      },
      {
        "lat": 40.1108856,
        "long": -88.2269806
      },
      {
        "lat": 40.1109722,
        "long": -88.2282631
      },
      {
        "lat": 40.107811,
        "long": -88.2260761
      },
      {
        "lat": 40.1065684,
        "long": -88.2281746
      },
      {
        "lat": 40.10628,
        "long": -88.22621
      },
      {
        "lat": 40.1035872,
        "long": -88.2306061
      },
      {
        "lat": 40.10593795776367,
        "long": -88.2270736694336
      },
      {
        "lat": 40.101862,
        "long": -88.231737
      },
      {
        "lat": 40.1149296,
        "long": -88.2280589
      },
      {
        "lat": 40.1047599,
        "long": -88.2319514
      },
      {
        "lat": 40.104794,
        "long": -88.224264
      },
      {
        "lat": 40.111691,
        "long": -88.2242511
      },
      {
        "lat": 40.1035833,
        "long": -88.228405
      },
      {
        "lat": 40.1033599,
        "long": -88.2292111
      },
      {
        "lat": 40.0995003,
        "long": -88.223104
      }
    ],
    "finalDates": [],
    "finalTimes": []
  }
}