{
  "subject": "ENGL",
  "scrapedAt": 1768543665036,
  "courseCount": 61,
  "courses": {
    "ENGL 116": [
      "Introduction to American Literature",
      {
        "C": [
          "31935",
          [
            [
              4,
              "MWF",
              "150 English Building",
              8,
              [
                "Bishop, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "American literature speaks in distinctive dialects that pre-date the arrival of European explorers in the Renaissance, range across centuries and continents, and intermingle a rich variety of racial, ethnic, and gendered perspectives. Genres examined in this course might include lyric poems, dystopian novels, horror stories, seduction narratives, slave narratives, political speeches, or postmodern plays. Writers studied might include Walt Whitman, Columbus, Jane Johnston Schoolcraft, Herman Melville, Edgar Allan Poe, Junot Díaz, Harriet Beecher Stowe, David Foster Wallace, Martin Luther King, and Lin-Manuel Miranda.",
      []
    ],
    "ENGL 121": [
      "Introduction to Comics",
      {
        "E": [
          "62333",
          [
            [
              7,
              "MWF",
              "1022 Lincoln Hall",
              4,
              [
                "Flood, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduction to graphic narratives---comic books, comic strips, graphic novels, manga, webcomics, and so on---from a diverse panoply of cultural, formal, and historical traditions.",
      []
    ],
    "ENGL 119": [
      "Literature of Fantasy",
      {
        "M": [
          "47149",
          [
            [
              7,
              "MWF",
              "104 English Building",
              8,
              [
                "Barrett, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduction to the rich traditions of fantasy writing in world literature. While the commercial category of fantasy post-Tolkien will often be the focal point, individual instructors may choose to focus on alternate definitions of the genre: literatures of the fantastic, the uncanny, and the weird; fantasy before the Enlightenment and the advent of realism; fantasy for young adult or child readers; and so on.",
      []
    ],
    "ENGL 109": [
      "Intro to Fiction-ACP",
      {
        "D": [
          "34586",
          [
            [
              5,
              "MWF",
              "131 English Building",
              8,
              [
                "Rivera Lopez, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "F": [
          "47237",
          [
            [
              8,
              "MWF",
              "131 English Building",
              8,
              [
                "Kim, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "L": [
          "31925",
          [
            [
              104,
              "TR",
              "119 English Building",
              8,
              [
                "Landes, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "S": [
          "31922",
          [
            [
              103,
              "TR",
              "137 Henry Administration Bldg",
              27,
              [
                "Gomez, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduction to critical analysis of prose fiction. Explores a wide range of short and long fiction across historical periods; examines narrative strategies such as plot, character, and point of view. Special emphasis placed on good literary critical writing. Course is similar to ENGL 103 except for the additional writing component.",
      []
    ],
    "ENGL 199": [
      "Undergraduate Open Seminar",
      {
        "": [
          "10065",
          [
            [
              12,
              "",
              "ONLINE",
              7,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          5,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Topics course that varies each semester and by section. The topics offered each semester will be listed in the Class Schedule.",
      []
    ],
    "ENGL 104": [
      "Introduction to Film",
      {
        "B": [
          "34551",
          [
            [
              59,
              "TR",
              "148 Armory",
              0,
              [
                "Demirel, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "D": [
          "34547",
          [
            [
              5,
              "MWF",
              "148 Armory",
              0,
              [
                "Castaneda, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "E": [
          "48003",
          [
            [
              7,
              "MWF",
              "148 Armory",
              0,
              [
                "Basu, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "M": [
          "34541",
          [
            [
              4,
              "MWF",
              "148 Armory",
              0,
              [
                "Mridha, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "S": [
          "34538",
          [
            [
              8,
              "MWF",
              "148 Armory",
              0,
              [
                "Shetina, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "Y": [
          "43489",
          [
            [
              104,
              "TR",
              "148 Armory",
              0,
              [
                "Gunter, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "[IAI Code: F2908] Thoughtful viewing of diverse films, along with ample discussion and critical reading and writing, to gain understanding of cinematic expression and of film's capacity to entertain and to exert artistic and social influence.",
      []
    ],
    "ENGL 202": [
      "Medieval Literature and Culture",
      {
        "S": [
          "43183",
          [
            [
              103,
              "TR",
              "149 Henry Administration Bldg",
              27,
              [
                "Koepke, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduction to the diverse literatures and cultures of the global Middle Ages (approximately 500-1500 CE). Students will read works by medieval authors in Modern English translation, with particular attention to placing works in their historical and material contexts.",
      []
    ],
    "ENGL 200": [
      "Introduction to the Study of Literature and Culture",
      {
        "E": [
          "60132",
          [
            [
              5,
              "MWF",
              "1057 Lincoln Hall",
              4,
              [
                "Kempf, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "F": [
          "39032",
          [
            [
              59,
              "TR",
              "115 English Building",
              8,
              [
                "Pollock, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "L": [
          "34521",
          [
            [
              10,
              "TR",
              "36 English Building",
              8,
              [
                "Loughran, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "X": [
          "34519",
          [
            [
              8,
              "MWF",
              "69 English Building",
              8,
              [
                "Shetina, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduction to the study of literature in the twenty-first century. This course will expand your sense of what literature is and where it happens, including discussion of old and new literary forms (from novels, poems, and plays to comic books, video games, and films). Along the way, students will explore some of the literary and cultural opportunities (such as author readings, scholarly talks, and performances) available to them on a large public university campus, with two goals in mind: to develop your critical interpretive skills and to acquaint you with the discipline of literary studies as it is being practiced all around us today, both inside and outside the conventional classroom.",
      []
    ],
    "ENGL 207": [
      "Romantic Literature and Culture",
      {
        "Z1": [
          "31989",
          [
            [
              4,
              "MWF",
              "104 English Building",
              8,
              [
                "Wood, G"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "An introduction to the literature, philosophy, fine arts, and social criticism of the Romantic era, with attention to broader cultural and historical issues.",
      []
    ],
    "ENGL 206": [
      "Enlightenment Literature and Culture",
      {
        "B": [
          "31983",
          [
            [
              10,
              "TR",
              "ONLINE",
              7,
              [
                "Nazar, H"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Study in Anglophone and global texts from the period 1600 to 1800, with attention to cultural and historical contexts.",
      []
    ],
    "ENGL 211": [
      "Introduction to Modern African Literature",
      {
        "P": [
          "47158",
          [
            [
              5,
              "MWF",
              "36 English Building",
              8,
              [
                "Toure, V"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as AFST 210 and CWL 210. See AFST 210.",
      []
    ],
    "ENGL 209": [
      "Early British Literature and Culture",
      {
        "AD1": [
          "31994",
          [
            [
              4,
              "F",
              "113 English Building",
              8,
              [
                "Mendoza, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AD2": [
          "31997",
          [
            [
              5,
              "F",
              "113 English Building",
              8,
              [
                "Mendoza, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AD3": [
          "32004",
          [
            [
              6,
              "F",
              "113 English Building",
              8,
              [
                "Mecolli, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AD4": [
          "32008",
          [
            [
              7,
              "F",
              "113 English Building",
              8,
              [
                "Mecolli, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AL1": [
          "32013",
          [
            [
              5,
              "MW",
              "140 Burrill Hall",
              21,
              [
                "Stevens, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "[IAI Code: H3912] This course surveys more than a thousand years of British literature from the early Middle Ages through the Renaissance and well into the eighteenth century. But what does \"British literature\" really mean, especially in the context of an island archipelago populated by multiple nations (England, Ireland, Scotland, and Wales) and repeatedly subjected to foreign rule (either by violent invasion or dynastic succession)? The range of texts we thus characterize as \"early British literature\" is staggering, and part of our goal in this course will simply be to appreciate the sheer volume and breadth of written work created in Britain and Ireland between the sixth and eighteenth centuries. We will do this through a necessarily selective sampling of historical periods, languages, and genres. Our authors will range from the famous (e.g., Chaucer, Shakespeare, and Milton) to the lesser-known (e.g., Marie de France, Lady Mary Wroth, and Eliza Haywood) to the unknown (e.g., the anonymous Beowulf-poet).",
      []
    ],
    "ENGL 213": [
      "Modernist Literature and Culture",
      {
        "S": [
          "32055",
          [
            [
              6,
              "MWF",
              "104 English Building",
              8,
              [
                "Zuniga, I"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Study of literature, philosophy, visual and performing arts, social criticism, and popular sciences of the Anglo-American modernist period (approximately 1900-1950), with attention to broad cultural issues.",
      []
    ],
    "ENGL 221": [
      "Speculative Futures",
      {
        "A": [
          "76373",
          [
            [
              10,
              "TR",
              "1060 Lincoln Hall",
              4,
              [
                "Jenkins, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduces majors and non-majors to several important conversations arising from the expansive genre of speculative fiction. In this course students will explore some of the most profound, disturbing, and downright bizarre imaginings of the future that human beings have generated. Climate change, ageing, fascist regimes, reproductive rights, technological failures, scientific advancements, and apocalypse are just a few of the possible topics for this class. Course materials will be drawn from literary works, contemporary and historical scientific developments, and cultural theory to explore how and why speculative futures are linked to specific cultural contexts, technologies, and social schemes.",
      []
    ],
    "ENGL 245": [
      "The Short Story",
      {
        "Q2": [
          "32060",
          [
            [
              107,
              "TR",
              "115 David Kinley Hall",
              14,
              [
                "Millen, V"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Historical and critical study of the short story (American and European) from the early nineteenth century to the present.",
      []
    ],
    "ENGL 218": [
      "Introduction to Shakespeare",
      {
        "S1": [
          "32058",
          [
            [
              23,
              "MWF",
              "1027 Lincoln Hall",
              4,
              [
                "Newcomb, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "[IAI Code: H3905] Representative readings of Shakespeare's drama and poetry in the context of his age, with emphasis on major plays; selections vary from section to section.",
      []
    ],
    "ENGL 241": [
      "Modern Poetry",
      {
        "D": [
          "45952",
          [
            [
              6,
              "MWF",
              "69 English Building",
              8,
              [
                "Wood, G"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Studies poetry in English during the first half of the twentieth century, including Modernist experimentalism and its aftermath. Class time focuses on close readings of poems by major figures such as W. B. Yeats, T. S. Eliot, Ezra Pound, H.D., Hart Crane, Claude McKay, Robert Lowell, Elizabeth Bishop, W. H. Auden, and Langston Hughes.",
      []
    ],
    "ENGL 250": [
      "Nineteenth-Century American Fiction",
      {
        "M": [
          "32064",
          [
            [
              4,
              "MWF",
              "69 English Building",
              8,
              [
                "Freeburg, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Nineteenth-century fiction gave us some of the most iconic images in American culture--the scarlet letter, the white whale--and some of the most captivating works about American life and society. This course will explore how fictional texts articulated the problems of nineteenth-century democracy, including the crises over slavery leading to the Civil War, and the rise of large-scale capitalism and urban modernity later in the century. We will look at such literary movements as sentimentalism, sensationalism, realism, and naturalism, among others. Writers studied might include Herman Melville, Edith Wharton, Nathaniel Hawthorne, Harriet Beecher Stowe, Henry James, Charles Chesnutt, Mark Twain, Pauline Hopkins, Catharine Maria Sedgwick, and many others.",
      []
    ],
    "ENGL 224": [
      "Latina/o Popular Culture",
      {
        "A": [
          "59361",
          [
            [
              2,
              "TR",
              "103 1207 W Oregon",
              10,
              [
                "Rodriguez, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as LLS 240 and SPAN 240. See LLS 240.",
      []
    ],
    "ENGL 225": [
      "Intro to Latina/o Literature",
      {
        "A": [
          "58884",
          [
            [
              44,
              "MW",
              "215B David Kinley Hall",
              14,
              [
                "Bonilla, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as LLS 242 and SPAN 242. See LLS 242.",
      []
    ],
    "ENGL 265": [
      "Intro to American Indian Lit",
      {
        "A": [
          "51091",
          [
            [
              2,
              "TR",
              "1065 Lincoln Hall",
              4,
              [
                "Calcaterra, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      null,
      []
    ],
    "ENGL 251": [
      "The Twentieth-Century American Novel",
      {
        "Z": [
          "32065",
          [
            [
              4,
              "MWF",
              "2078 Natural History Building",
              6,
              [
                "Hutner, G"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Critical study of selected American novels from the twentieth century.",
      []
    ],
    "ENGL 255": [
      "Early American Literature and Culture",
      {
        "AD1": [
          "32071",
          [
            [
              4,
              "F",
              "123 English Building",
              8,
              [
                "Myers, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AD2": [
          "32072",
          [
            [
              5,
              "F",
              "123 English Building",
              8,
              [
                "Myers, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AD3": [
          "32070",
          [
            [
              6,
              "F",
              "123 English Building",
              8,
              [
                "Streitmatter, O"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AD4": [
          "43188",
          [
            [
              7,
              "F",
              "123 English Building",
              8,
              [
                "Streitmatter, O"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AL1": [
          "32075",
          [
            [
              6,
              "MW",
              "157 Noyes Laboratory",
              26,
              [
                "Barnard, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "[IAI Code: H3914] This large-scale survey course offers students background in a wide range of genres, authors, and texts, focusing on \"early American literature,\" which ranges from pre-Columbian indigenous narratives to nineteenth century novels, poems, and plays. The material studied ranges across multiple centuries and continents, and includes a wide variety of racial, ethnic, and gendered perspectives. Writers may include Christopher Columbus, Anne Bradstreet, Benjamin Franklin, Phillis Wheatley, William Apess, Nathaniel Hawthorne, Edgar Allan Poe, Frederick Douglass, Henry David Thoreau, Herman Melville, Harriet Jacobs, Walt Whitman, and Emily Dickinson.",
      []
    ],
    "ENGL 290": [
      "Individual Study",
      {
        "": [
          "10067",
          [
            [
              12,
              "",
              "ONLINE",
              7,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Approved for both letter and S/U grading. May be repeated to a maximum of 6 hours. Students may register in more than one section per term. Prerequisite: Consent of instructor.",
      []
    ],
    "ENGL 260": [
      "Modern African American Literature and Culture",
      {
        "S": [
          "49622",
          [
            [
              59,
              "TR",
              "162 Noyes Laboratory",
              26,
              [
                "Claborn, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "[IAI Code: H3910D] Historical and critical study of African American literature in its social and cultural context between 1915 and 1980.",
      []
    ],
    "ENGL 277": [
      "Gender in Gaming",
      {
        "KMS": [
          "69159",
          [
            [
              149,
              "T",
              "2036 Campus Instructional Facility",
              13,
              [
                "Starks, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as GSD 204, GWS 204 and MACS 204. See GSD 204.",
      []
    ],
    "ENGL 266": [
      "Grimm's Fairy Tales in Context",
      {
        "AD1": [
          "60017",
          [
            [
              4,
              "F",
              "115 David Kinley Hall",
              14,
              [
                "Horn, R",
                "Johnson, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AD2": [
          "60020",
          [
            [
              5,
              "F",
              "115 David Kinley Hall",
              14,
              [
                "Horn, R",
                "Johnson, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AD3": [
          "60023",
          [
            [
              7,
              "F",
              "115 David Kinley Hall",
              14,
              [
                "Agu, B",
                "Johnson, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AD4": [
          "68660",
          [
            [
              3,
              "F",
              "115 David Kinley Hall",
              14,
              [
                "Horn, R",
                "Johnson, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AD5": [
          "68661",
          [
            [
              6,
              "F",
              "115 David Kinley Hall",
              14,
              [
                "Agu, B",
                "Johnson, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AD6": [
          "68662",
          [
            [
              8,
              "F",
              "115 David Kinley Hall",
              14,
              [
                "Agu, B",
                "Johnson, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "AL1": [
          "60026",
          [
            [
              8,
              "MW",
              "116 Roger Adams Laboratory",
              24,
              [
                "Johnson, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as CWL 254 and GER 251. See GER 251.",
      []
    ],
    "ENGL 286": [
      "Asian American Literature",
      {
        "P": [
          "32111",
          [
            [
              4,
              "MWF",
              "1022 Lincoln Hall",
              4,
              [
                "Villanueva, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduction to Asian American literary studies and culture through the reading of major works of literature selected from but not limited to the following American ethnic subgroups: Chinese, Filipino, Japanese, Korean, Indian, Pakistani, and Vietnamese.",
      []
    ],
    "ENGL 285": [
      "Postcolonial Literature in English",
      {
        "M": [
          "32110",
          [
            [
              8,
              "MWF",
              "104 English Building",
              8,
              [
                "Labella, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Examination of selected postcolonial literature, theory, and film as texts that \"write back\" to dominant European representations of power, identity, gender and the Other. Postcolonial writers, critics and filmmakers studied may include Franz Fanon, Edward Said, Aime Cesaire, Ousmane Sembene, Chinua Achebe, Michelle Cliff, Mahesweta Devi, Buchi Emecheta, Derek Walcott and Marlene Nourbese-Philip.",
      []
    ],
    "ENGL 276": [
      "Asian Film Genres",
      {
        "BH": [
          "65125",
          [
            [
              59,
              "TR",
              "108 Bevier Hall",
              22,
              [
                "He, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Studies a variable selection of popular film genres produced and circulated in Asia (e.g., martial arts, horror, musicals, anime, melodramas, science fiction, monster movies, comedy) that have an impact across the region, with emphasis on East and Southeast Asia, and beyond. Takes a historical and transnational comparative approach to analyzing shifting narrative and visual and other cinematic realizations of each genre across different contexts, including Western reception and cross-cultural adaptations.",
      []
    ],
    "ENGL 301": [
      "Introduction to Critical Theory",
      {
        "D": [
          "48565",
          [
            [
              5,
              "MWF",
              "336 Davenport Hall",
              5,
              [
                "Gilmore, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "Q": [
          "48564",
          [
            [
              10,
              "TR",
              "303 English Building",
              8,
              [
                "Basu, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "S": [
          "48566",
          [
            [
              107,
              "TR",
              "119 English Building",
              8,
              [
                "Loughran, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduction to the critical frameworks and methods that have had the greatest impact on the field of literary studies. Students will read, discuss, and write about numerous theoretical approaches, which might include (but are not limited to) critical race studies, environmental theory, feminism, Marxism, postcolonialism, poststructuralism, psychoanalysis, queer theory, and structuralism. No previous background with theory is required.",
      []
    ],
    "ENGL 323": [
      "Tolstoy",
      {
        "U3": [
          "69042",
          [
            [
              13,
              "TR",
              "226 Wohlers Hall",
              9,
              [
                "Sobol, V"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as CWL 323 and RUSS 323. See RUSS 323.",
      []
    ],
    "ENGL 311": [
      "History of the English Language",
      {
        "C": [
          "63930",
          [
            [
              6,
              "MWF",
              "29 English Building",
              8,
              [
                "Menendez, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Language variation and change from the earliest forms of English to the present day, with emphasis on the rise of Standard English and the social, geographic, and cultural aspects of linguistic change in English.",
      []
    ],
    "ENGL 325": [
      "Topics in LGBT Literature and Film",
      {
        "P": [
          "58612",
          [
            [
              4,
              "MWF",
              "1120 Literatures, Cultures, & Ling",
              3,
              [
                "Dickerson, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Explores topics on representations of non-heteronormative sexuality in canonical and recovered historical texts and in contemporary literature, on literature by LGBT authors, and on theories of sexuality that pertain to systems of textual and cultural meaning.",
      []
    ],
    "ENGL 350": [
      "Writing about Literature, Text, and Culture",
      {
        "B": [
          "70306",
          [
            [
              10,
              "TR",
              "1024 Lincoln Hall",
              4,
              [
                "Morris, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "F": [
          "70307",
          [
            [
              23,
              "MWF",
              "131 English Building",
              8,
              [
                "Newcomb, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "S": [
          "70308",
          [
            [
              5,
              "MWF",
              "111 David Kinley Hall",
              14,
              [
                "Basu, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Writing-intensive, variable-topic course designed to improve English majors' ability to produce clear, well-organized, analytically sound and persuasively argued essays relevant to English studies. Introduces students to research techniques through the examination of critical texts appropriate to the course topic.",
      []
    ],
    "ENGL 390": [
      "Advanced Individual Study",
      {
        "": [
          "54016",
          [
            [
              12,
              "",
              "ONLINE",
              7,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Advanced study of selected topics.",
      []
    ],
    "ENGL 357": [
      "Literatures of the Displaced",
      {
        "A": [
          "70258",
          [
            [
              0,
              "TR",
              "103 1207 W Oregon",
              10,
              [
                "de la Garza Valenzuela, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as AAS 357, AIS 357, GWS 357, and LLS 357. See LLS 357.",
      []
    ],
    "ENGL 380": [
      "Topics in Writing Studies",
      {
        "S1": [
          "59085",
          [
            [
              23,
              "MWF",
              "44 English Building",
              8,
              [
                "Gallagher, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Advanced-level work in the field of Writing Studies. Building upon a traditional disciplinary understanding of writing as rhetoric, this course invites students to call upon sociological, anthropological, and/or ideological approaches to the study of writing in order to understand the myriad ways that writing makes meaning(s). See Class Schedule for topics.",
      []
    ],
    "ENGL 373": [
      "Special Topics in Film Studies",
      {
        "S": [
          "46555",
          [
            [
              150,
              "TR",
              "148 Armory",
              0,
              [
                "Basu, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Extended investigation of major subjects and issues in cinema and other media; topics vary and typically include studies of author/directors, genres, historical movements, critical approaches, and themes.",
      []
    ],
    "ENGL 396": [
      "English Honors Seminar",
      {
        "D": [
          "32113",
          [
            [
              6,
              "MWF",
              "135 English Building",
              8,
              [
                "McNulty, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "X": [
          "32114",
          [
            [
              103,
              "TR",
              "123 English Building",
              8,
              [
                "Pollock, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "An open-topic, discussion-oriented seminar aimed at majors who have shown high skill and intensive interest in the area of English studies.",
      []
    ],
    "ENGL 360": [
      "Environmental Writing",
      {
        "A": [
          "67941",
          [
            [
              12,
              "",
              "ONLINE",
              7,
              [
                "Tomkin, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ],
        "B": [
          "67477",
          [
            [
              2,
              "TR",
              "313 Gregory Hall",
              1,
              [
                "Gaffney, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      null,
      []
    ],
    "ENGL 391": [
      "Honors Individual Study",
      {
        "": [
          "10069",
          [
            [
              12,
              "",
              "ONLINE",
              7,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Study of selected topics. Restricted to English and English education majors with a 3.33 average who are working towards the degree with distinction in English or in English education.",
      []
    ],
    "ENGL 418": [
      "Shakespeare",
      {
        "1G": [
          "54465",
          [
            [
              7,
              "MWF",
              "150 English Building",
              8,
              [
                "Newcomb, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ],
        "1U": [
          "54464",
          [
            [
              7,
              "MWF",
              "150 English Building",
              8,
              [
                "Newcomb, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Survey of the plays and poems of William Shakespeare. Reading assignments will reflect the generic diversity and historical breadth of Shakespeare's work.",
      []
    ],
    "ENGL 402": [
      "Descriptive English Grammar",
      {
        "1G": [
          "32124",
          [
            [
              8,
              "MWF",
              "115 English Building",
              8,
              [
                "Kraft, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ],
        "1U": [
          "32123",
          [
            [
              8,
              "MWF",
              "115 English Building",
              8,
              [
                "Kraft, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "An introduction to English linguistics with emphasis on the phonetic, syntactic, and semantic structures of English; language variation, standardization, and change; language legislation and linguistic rights; English as a world language; and the study of language in American schools.",
      []
    ],
    "ENGL 441": [
      "Innovation and Conflict in British and Irish Modernism",
      {
        "1G": [
          "39271",
          [
            [
              59,
              "TR",
              "215 Davenport Hall",
              5,
              [
                "McLeer, H"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ],
        "1U": [
          "39270",
          [
            [
              59,
              "TR",
              "215 Davenport Hall",
              5,
              [
                "McLeer, H"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "This course will examine British and Irish modernism, one of the most dynamic, provocative, and experimental periods in literary history. The early decades of the twentieth century witnessed the rapid introduction of new technologies, the upheaval of global politics, the radical transformation of gender roles, and the traumatic fallout from two world wars. The period's literature and art processed these turbulent cultural experiences through extreme formal experimentation, and this course will consider many of the key works emerging from the modernist and avant-garde movements. Among the authors we'll study are Joseph Conrad, W. B. Yeats, James Joyce, Virginia Woolf, T.S. Eliot, Charlie Chaplin, and Samuel Beckett.",
      []
    ],
    "ENGL 467": [
      "Multimedia Environmental Communications",
      {
        "A": [
          "70524",
          [
            [
              26,
              "TR",
              "1128 Literatures, Cultures, & Ling",
              3,
              [
                "Becker, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      null,
      []
    ],
    "ENGL 478": [
      "Science, Technology, and Narrative",
      {
        "1G": [
          "77934",
          [
            [
              10,
              "TR",
              "ONLINE",
              7,
              [
                "Littlefield, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ],
        "1U": [
          "77933",
          [
            [
              10,
              "TR",
              "ONLINE",
              7,
              [
                "Littlefield, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "This advanced literature and science seminar examines the role of narrative in the production, distribution, and uptake of scientific knowledge. Students will explore a range of contemporary and historical topics such as climate change, genetics, and artificial intelligence. Texts and other media will be drawn from literary fiction, scientific articles, journalism and popular culture. The course will focus on marginalized voices and the interdisciplinary methods of literature and science and science studies.",
      []
    ],
    "ENGL 460": [
      "Literature of American Minorities",
      {
        "7G": [
          "74234",
          [
            [
              107,
              "TR",
              "140 Henry Administration Bldg",
              27,
              [
                "Green, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ],
        "7U": [
          "74233",
          [
            [
              107,
              "TR",
              "140 Henry Administration Bldg",
              27,
              [
                "Green, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Advanced topics seminar exploring literary expressions of minority experience in America.",
      []
    ],
    "ENGL 498": [
      "Environmental Writing for Publication",
      {
        "A": [
          "67479",
          [
            [
              11,
              "TR",
              "G48 Literatures, Cultures, & Ling",
              3,
              [
                "Cole, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      null,
      []
    ],
    "ENGL 450": [
      "Becoming Modern: American Literature, 1865-1914",
      {
        "1G": [
          "39267",
          [
            [
              6,
              "MWF",
              "119 English Building",
              8,
              [
                "Newcomb, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ],
        "1U": [
          "39266",
          [
            [
              6,
              "MWF",
              "119 English Building",
              8,
              [
                "Newcomb, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "After the Civil War the United States entered a period of accelerating modernization and change. This course addresses how the nation's writers helped build modern America in response to a host of exciting and daunting developments in economics, science, and politics, including the enfranchisement of African Americans, Jim Crow segregation laws, growing income inequality, the rise of unions and anarchist movements, the invention of the automobile and the department store, new sciences such as including Darwinism and psychoanalysis, and American empire-building in places like Hawai'i and the Philippines. Writers studied might include Emily Dickinson, Mark Twain, Henry James, Booker T. Washington, W.E.B. DuBois, Zitkala-Sa, Stephen Crane, William Dean Howells, and Edith Wharton.",
      []
    ],
    "ENGL 481": [
      "Composition Theory and Practice",
      {
        "1G": [
          "44165",
          [
            [
              7,
              "MWF",
              "331 Gregory Hall",
              1,
              [
                "Gallagher, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ],
        "1U": [
          "39291",
          [
            [
              7,
              "MWF",
              "331 Gregory Hall",
              1,
              [
                "Gallagher, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Study of the history and theory of written composition. This course explores basic rhetorical principles, various theoretical perspectives in the field of composition/rhetoric, and helps students form practical approaches to the guidance of, response to, and structuring of student writing.",
      []
    ],
    "ENGL 496": [
      "Experiments in Queer of Color Performance",
      {
        "A": [
          "77988",
          [
            [
              1,
              "WF",
              "1000 Siebel Center for Design",
              12,
              [
                "Ruiz, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as AAS 496, FAA 496, GWS 496, and THEA 486. See FAA 496.",
      []
    ],
    "ENGL 524": [
      "Seminar in Early Modern Literature",
      {
        "R": [
          "32264",
          [
            [
              24,
              "R",
              "307 English Building",
              8,
              [
                "Perry, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Seminar dedicated to the study of texts, genres, themes, and/or theoretical issues from the non-Shakespearean literature of the early modern period (approximately 1500-1700).",
      []
    ],
    "ENGL 504": [
      "Theories of Cinema",
      {
        "A": [
          "43352",
          [
            [
              132,
              "W",
              "331 Gregory Hall",
              1,
              [
                "Oyallon-Koloski, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as CWL 504 and MACS 504. See MACS 504.",
      []
    ],
    "ENGL 559": [
      "Seminar Afro-American Lit",
      {
        "X": [
          "39298",
          [
            [
              10,
              "TR",
              "123 English Building",
              8,
              [
                "Mack, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "May be repeated if topics vary. Prerequisite: One college course devoted entirely to an aspect of American literature or consent of instructor.",
      []
    ],
    "ENGL 581": [
      "Seminar Literary Theory",
      {
        "G": [
          "48036",
          [
            [
              68,
              "W",
              "113 English Building",
              8,
              [
                "Somerville, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ],
        "WH": [
          "78049",
          [
            [
              62,
              "R",
              "1136 Literatures, Cultures, & Ling",
              3,
              [
                "Hassan, W"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "May be repeated if topics vary. Prerequisite: A college course devoted entirely to criticism or consent of instructor.",
      []
    ],
    "ENGL 591": [
      "Research in Special Topics",
      {
        "": [
          "10073",
          [
            [
              12,
              "",
              "ONLINE",
              7,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ],
        "CW2": [
          "69763",
          [
            [
              12,
              "",
              "ONLINE",
              7,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Independent study under the guidance of a member of the graduate faculty.",
      []
    ],
    "ENGL 563": [
      "Seminar Themes and Movements",
      {
        "B": [
          "32280",
          [
            [
              24,
              "T",
              "307 English Building",
              8,
              [
                "Soto Crespo, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "May be repeated if topics vary. Prerequisite: One year of graduate study of literature or consent of instructor.",
      []
    ],
    "ENGL 593": [
      "Professional Seminar in College Teaching",
      {
        "MB": [
          "45985",
          [
            [
              151,
              "W",
              "ONLINE",
              7,
              [
                "Nazar, H"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Seminar on undergraduate pedagogy for new graduate instructors. Individual sections will focus on the teaching of film, literature, or rhetoric.",
      []
    ],
    "ENGL 582": [
      "Topics Research and Writing",
      {
        "T": [
          "43360",
          [
            [
              117,
              "T",
              "107A English Building",
              8,
              [
                "McKinney, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Focuses on the diverse research paradigms that are often employed in the study of writing processes. Topics will vary each term. Examines past and current writing research in the topic area with an emphasis on the critical examination of research designs and the influence of epistemologies on the interpretation of data.",
      []
    ],
    "ENGL 583": [
      "Topics Writ Pedagogy & Design",
      {
        "T": [
          "32285",
          [
            [
              118,
              "R",
              "107A English Building",
              8,
              [
                "Mortensen, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Examines the relationships among writing studies, theories of pedagogy, and the practice of the writing teacher and administrator. Also focuses on particular problems or particular schools of thought. Typical topics include Writing Program Design and Administration; Writing, Thinking, and Problem Solving; The Classroom as a Research Site; Collaborative Learning; and Writing Across the Curriculum and Discourse Communities. Requirements will vary with instructors and topics.",
      []
    ]
  },
  "caches": {
    "periods": [
      "1100 - 1220",
      "1400 - 1650",
      "0930 - 1050",
      "0900 - 0950",
      "1000 - 1050",
      "1100 - 1150",
      "1200 - 1250",
      "1300 - 1350",
      "1400 - 1450",
      "1600 - 1715",
      "0930 - 1045",
      "1230 - 1350",
      "ARRANGED",
      "1400 - 1520",
      "1400 - 1550",
      "1500 - 1720",
      "1400 - 1720",
      "1600 - 1720",
      "1300 - 1450",
      "1500 - 1650",
      "0800 - 0950",
      "0900 - 1150",
      "0900 - 1020",
      "1500 - 1550",
      "1400 - 1630",
      "0800 - 0920",
      "1530 - 1650",
      "0800 - 0850",
      "1700 - 1820",
      "1530 - 1620",
      "2000 - 2050",
      "0800 - 1150",
      "1200 - 1550",
      "1230 - 1620",
      "0830 - 0920",
      "1500 - 1750",
      "1300 - 1650",
      "1500 - 1620",
      "1700 - 1850",
      "0900 - 1050",
      "1100 - 1250",
      "1200 - 1320",
      "1600 - 1750",
      "1600 - 1650",
      "1000 - 1120",
      "1130 - 1250",
      "1030 - 1150",
      "1300 - 1420",
      "1600 - 1730",
      "1230 - 1320",
      "1330 - 1520",
      "1530 - 1710",
      "1630 - 1750",
      "1430 - 1550",
      "1730 - 1850",
      "1730 - 1920",
      "1000 - 1150",
      "1530 - 1820",
      "1700 - 1750",
      "1100 - 1215",
      "0800 - 0959",
      "1530 - 1730",
      "1500 - 1700",
      "1700 - 1900",
      "1730 - 1930",
      "0600 - 0730",
      "1700 - 1950",
      "1200 - 1450",
      "1500 - 1730",
      "0930 - 1020",
      "1730 - 2030",
      "1300 - 1550",
      "1730 - 1900",
      "1830 - 1950",
      "1100 - 1350",
      "1800 - 2050",
      "1300 - 1520",
      "1300 - 1750",
      "1030 - 1120",
      "1430 - 1520",
      "1630 - 1720",
      "1130 - 1220",
      "0930 - 1220",
      "0800 - 1050",
      "1200 - 1420",
      "0930 - 1120",
      "1800 - 1950",
      "1600 - 1840",
      "1400 - 1640",
      "1700 - 1940",
      "0930 - 1210",
      "0900 - 1140",
      "1300 - 1540",
      "1330 - 1450",
      "1530 - 1800",
      "1400 - 1700",
      "1930 - 2050",
      "1830 - 2020",
      "0900 - 1220",
      "1300 - 1620",
      "1100 - 1450",
      "1500 - 1850",
      "1600 - 1850",
      "1400 - 1515",
      "1530 - 1645",
      "1700 - 1815",
      "1830 - 1945",
      "1230 - 1345",
      "1600 - 1740",
      "1200 - 1350",
      "1900 - 2050",
      "1530 - 1720",
      "1800 - 2100",
      "0900 - 1120",
      "1800 - 1920",
      "1200 - 1650",
      "1630 - 1920",
      "1100 - 1330",
      "0930 - 1200",
      "1000 - 2000",
      "1300 - 1430",
      "1830 - 2130",
      "1830 - 2100",
      "1600 - 1700",
      "1700 - 1800",
      "1000 - 1250",
      "1630 - 1745",
      "1630 - 1730",
      "1730 - 1845",
      "1300 - 1415",
      "1300 - 1600",
      "1000 - 1220",
      "1430 - 1820",
      "0900 - 1030",
      "1035 - 1150",
      "1430 - 1630",
      "1450 - 1735",
      "1400 - 1620",
      "1530 - 1750",
      "1145 - 1305",
      "0830 - 0950",
      "1100 - 1230",
      "1600 - 1800",
      "1800 - 2000",
      "1900 - 1930",
      "0730 - 1530",
      "1530 - 1550",
      "1000 - 1700",
      "1630 - 1800",
      "1100 - 1320",
      "1230 - 1430",
      "1200 - 1430"
    ],
    "dateRanges": [],
    "scheduleTypes": [
      "Lecture-Discussion",
      "Discussion/ Recitation",
      "Lecture",
      "Online",
      "Independent Study",
      "Laboratory-Discussion",
      "Laboratory",
      "Online Lecture",
      "Online Discussion",
      "Conference",
      "Online Lecture Discussion",
      "Seminar",
      "Study Abroad",
      "Internship",
      "Research",
      "Travel",
      "Studio",
      "Online Lab",
      "Practice",
      "Quiz"
    ],
    "campuses": [],
    "attributes": [],
    "restrictions": [],
    "gradeBases": [],
    "locations": [
      {
        "lat": 40.1047599,
        "long": -88.2319514
      },
      {
        "lat": 40.105732,
        "long": -88.2281018
      },
      {
        "lat": 40.10755766472843,
        "long": -88.22995430218522
      },
      {
        "lat": 40.10628,
        "long": -88.22621
      },
      {
        "lat": 40.1065684,
        "long": -88.2281746
      },
      {
        "lat": 40.1072225,
        "long": -88.2262016
      },
      {
        "lat": 40.10944320239664,
        "long": -88.22602522743233
      },
      {
        "lat": null,
        "long": null
      },
      {
        "lat": 40.107534,
        "long": -88.2281548
      },
      {
        "lat": 40.103620555545135,
        "long": -88.22982720445013
      },
      {
        "lat": 40.106778040727896,
        "long": -88.2194617156191
      },
      {
        "lat": 40.1020773,
        "long": -88.2296394
      },
      {
        "lat": 40.102726858556835,
        "long": -88.23259991223857
      },
      {
        "lat": 40.11246109008789,
        "long": -88.22831726074219
      },
      {
        "lat": 40.1035833,
        "long": -88.228405
      },
      {
        "lat": 40.10127390836906,
        "long": -88.2226073524728
      },
      {
        "lat": 40.1035872,
        "long": -88.2306061
      },
      {
        "lat": 40.0995003,
        "long": -88.223104
      },
      {
        "lat": 40.101862,
        "long": -88.231737
      },
      {
        "lat": 40.1034533,
        "long": -88.2327596
      },
      {
        "lat": 40.103627234541904,
        "long": -88.22601765311099
      },
      {
        "lat": 40.103587,
        "long": -88.230606
      },
      {
        "lat": 40.104794,
        "long": -88.224264
      },
      {
        "lat": 40.107811,
        "long": -88.2260761
      },
      {
        "lat": 40.10783362157985,
        "long": -88.22476189569741
      },
      {
        "lat": 40.1033599,
        "long": -88.2292111
      },
      {
        "lat": 40.108419421661715,
        "long": -88.2261156301609
      },
      {
        "lat": 40.1083446,
        "long": -88.2282555
      },
      {
        "lat": 40.11380515934119,
        "long": -88.22490788390387
      },
      {
        "lat": 40.110811306674734,
        "long": -88.2248467072371
      },
      {
        "lat": 40.11171215875622,
        "long": -88.22530849701589
      },
      {
        "lat": 40.1109722,
        "long": -88.2282631
      },
      {
        "lat": 40.1131317,
        "long": -88.2264552
      },
      {
        "lat": 40.1108856,
        "long": -88.2269806
      },
      {
        "lat": 40.1110937,
        "long": -88.2232348
      },
      {
        "lat": 40.1149296,
        "long": -88.2280589
      },
      {
        "lat": 40.111691,
        "long": -88.2242511
      },
      {
        "lat": 40.10623714823253,
        "long": -88.2232659093846
      },
      {
        "lat": 40.1149521,
        "long": -88.2267561
      },
      {
        "lat": 40.1028373,
        "long": -88.2251326
      },
      {
        "lat": 40.092875494224195,
        "long": -88.22082220247309
      },
      {
        "lat": 40.1022093629303,
        "long": -88.22800864058527
      },
      {
        "lat": 40.105587640130146,
        "long": -88.22025111416733
      },
      {
        "lat": 40.10593795776367,
        "long": -88.2270736694336
      },
      {
        "lat": 40.108570819242026,
        "long": -88.22518453938676
      },
      {
        "lat": 40.11397164321797,
        "long": -88.2265192685827
      },
      {
        "lat": 40.11085653938169,
        "long": -88.22609810215927
      },
      {
        "lat": 40.10802885201532,
        "long": -88.22239700364068
      },
      {
        "lat": 40.11180304465921,
        "long": -88.22613003543475
      }
    ],
    "finalDates": [],
    "finalTimes": []
  }
}