{
  "subject": "FSHN",
  "scrapedAt": 1768695871614,
  "courseCount": 54,
  "courses": {
    "FSHN 193": [
      "Edible Entrepreneurialism - Feeding Ideas for the Future",
      {
        "ONL": [
          "74664",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Bohn, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          8,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduces students from across campus to various elements and facets of entrepreneurialism that put the consumer first. Students will explore diverse development journeys of well-known food innovators and will participate in reflective and active learning activities to learn about key facets of entrepreneurialism, focusing on important consumer-focused entrepreneurial themes such as: consumer insights, community insights, social/cultural awareness, problem solving, risk taking, resourcing, ensuring technical depth, adapting to failure, and resiliency.",
      []
    ],
    "FSHN 120": [
      "Contemporary Nutrition",
      {
        "BLC": [
          "73122",
          [
            [
              47,
              "W",
              "2050 Student Dining & Res Program",
              0,
              [
                "Gist, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ],
        "H": [
          "32987",
          [
            [
              34,
              "T",
              "328 Bevier Hall",
              36,
              [
                "Gist, T"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "T",
              "ONLINE",
              0,
              [
                "Gist, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ],
        "ONL": [
          "57561",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Gist, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          8,
          0,
          [],
          -1
        ]
      },
      [],
      "Fundamental principles of human nutrition and their application to the selection of an adequate diet for health and wellness; current nutrition topics of importance.",
      []
    ],
    "FSHN 199": [
      "Undergraduate Open Seminar",
      {
        "A": [
          "18700",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Gist, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          5,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Experimental course on a special topic in food science and human nutrition. Topic may not be repeated except in accordance with the Code.",
      []
    ],
    "FSHN 130": [
      "Introduction to Food Science",
      {
        "A": [
          "75865",
          [
            [
              8,
              "F",
              "328 Bevier Hall",
              36,
              [
                "Ma, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Introductory course for students in Food Science (FS) focused on student learning and success, current issues, and opportunities and careers in the field of food science. In addition, students will learn about how to enhance their learning strategies.",
      []
    ],
    "FSHN 125": [
      "Intro to Human Nutrition",
      {
        "A": [
          "75940",
          [
            [
              28,
              "W",
              "242 Bevier Hall",
              36,
              [
                "Coppess, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Introductory course for students in Human Nutrition. Explore department, college and campus resources. Learn about current issues, opportunities, and careers in the nutrition field.",
      []
    ],
    "FSHN 145": [
      "Intro Hospitality Management",
      {
        "AB1": [
          "32999",
          [
            [
              148,
              "F",
              "286 Bevier Hall",
              36,
              [
                "Brotherton, J",
                "Craft, J"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "R",
              "ONLINE",
              0,
              [
                "Brotherton, J",
                "Craft, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ],
        "AL1": [
          "33004",
          [
            [
              15,
              "M",
              "286 Bevier Hall",
              36,
              [
                "Brotherton, J",
                "Craft, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Explore the foodservice aspect of the hospitality industry by assisting Hospitality Management seniors taking FSHN 443 in the operation of the Spice Box. Course covers the planning, production, and service of meals in specialized settings.",
      []
    ],
    "FSHN 101": [
      "The Science of Food and How it Relates to You",
      {
        "ONL": [
          "32983",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Gist, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          8,
          0,
          [],
          -1
        ]
      },
      [],
      "Discusses the evolution of the food system to meet the needs and desires of a complex, heterogeneous society. Provides an overview of food in relation to nutrition and health, composition and chemistry, microbiology, safety, processing, preservation, laws and regulations, quality, and the consumer.",
      []
    ],
    "FSHN 175": [
      "Science of Fermented Foods",
      {
        "ONL": [
          "70512",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Miller, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          8,
          0,
          [],
          -1
        ]
      },
      [],
      "Discusses the evolution and commercialization of fermented foods. Provides insight into the microbial processing, manufacturing, history, nutrition, safety, and chemistry of different fermented products such as beer, bread, wine, and cheese.",
      []
    ],
    "FSHN 232": [
      "Science of Food Preparation",
      {
        "AL1": [
          "60344",
          [
            [
              14,
              "F",
              "328 Bevier Hall",
              36,
              [
                "Ma, S"
              ],
              -1,
              -1,
              -1
            ],
            [
              56,
              "TR",
              "358 Bevier Hall",
              36,
              [
                "Ma, S"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "F",
              "ONLINE",
              0,
              [
                "Ma, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ],
        "AL2": [
          "60345",
          [
            [
              14,
              "F",
              "328 Bevier Hall",
              36,
              [
                "Ma, S"
              ],
              -1,
              -1,
              -1
            ],
            [
              56,
              "TR",
              "358 Bevier Hall",
              36,
              [
                "Ma, S"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "F",
              "ONLINE",
              0,
              [
                "Ma, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Application of food preparation principles and techniques in the preparation of standard food products; principles of food management and their application in the planning and preparation of meals.",
      []
    ],
    "FSHN 201": [
      "Math for Food Science",
      {
        "A": [
          "71908",
          [
            [
              25,
              "TR",
              "242 Agricultural Engr Sciences Bld",
              0,
              [
                "Takhar, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Teaches mathematical concepts by solving the problems in food science related applications. Develops basic understanding of mathematical equations and simple models for solving real world food science problems. Provides instruction for writing simple computer codes using a numerical software package to solve the mathematical problem. Builds a foundation in critically analyzing physical food science problems and solving those using mathematics and coding.",
      []
    ],
    "FSHN 295": [
      "UG Research or Thesis",
      {
        "": [
          "10165",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Unassigned Instructor"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Individual research, special problems, thesis, development and/or design work under the supervision of an appropriate member of the faculty.",
      []
    ],
    "FSHN 292": [
      "Hospitality Management: Professional Issues",
      {
        "A": [
          "72371",
          [
            [
              28,
              "T",
              "328 Bevier Hall",
              36,
              [
                "Craft, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Explores career opportunities in the hospitality industry and prepares students for internship and job searches. Assists in developing professional skills and understanding best practices needed to be successful in the hospitality industry.",
      []
    ],
    "FSHN 260": [
      "Raw Materials for Processing",
      {
        "A": [
          "33027",
          [
            [
              57,
              "M",
              "242 Bevier Hall",
              36,
              [
                "Turasan Ozturk, H"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Current food products use materials sourced from various types of agricultural products. The origin of the raw materials and the processing needs to transform the raw materials into consumable food products are important to understand the entire food systems. This course focuses on the agricultural products/materials and the principles and technologies applied to turn the raw materials into foods. Foods included in this course are fruits and vegetables, cereals and grains, dairy products, and meats. The focus of this course is on post-harvest technologies to ensure food safety and quality.",
      []
    ],
    "FSHN 249": [
      "Food Service Sanitation",
      {
        "A": [
          "72744",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Craft, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          8,
          0,
          [],
          -1
        ]
      },
      [],
      "Examines the dangers, costs and prevention of foodborne illness as well as the training and motivation of food service employees in sanitary food handling and quality assurance practices. Upon completion of this course, student will be eligible to apply for the food service sanitation certificate issued by the State of Illinois.",
      []
    ],
    "FSHN 322": [
      "Nutrition and the Life Cycle",
      {
        "A": [
          "33030",
          [
            [
              25,
              "TR",
              "W109 Turner Hall",
              0,
              [
                "Karduck, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Examines physiological changes that occur during gestation, postnatal growth, and aging and the influence of these changes on nutritional requirements.",
      []
    ],
    "FSHN 251": [
      "Nutritional Physiology II",
      {
        "A": [
          "72369",
          [
            [
              5,
              "TR",
              "328 Bevier Hall",
              36,
              [
                "Amengual Terrasa, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Anatomy and physiology of the respiratory, nervous, endocrine, immune, reproductive, and excretory systems. Special focus on the absorption, distribution, storage and mobilization of macronutrients and micronutrients. Learn the necessary concepts on cell biology and biochemistry required to understand human physiology. Manifestation of disease as a result of nutritional imbalances in body systems. Evaluation of the effectiveness and potential toxicity of nutritional supplements commonly used in the US. Pharmacological interventions and current therapeutics against diseases related to nutritional disorders.",
      []
    ],
    "FSHN 294": [
      "On Campus Internship",
      {
        "": [
          "68528",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Unassigned Instructor"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          9,
          0,
          [],
          -1
        ]
      },
      [],
      "Supervised, on-campus, learning experience with faculty engaged in research.",
      []
    ],
    "FSHN 320": [
      "Food Security: Service Learning in the Community",
      {
        "A": [
          "74665",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Torres Aguilar, P"
              ],
              -1,
              -1,
              -1
            ],
            [
              95,
              "T",
              "393 Bevier Hall",
              36,
              [
                "Torres Aguilar, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Food security is a major concern globally, as well as nationally, and in the local community. Students will explore social and health issues related to food security and gain an understanding of the collaborative efforts for managing food security issues in the Urbana-Champaign and campus communities. Students will learn about food security-related organizations, feeding programs, educational programs, and health initiatives to combat food insecurity in the community. Students will learn via classroom instruction, online instruction, and community-based education and service learning.",
      []
    ],
    "FSHN 340": [
      "Food Production and Service",
      {
        "AB1": [
          "33020",
          [
            [
              149,
              "MW",
              "292 Bevier Hall",
              36,
              [
                "Craft, J",
                "Phillips, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ],
        "AB2": [
          "33021",
          [
            [
              149,
              "WF",
              "292 Bevier Hall",
              36,
              [
                "Craft, J",
                "Phillips, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ],
        "AB3": [
          "33022",
          [
            [
              149,
              "MF",
              "292 Bevier Hall",
              36,
              [
                "Craft, J",
                "Phillips, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ],
        "AB4": [
          "33023",
          [
            [
              149,
              "TR",
              "292 Bevier Hall",
              36,
              [
                "Craft, J",
                "Phillips, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ],
        "AL1": [
          "33024",
          [
            [
              27,
              "TR",
              "286 Bevier Hall",
              36,
              [
                "Craft, J",
                "Phillips, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduction to the management of commercial and noncommerical foodservice systems through the operation of Bevier Cafe. Students experience managing the procurement, production and service of food, as well as the sanitation and maintenance of equipment and facilities.",
      []
    ],
    "FSHN 329": [
      "Communication in Nutrition",
      {
        "A": [
          "33016",
          [
            [
              25,
              "W",
              "W115 Turner Hall",
              0,
              [
                "Karduck, J"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "M",
              "ONLINE",
              0,
              [
                "Karduck, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Application and integration of the principles of nutrition and their transmission to groups and individuals. Students will learn individual counseling techniques as well as how to present nutrition information to groups. Open to Dietetics and Human Nutrition juniors and seniors only.",
      []
    ],
    "FSHN 396": [
      "UG Honors Research or Thesis",
      {
        "": [
          "10176",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Unassigned Instructor"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Individual research, special problems, thesis, development and/or design work under the direction of the Honors advisor.",
      []
    ],
    "FSHN 418": [
      "Food Analysis",
      {
        "A": [
          "33029",
          [
            [
              52,
              "TR",
              "280 Agricultural Engr Sciences Bld",
              0,
              [
                "Asensio, C",
                "Cadwallader, K"
              ],
              -1,
              -1,
              -1
            ],
            [
              11,
              "TR",
              "272 Agricultural Engr Sciences Bld",
              0,
              [
                "Asensio, C",
                "Cadwallader, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Principles and application of the chemical, physical, and instrumental methods used to determine the constituents of foods; special considerations applicable to the analysis of certain foods. Lecture and lab.",
      []
    ],
    "FSHN 424": [
      "Biopsychology of Ingestive Behavior",
      {
        "A": [
          "72375",
          [
            [
              7,
              "TR",
              "328 Bevier Hall",
              36,
              [
                "Pepino de Gruev, Y"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Why do we eat what we eat? This course provides a taste of the science including both biological and psychological basis of ingestive behavior and the adoption of both healthy and maladaptive behaviors concerning eating and drinking. We will review and integrate historical theories with recent research on how we perceive flavor, the development of food preferences, and the biological basis of hunger, thirst, and satiety. Students will also have the opportunity to strengthen their critical thinking skills by participating on two debates in which equal number of arguments will be formulated to support or refute important issues in the field of food science and human nutrition.",
      []
    ],
    "FSHN 346": [
      "Foundations of Hotel Management",
      {
        "A": [
          "72374",
          [
            [
              15,
              "WF",
              "328 Bevier Hall",
              36,
              [
                "Craft, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Provides a comprehensive examination of key areas in hotel operations and management; including, revenue management, accounting, housekeeping, engineering, front desk, food and beverage and marketing. The concepts and principles will be applied in interactive online hotel case simulations designed for an immersive and applied learning experience.",
      []
    ],
    "FSHN 398": [
      "Undergraduate Seminar",
      {
        "UGM": [
          "58408",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Gist, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          9,
          0,
          [],
          -1
        ]
      },
      [],
      "Group discussion on a special topic in a field of study directly pertaining to subject matter in food science and human nutrition.",
      []
    ],
    "FSHN 423": [
      "Advances in Foods & Nutrition",
      {
        "": [
          "10181",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Unassigned Instructor"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "New developments in foods and nutrition; readings, lectures, and discussions.",
      []
    ],
    "FSHN 427": [
      "Biochemical Nutrition II",
      {
        "GR": [
          "73513",
          [
            [
              5,
              "TR",
              "132 Bevier Hall",
              36,
              [
                "Chen, H"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ],
        "UG": [
          "33031",
          [
            [
              5,
              "TR",
              "132 Bevier Hall",
              36,
              [
                "Chen, H"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Biochemistry and metabolism of the water and fat soluble vitamins and minerals. Emphasizes the digestion, transport, metabolism and intercellular functions of these nutrients and how diet/food intake and physiological states affect these processes.",
      []
    ],
    "FSHN 426": [
      "Biochemical Nutrition I",
      {
        "A": [
          "64937",
          [
            [
              25,
              "TR",
              "328 Bevier Hall",
              36,
              [
                "Brandley, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "The dietary and hormonal regulation of carbohydrate, lipid and amino acid metabolism. Emphasizes the regulation of enzyme activity and the different roles the major organs have in whole animal energy balance.",
      []
    ],
    "FSHN 425": [
      "Corporate Food Marketing",
      {
        "S": [
          "45011",
          [
            [
              28,
              "MWF",
              "313 Mumford Hall",
              39,
              [
                "Kalaitzandonakes, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      null,
      []
    ],
    "FSHN 429": [
      "Nutrition Assessment & Therapy",
      {
        "A": [
          "70280",
          [
            [
              21,
              "TR",
              "242 Bevier Hall",
              36,
              [
                "Lundquist, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Problem-based learning application (via cases) of the nutrition care process with emphasis on nutrition assessment, diagnosis, intervention, monitoring and evaluation, as related to the management and treatment of disease states. This course is the clinical capstone course for the dietetics curriculum.",
      []
    ],
    "FSHN 442": [
      "Hospitality Management & Leadership Skills",
      {
        "A": [
          "33033",
          [
            [
              150,
              "TR",
              "108 Bevier Hall",
              36,
              [
                "Craft, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Application of behavioral science and management techniques, methods and strategies to the hospitality industry. Applied management techniques will focus on those managerial behaviors needed to develop and maintain positive and productive relationships with subordinates, peers, supervisors and individuals external to the hospitality organization.",
      []
    ],
    "FSHN 440": [
      "Applied Statistical Methods I",
      {
        "ONL": [
          "31616",
          [
            [
              76,
              "T",
              "ONLINE",
              0,
              [
                "Klimasmith, I"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          8,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as ANSC 440, CPSC 440, NRES 440, and NUTR 440. See CPSC 440.",
      []
    ],
    "FSHN 482": [
      "Food Processing Unit Operations I Lab",
      {
        "A": [
          "72750",
          [
            [
              52,
              "M",
              "185 Agricultural Engr Sciences Bld",
              0,
              [
                "Xu, C"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "M",
              "ONLINE",
              0,
              [
                "Xu, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          2,
          0,
          [],
          -1
        ],
        "ANM": [
          "74713",
          [
            [
              52,
              "M",
              "185 Agricultural Engr Sciences Bld",
              0,
              [
                "Xu, C"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "M",
              "ONLINE",
              0,
              [
                "Xu, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          2,
          0,
          [],
          -1
        ],
        "B": [
          "73024",
          [
            [
              52,
              "W",
              "185 Agricultural Engr Sciences Bld",
              0,
              [
                "Xu, C"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "W",
              "ONLINE",
              0,
              [
                "Xu, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          2,
          0,
          [],
          -1
        ],
        "BNM": [
          "74714",
          [
            [
              52,
              "W",
              "185 Agricultural Engr Sciences Bld",
              0,
              [
                "Xu, C"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "W",
              "ONLINE",
              0,
              [
                "Xu, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Focus on topics discussed in Food Processing Unit Operations I (FSHN 481) in a food grade environment. Students will have opportunities to operate pilot scale food processing equipment for each unit operation.",
      []
    ],
    "FSHN 471": [
      "Food & Industrial Microbiology",
      {
        "L": [
          "33039",
          [
            [
              7,
              "TR",
              "W109 Turner Hall",
              0,
              [
                "Miller, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Relationship of microorganisms to food manufacture and preservation, to food and industrial fermentation and processing, and to food-borne illness.",
      []
    ],
    "FSHN 466": [
      "Food Product Development",
      {
        "AL1": [
          "72689",
          [
            [
              44,
              "W",
              "362 Bevier Hall",
              36,
              [
                "Macias Rodriguez, B"
              ],
              -1,
              -1,
              -1
            ],
            [
              131,
              "F",
              "328 Bevier Hall",
              36,
              [
                "Macias Rodriguez, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ],
        "AL2": [
          "73133",
          [
            [
              44,
              "W",
              "362 Bevier Hall",
              36,
              [
                "Macias Rodriguez, B"
              ],
              -1,
              -1,
              -1
            ],
            [
              131,
              "F",
              "328 Bevier Hall",
              36,
              [
                "Macias Rodriguez, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Food Science undergraduate capstone experience for an Institute of Food Technologists (IFT) approved curriculum. The course utilizes a team-based format, and its intention is to allow students an opportunity to solve professional food science problems while developing novel food products. This course serves as an experiential learning space for students to practice applying, analyzing, and evaluating acquired food science theory through the creative experimental lens of food product development.",
      []
    ],
    "FSHN 459": [
      "Nutrition Focused Physical Assessment",
      {
        "A": [
          "70879",
          [
            [
              34,
              "W",
              "199 Bevier Hall",
              36,
              [
                "Madson, J"
              ],
              -1,
              -1,
              -1
            ],
            [
              28,
              "W",
              "108 Bevier Hall",
              36,
              [
                "Madson, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Collect appropriate subjective and objective data associated with obtaining a health and diet history. An introduction to physical and diagnostic assessment of health status. The emphasis is on knowing normal findings and normal variations in the healthy adult, well child, and the well elder person.",
      []
    ],
    "FSHN 499": [
      "Cur Topics in FS & Human Nutr",
      {
        "": [
          "10184",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Unassigned Instructor"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "SNR": [
          "78400",
          [
            [
              29,
              "TR",
              "ONLINE",
              0,
              [
                "Nickols, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          6,
          0,
          [],
          -1
        ]
      },
      [],
      "Group discussion or an experimental course on a special topic in food science and human nutrition.",
      []
    ],
    "FSHN 510": [
      "Topics in Nutrition Research",
      {
        "A": [
          "69142",
          [
            [
              39,
              "MTWR",
              "292 Animal Sciences Laboratory",
              41,
              [
                "Cattai de Godoy, M",
                "Oba, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ],
        "C": [
          "69155",
          [
            [
              15,
              "TR",
              "108 Bevier Hall",
              36,
              [
                "Jin, Y",
                "Miller, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as ANSC 525 and NUTR 510. See NUTR 510.",
      []
    ],
    "FSHN 472": [
      "Applied Food Microbiology",
      {
        "A": [
          "70272",
          [
            [
              56,
              "WF",
              "17 Agricultural Bioprocess Lab",
              0,
              [
                "Stasiewicz, M"
              ],
              -1,
              -1,
              -1
            ],
            [
              8,
              "M",
              "272 Agricultural Engr Sciences Bld",
              0,
              [
                "Stasiewicz, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Explores experimental methods for studying microbial food safety, quality, and fermentation. Introduces basic microbiology techniques and uses them to study how to detect and control spoilage microorganisms and potential foodborne pathogens. Conduct and experimentally track the progress of classic food fermentations.",
      []
    ],
    "FSHN 443": [
      "Management of Fine Dining",
      {
        "AB1": [
          "33034",
          [
            [
              148,
              "F",
              "286 Bevier Hall",
              36,
              [
                "Brotherton, J",
                "Craft, J"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "R",
              "ONLINE",
              0,
              [
                "Brotherton, J",
                "Craft, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ],
        "AL1": [
          "33035",
          [
            [
              81,
              "M",
              "286 Bevier Hall",
              36,
              [
                "Brotherton, J",
                "Craft, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Advanced application of food production and management principles to specific food service demands; emphasis on artistry in preparation, serving, and merchandising high quality food in quantity.",
      []
    ],
    "FSHN 481": [
      "Food Processing Unit Operations I",
      {
        "A": [
          "72749",
          [
            [
              33,
              "MF",
              "272 Agricultural Engr Sciences Bld",
              0,
              [
                "Xu, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Study the engineering principles that govern food processing and preservation unit operations, including evaporation, freeze-concentration, membrane separation, dehydration, centrifugation, and extrusion, and understand the effect of the process conditions of various unit operations on product characteristics and product quality.",
      []
    ],
    "FSHN 502": [
      "Advanced Sensory Science",
      {
        "A": [
          "68602",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Torrico, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ],
        "ONL": [
          "78309",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Torrico, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          8,
          0,
          [],
          -1
        ]
      },
      [],
      "In-depth and current topics in sensory science beyond the scope of undergraduate sensory course, FSHN 302. The main course objectives are to 1) discuss the physiological and psychological basis for sensory evaluation, 2) discuss Thurstonian Modeling in Difference Tests, 3) utilize multivariate statistical methods in sensory studies, 4) critique current research papers and articles in the sensory science discipline, and 5) develop a proposal for research utilizing sensory methods.",
      []
    ],
    "FSHN 514": [
      "Advanced Food Chemistry",
      {
        "ONL": [
          "78430",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Atkinson, C",
                "Demejia, E",
                "Engeseth, N"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          8,
          0,
          [],
          -1
        ]
      },
      [],
      "Emerging issues related to the chemistry of water, carbohydrates, lipids and proteins, as well as postharvest physiology and impact of processing on chemical reactions in foods.",
      []
    ],
    "FSHN 511": [
      "Regulation of Metabolism",
      {
        "AD1": [
          "35395",
          [
            [
              15,
              "F",
              "107 Animal Sciences Laboratory",
              41,
              [
                "Hernandez Saavedra, D",
                "Stein, H"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ],
        "AL1": [
          "35398",
          [
            [
              15,
              "MW",
              "107 Animal Sciences Laboratory",
              41,
              [
                "Hernandez Saavedra, D",
                "Stein, H"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as ANSC 521, HK 510 and NUTR 511. See NUTR 511.",
      []
    ],
    "FSHN 522": [
      "Dietary Prevention of Cardiovascular and Other Chronic Diseases",
      {
        "A": [
          "70752",
          [
            [
              16,
              "MW",
              "328 Bevier Hall",
              36,
              [
                "Nakamura, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ],
        "ONL": [
          "74964",
          [
            [
              16,
              "MW",
              "ONLINE",
              0,
              [
                "Nakamura, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          8,
          0,
          [],
          -1
        ]
      },
      [],
      "The objective of the course is to help nutritionists and dietitians build a strong biochemical, physiological, clinical and epidemiological foundation for dietary prevention of noncommunicable diseases including coronary artery disease, stroke, hypertension, osteoporosis, cancer and chronic inflammation. In particular, we will focus on evaluating the strength of evidence of the following nutrients on prevention of chronic diseases: cholesterol, saturated fatty acids, essential fatty acids, sodium, potassium, vitamin D and calcium.",
      []
    ],
    "FSHN 524": [
      "Nutritional Counseling and Treatment for Eating Disorders",
      {
        "ONL": [
          "77445",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Liebel, F"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          8,
          0,
          [],
          -1
        ]
      },
      [],
      "Examines prevention and treatment of eating disorders, with a focus on nutritional counseling and therapy as provided by a Registered Dietitian. Incorporates guest lectures from multiple disciplines and provides opportunities to learn about and practice counseling techniques in simulated scenarios.",
      []
    ],
    "FSHN 590": [
      "Dietetic Internship I",
      {
        "A": [
          "77263",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Madson, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          5,
          9,
          0,
          [],
          -1
        ]
      },
      [],
      "Supervised learning experience in a variety of settings and locations related to clinical nutrition, community nutrition and health promotion, and food service management within Urbana/Champaign and surrounding areas.",
      []
    ],
    "FSHN 573": [
      "Advanced Food Microbiology",
      {
        "A": [
          "50425",
          [
            [
              7,
              "TR",
              "W109 Turner Hall",
              0,
              [
                "Banerjee, P",
                "Jin, Y"
              ],
              -1,
              -1,
              -1
            ],
            [
              82,
              "W",
              "ONLINE",
              0,
              [
                "Banerjee, P",
                "Jin, Y"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ],
        "ONL": [
          "75005",
          [
            [
              82,
              "W",
              "ONLINE",
              0,
              [
                "Banerjee, P",
                "Jin, Y"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "W",
              "ONLINE",
              0,
              [
                "Banerjee, P",
                "Jin, Y"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          12,
          0,
          [],
          -1
        ]
      },
      [],
      "Detailed examination of food microbiology topics including food-borne pathogens, food fermentation and microbial spoilage.",
      []
    ],
    "FSHN 591": [
      "Dietetic Internship II",
      {
        "A": [
          "46848",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Madson, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          5,
          9,
          0,
          [],
          -1
        ]
      },
      [],
      "Supervised learning experience in a variety of settings and locations related to clinical nutrition, community nutrition and health promotion, and food service management within Urbana/Champaign and surrounding areas.",
      []
    ],
    "FSHN 592": [
      "Graduate Internship Experience",
      {
        "": [
          "58267",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Unassigned Instructor"
              ],
              -1,
              -1,
              -1
            ]
          ],
          12,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Supervised, off-campus experience in a field related to a students' option/concentration.",
      []
    ],
    "FSHN 593": [
      "Seminar in Foods and Nutrition",
      {
        "A": [
          "33046",
          [
            [
              57,
              "W",
              "242 Bevier Hall",
              36,
              [
                "Xu, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Communication-based course that focuses on enhancing professional oral presentation skills, particularly with regard to communicating current food science and/or human nutrition topics.",
      []
    ],
    "FSHN 597": [
      "Graduate Seminar",
      {
        "CCN": [
          "75212",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Xu, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          8,
          0,
          [],
          -1
        ],
        "FS": [
          "75939",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Xu, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          8,
          0,
          [],
          -1
        ],
        "U": [
          "33051",
          [
            [
              9,
              "F",
              "180 Bevier Hall",
              36,
              [
                "Demejia, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Discussions on specialized research topics and current literature relating to food science and human nutrition. Required of all graduate students.",
      []
    ],
    "FSHN 595": [
      "Advanced Topics in Food Science and Human Nutrition",
      {
        "C": [
          "51238",
          [
            [
              56,
              "W",
              "103 Bevier Hall",
              36,
              [
                "Amengual Terrasa, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ],
        "SND": [
          "46854",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Wolfgram, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          8,
          0,
          [],
          -1
        ]
      },
      [],
      "Studies of selected topics in Food Science. Study may be on specialized topics in any one of the following fields: food chemistry, food microbiology, nutrition, food processing/engineering. Lectures and/or laboratory.",
      []
    ],
    "FSHN 598": [
      "Advanced Special Problems",
      {
        "": [
          "10188",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Unassigned Instructor"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          1,
          0,
          [],
          -1
        ],
        "IFE": [
          "49803",
          [
            [
              91,
              "F",
              "ONLINE",
              0,
              [
                "Ozturk, O"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          8,
          0,
          [],
          -1
        ]
      },
      [],
      "Supervised individual study on advanced special problems in food science and human nutrition.",
      []
    ]
  },
  "caches": {
    "periods": [
      "0930 - 1210",
      "1400 - 1640",
      "0900 - 1140",
      "ARRANGED",
      "1300 - 1540",
      "1100 - 1220",
      "1530 - 1650",
      "0930 - 1050",
      "1000 - 1050",
      "1100 - 1150",
      "1200 - 1250",
      "1300 - 1350",
      "1230 - 1320",
      "1600 - 1720",
      "0900 - 0950",
      "1400 - 1520",
      "0900 - 1020",
      "1030 - 1150",
      "1530 - 1800",
      "1600 - 1840",
      "1700 - 1940",
      "1700 - 1820",
      "1130 - 1250",
      "0900 - 1150",
      "1400 - 1700",
      "1230 - 1350",
      "0800 - 0850",
      "1400 - 1450",
      "1500 - 1550",
      "1600 - 1650",
      "1630 - 1750",
      "1500 - 1620",
      "1200 - 1320",
      "1400 - 1550",
      "1600 - 1750",
      "1930 - 2050",
      "1300 - 1420",
      "0930 - 1020",
      "0800 - 0920",
      "1700 - 1950",
      "1100 - 1250",
      "1700 - 1750",
      "0800 - 1050",
      "1530 - 1820",
      "1300 - 1550",
      "0930 - 1220",
      "1830 - 2020",
      "1500 - 1650",
      "1400 - 1720",
      "0900 - 1220",
      "1300 - 1620",
      "1200 - 1450",
      "1400 - 1650",
      "1100 - 1450",
      "1500 - 1850",
      "1600 - 1850",
      "0900 - 1050",
      "1000 - 1150",
      "1000 - 1120",
      "0800 - 0950",
      "0800 - 1150",
      "1300 - 1520",
      "1530 - 1645",
      "1100 - 1215",
      "1400 - 1515",
      "1700 - 1815",
      "1830 - 1945",
      "0930 - 1045",
      "1230 - 1345",
      "1530 - 1620",
      "1630 - 1720",
      "1600 - 1740",
      "1330 - 1450",
      "1200 - 1350",
      "1800 - 1950",
      "1300 - 1450",
      "1830 - 1950",
      "1300 - 1750",
      "1700 - 1850",
      "1300 - 1650",
      "1900 - 2050",
      "1530 - 1720",
      "1800 - 2100",
      "0900 - 1120",
      "1800 - 2050",
      "1800 - 1920",
      "1200 - 1650",
      "1630 - 1920",
      "1100 - 1330",
      "0930 - 1200",
      "1000 - 2000",
      "1300 - 1430",
      "1200 - 1550",
      "1830 - 2130",
      "1600 - 1700",
      "1430 - 1550",
      "1830 - 2100",
      "1600 - 1715",
      "1730 - 1845",
      "1000 - 1250",
      "1630 - 1745",
      "1630 - 1730",
      "1700 - 1800",
      "1300 - 1415",
      "1500 - 1720",
      "1300 - 1600",
      "1000 - 1220",
      "1400 - 1630",
      "1430 - 1820",
      "1500 - 1700",
      "0900 - 1030",
      "1035 - 1150",
      "1430 - 1630",
      "1700 - 1900",
      "1450 - 1735",
      "1500 - 1750",
      "1530 - 1750",
      "1145 - 1305",
      "1400 - 1620",
      "1100 - 1350",
      "0830 - 0950",
      "1100 - 1230",
      "1600 - 1800",
      "1800 - 2000",
      "0730 - 1530",
      "1530 - 1550",
      "1900 - 1930",
      "1000 - 1700",
      "1730 - 1850",
      "1600 - 1730",
      "1630 - 1800",
      "1100 - 1320",
      "1230 - 1430",
      "1500 - 1730",
      "1200 - 1430",
      "1000 - 1200",
      "1700 - 2000",
      "1730 - 2020",
      "1730 - 2030",
      "0900 - 1600",
      "1730 - 2130",
      "0900 - 1200",
      "1900 - 2200",
      "1900 - 1950",
      "1500 - 1615",
      "0800 - 1220",
      "1700 - 1920",
      "1630 - 1910",
      "1600 - 2050",
      "0830 - 1350",
      "0930 - 1040"
    ],
    "dateRanges": [],
    "scheduleTypes": [
      "Studio",
      "Independent Study",
      "Laboratory",
      "Lecture",
      "Discussion/ Recitation",
      "Lecture-Discussion",
      "Online Lecture",
      "Seminar",
      "Online",
      "Internship",
      "Travel",
      "Conference",
      "Online Discussion",
      "Online Lab",
      "Laboratory-Discussion",
      "Research",
      "Practice",
      "Study Abroad",
      "Quiz",
      "Online Lecture Discussion"
    ],
    "campuses": [],
    "attributes": [],
    "restrictions": [],
    "gradeBases": [],
    "locations": [
      {
        "lat": null,
        "long": null
      },
      {
        "lat": 40.1033599,
        "long": -88.2292111
      },
      {
        "lat": 40.1022093629303,
        "long": -88.22800864058527
      },
      {
        "lat": 40.1035833,
        "long": -88.228405
      },
      {
        "lat": 40.1065684,
        "long": -88.2281746
      },
      {
        "lat": 40.106778040727896,
        "long": -88.2194617156191
      },
      {
        "lat": 40.11246109008789,
        "long": -88.22831726074219
      },
      {
        "lat": 40.11380515934119,
        "long": -88.22490788390387
      },
      {
        "lat": 40.107534,
        "long": -88.2281548
      },
      {
        "lat": 40.1020773,
        "long": -88.2296394
      },
      {
        "lat": 40.1083446,
        "long": -88.2282555
      },
      {
        "lat": 40.1131317,
        "long": -88.2264552
      },
      {
        "lat": 40.11171215875622,
        "long": -88.22530849701589
      },
      {
        "lat": 40.110811306674734,
        "long": -88.2248467072371
      },
      {
        "lat": 40.105732,
        "long": -88.2281018
      },
      {
        "lat": 40.1072225,
        "long": -88.2262016
      },
      {
        "lat": 40.108419421661715,
        "long": -88.2261156301609
      },
      {
        "lat": 40.1110937,
        "long": -88.2232348
      },
      {
        "lat": 40.103587,
        "long": -88.230606
      },
      {
        "lat": 40.1108856,
        "long": -88.2269806
      },
      {
        "lat": 40.1109722,
        "long": -88.2282631
      },
      {
        "lat": 40.107811,
        "long": -88.2260761
      },
      {
        "lat": 40.10944320239664,
        "long": -88.22602522743233
      },
      {
        "lat": 40.10628,
        "long": -88.22621
      },
      {
        "lat": 40.105587640130146,
        "long": -88.22025111416733
      },
      {
        "lat": 40.103620555545135,
        "long": -88.22982720445013
      },
      {
        "lat": 40.1035872,
        "long": -88.2306061
      },
      {
        "lat": 40.10593795776367,
        "long": -88.2270736694336
      },
      {
        "lat": 40.10755766472843,
        "long": -88.22995430218522
      },
      {
        "lat": 40.102726858556835,
        "long": -88.23259991223857
      },
      {
        "lat": 40.101862,
        "long": -88.231737
      },
      {
        "lat": 40.1149296,
        "long": -88.2280589
      },
      {
        "lat": 40.108570819242026,
        "long": -88.22518453938676
      },
      {
        "lat": 40.1047599,
        "long": -88.2319514
      },
      {
        "lat": 40.092875494224195,
        "long": -88.22082220247309
      },
      {
        "lat": 40.11397164321797,
        "long": -88.2265192685827
      },
      {
        "lat": 40.104794,
        "long": -88.224264
      },
      {
        "lat": 40.10783362157985,
        "long": -88.22476189569741
      },
      {
        "lat": 40.111691,
        "long": -88.2242511
      },
      {
        "lat": 40.103627234541904,
        "long": -88.22601765311099
      },
      {
        "lat": 40.10127390836906,
        "long": -88.2226073524728
      },
      {
        "lat": 40.0995003,
        "long": -88.223104
      },
      {
        "lat": 40.11085653938169,
        "long": -88.22609810215927
      },
      {
        "lat": 40.1149521,
        "long": -88.2267561
      },
      {
        "lat": 40.10802885201532,
        "long": -88.22239700364068
      },
      {
        "lat": 40.11180304465921,
        "long": -88.22613003543475
      },
      {
        "lat": 40.10623714823253,
        "long": -88.2232659093846
      }
    ],
    "finalDates": [],
    "finalTimes": []
  }
}