{
  "subject": "GSD",
  "scrapedAt": 1768788534360,
  "courseCount": 17,
  "courses": {
    "GSD 325": [
      "Theatrical Tabletop Role-Playing Game Design",
      {
        "A": [
          "78278",
          [
            [
              11,
              "TR",
              "5 805 W Pennsylvania",
              49,
              [
                "Schultz, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as THEA 385. See THEA 385",
      []
    ],
    "GSD 202": [
      "Let’s Play: Understanding the Role of Play in Life and Art",
      {
        "A": [
          "76025",
          [
            [
              11,
              "TR",
              "158 Loomis Laboratory",
              35,
              [
                "Wolf, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Explores the ways that play is integrated into our socio-cultural fabric. Students will develop a broad understanding of play in different contexts: its history, play and nature, play in human development, learning, play spaces, games, art, and in futurist thinking. Chief among the goals for the course is an emphasis on play as a fundamental and enriching force for people of all ages, and something to cultivate in life and in art.",
      []
    ],
    "GSD 199": [
      "Individual Study",
      {
        "": [
          "71916",
          [
            [
              8,
              "",
              "ONLINE",
              7,
              [
                "Unassigned Instructor"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Individual study in a subject related to game studies & design not covered in normal course offerings.",
      []
    ],
    "GSD 399": [
      "Advanced Individual Study",
      {
        "": [
          "73170",
          [
            [
              8,
              "",
              "ONLINE",
              7,
              [
                "Unassigned Instructor"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ],
        "KMS": [
          "75482",
          [
            [
              8,
              "",
              "ONLINE",
              7,
              [
                "Unassigned Instructor"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Advanced individual study in a subject related to game studies & design not covered in normal course offerings.",
      []
    ],
    "GSD 101": [
      "Introduction to Game Studies and Design",
      {
        "AD1": [
          "71831",
          [
            [
              46,
              "W",
              "134 Armory",
              6,
              [
                "Dixon, A",
                "Durmaz, O",
                "Starks, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "AD2": [
          "71833",
          [
            [
              15,
              "W",
              "428 Armory",
              6,
              [
                "Dixon, A",
                "Hussain, H",
                "Starks, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "AD3": [
          "74241",
          [
            [
              53,
              "W",
              "134 Armory",
              6,
              [
                "Dixon, A",
                "Durmaz, O",
                "Starks, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "AD4": [
          "74242",
          [
            [
              54,
              "W",
              "428 Armory",
              6,
              [
                "Dixon, A",
                "Hussain, H",
                "Starks, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ],
        "AL": [
          "71760",
          [
            [
              15,
              "M",
              "ONLINE",
              7,
              [
                "Dixon, A",
                "Starks, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          6,
          0,
          [],
          -1
        ]
      },
      [],
      "This broad survey course will provide students across campus an introduction to interdisciplinary game studies, covering both historical/social perspectives and game design. It will explore humanities, social science understandings of play, and the social contexts from which our games and gaming practices arise, as well as the development and consequences of gaming cultures. This course will serve as a broad introduction to issues covered in greater depth in upper-level courses available for students pursuing an Undergraduate Minor in Game Studies & Design.",
      []
    ],
    "GSD 204": [
      "Gender in Gaming",
      {
        "KMS": [
          "77311",
          [
            [
              149,
              "T",
              "2036 Campus Instructional Facility",
              13,
              [
                "Starks, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Examines the history of gender in videogames, focusing on how the embodied elements of play as well as the spatial logics of games function to promote and resist representation, as well as how games designed by women and people of color are transforming how and why we play games.",
      []
    ],
    "GSD 390": [
      "Special Topics in Game Studies & Design",
      {
        "AG": [
          "78170",
          [
            [
              169,
              "F",
              "Location Pending",
              7,
              [
                "Velazquez, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ],
        "DBU": [
          "74893",
          [
            [
              7,
              "M",
              "0060 Siebel Center for Design",
              14,
              [
                "Baird, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ],
        "DHP": [
          "77359",
          [
            [
              26,
              "MW",
              "123 English Building",
              5,
              [
                "Hopping, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ],
        "JVA": [
          "75015",
          [
            [
              169,
              "M",
              "Location Pending",
              7,
              [
                "Velazquez, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ],
        "MCR": [
          "76141",
          [
            [
              113,
              "T",
              "1002 Siebel Center for Design",
              14,
              [
                "Curtin, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ],
        "WH": [
          "77029",
          [
            [
              13,
              "TR",
              "212 David Kinley Hall",
              12,
              [
                "Helmke, W"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Advanced study or skills-based instruction in an emerging or special topic related to Game Studies and Design not covered in normal course offerings.",
      []
    ],
    "GSD 103": [
      "The Basics of Game Design",
      {
        "AB1": [
          "71834",
          [
            [
              18,
              "W",
              "FAB LAB Art-East Annex, Studio 2",
              7,
              [
                "Butt, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ],
        "AB2": [
          "71835",
          [
            [
              56,
              "W",
              "FAB LAB Art-East Annex, Studio 2",
              7,
              [
                "Butt, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ],
        "AB3": [
          "71836",
          [
            [
              56,
              "F",
              "FAB LAB Art-East Annex, Studio 2",
              7,
              [
                "Butt, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ],
        "AL": [
          "71759",
          [
            [
              1,
              "M",
              "4031 Campus Instructional Facility",
              13,
              [
                "Butt, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Will introduce you to the tools and principles of game design, as well as the history of game studies and the maker movement. You will learn some of the introductory tools and techniques for rapid prototyping along with exploring games, their history, impacts, and design.",
      []
    ],
    "GSD 405": [
      "Introduction to the Video Game Development Process",
      {
        "A": [
          "71851",
          [
            [
              12,
              "TR",
              "2078 Natural History Building",
              4,
              [
                "Cermak, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "The emphasis of this course is understanding the video game development process as seen in current Game Studios. The course will focus on key elements of the process including the development timeline, scheduling, prototyping, iteration, QA, game builds and player research. The goal will be to take a design document from a catalog of designs that have already been created and implement one or more of them using the game development process.",
      []
    ],
    "GSD 190": [
      "Explorations in Games",
      {
        "KB": [
          "78214",
          [
            [
              15,
              "MW",
              "Location Pending",
              7,
              [
                "Bequette, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Exploratory study or skills-based instruction in an emerging or special topic related to Game Studies and Design not covered in normal course offerings.",
      []
    ],
    "GSD 490": [
      "Advanced Special Topics in Game Studies & Design",
      {
        "3DG": [
          "78169",
          [
            [
              170,
              "F",
              "Location Pending",
              7,
              [
                "Velazquez, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          7,
          0,
          [],
          -1
        ],
        "3DU": [
          "78168",
          [
            [
              170,
              "F",
              "Location Pending",
              7,
              [
                "Velazquez, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          7,
          0,
          [],
          -1
        ],
        "JM": [
          "77644",
          [
            [
              8,
              "",
              "ONLINE",
              7,
              [
                "Moyer, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ],
        "KMS": [
          "77410",
          [
            [
              152,
              "WF",
              "Location Pending",
              7,
              [
                "Starks, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          7,
          0,
          [],
          -1
        ],
        "TNJ": [
          "78355",
          [
            [
              63,
              "MW",
              "329 Armory",
              6,
              [
                "Toenjes, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Topics of current interest. Advanced study in an emerging or special topic related to Game Studies and Design not covered in normal course offerings.",
      []
    ],
    "GSD 515": [
      "Professionalization Seminar: Portfolio Production & Personal Branding",
      {
        "1": [
          "78163",
          [
            [
              8,
              "MWF",
              "ONLINE",
              7,
              [
                "Ford, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "The focus of this course is on preparing students to professionally present themselves and their work. Students will research ways in which perception affects perceived employability. Social concepts such as professional presentation, personal boundaries, cultural expression, and workplace culture will be explored. Students will create social media profiles, websites, and published portfolios which will be reviewed by in-class peers as well as industry professionals. Students will culminate their experience by applying for a studio position.",
      []
    ],
    "GSD 597": [
      "Independent Study in Game Studies & Design",
      {
        "DBR": [
          "76179",
          [
            [
              8,
              "",
              "ONLINE",
              7,
              [
                "Baird, D",
                "Starks, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ],
        "DH": [
          "78463",
          [
            [
              8,
              "",
              "ONLINE",
              7,
              [
                "Unassigned Instructor"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Advanced individual study in a subject related to Game Studies and Design not covered in normal course offerings. Project examples include comprehensive literature reviews on a topic of special or emerging interest, small research projects (e.g. surveys or play-testing experiments), development projects (e.g. building a game based on a design developed as part of another course), or other study approved by the instructor. Pre-approval is required and an approved advisor must commit to supervise the independent study.",
      []
    ],
    "GSD 502": [
      "Seminar in Game Studies",
      {
        "AL": [
          "77252",
          [
            [
              138,
              "T",
              "11 Psychology Building",
              8,
              [
                "Pintar, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "An in-depth interdisciplinary exploration of significant areas of social, psychological, historical, and critical inquiry in game studies. Course readings and guest speakers will help to stimulate discussion on theoretical approaches, methodological issues and other aspects of contemporary game studies research to provide an intellectual community for students across academic disciplines. Students will have the opportunity to share their work, and their particular disciplinary approaches to game studies during the semester.",
      []
    ],
    "GSD 419": [
      "The stu/dio Capstone Course",
      {
        "DNC": [
          "78338",
          [
            [
              26,
              "TR",
              "109 Sch of Info Sciences Bldg",
              7,
              [
                "Cermak, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "An experiential learning project-based course built within the framework of a game or interactive media development project. The framework will be provided by the instructor, with the support of The stu/dio (a student-run game development studio) leads. Students will work in teams, and be guided in learning the fundamentals of one or more of the game development disciplines (Programming, Design, Art/Audio, Production/Project Management) to develop and/or produce a part of the overall project.",
      []
    ],
    "GSD 411": [
      "Interactive Fiction with Twine",
      {
        "AL": [
          "74830",
          [
            [
              130,
              "R",
              "ONLINE",
              7,
              [
                "Klimas, C",
                "Starks, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "This studio course explores the intersection of interactivity and the written word—encompassing fiction, nonfiction, and poetry. Although many of the works examined in the course contain gameplay mechanics, the course’s focus is on the expressive possibilities of interactive storytelling. Students will create hypertext narratives using Twine software. No prior programming experience is assumed.",
      []
    ],
    "GSD 590": [
      "Special Topics in Game Studies & Design",
      {
        "KMS": [
          "78152",
          [
            [
              152,
              "WF",
              "Location Pending",
              7,
              [
                "Starks, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Allows for affiliated Game Studies & Design faculty to propose and offer new courses on emerging and special topics of immediate interest. Students will experience an in-depth exploration of significant and emerging areas of social, psychological, historical, and critical game studies, focusing on theoretical approaches, methodological issues and aspects of contemporary game studies research and/or design.",
      []
    ]
  },
  "caches": {
    "periods": [
      "0900 - 0950",
      "1000 - 1050",
      "1100 - 1150",
      "1200 - 1250",
      "1300 - 1350",
      "1400 - 1450",
      "0930 - 1050",
      "1400 - 1650",
      "ARRANGED",
      "1600 - 1715",
      "0930 - 1045",
      "1100 - 1220",
      "1230 - 1350",
      "1400 - 1520",
      "1400 - 1550",
      "1600 - 1720",
      "1500 - 1720",
      "1400 - 1720",
      "1300 - 1450",
      "1500 - 1650",
      "0800 - 0950",
      "0900 - 1150",
      "0900 - 1020",
      "1400 - 1630",
      "1500 - 1550",
      "0800 - 0920",
      "1530 - 1650",
      "0800 - 0850",
      "1700 - 1820",
      "1530 - 1620",
      "2000 - 2050",
      "0800 - 1150",
      "1200 - 1550",
      "1230 - 1620",
      "0830 - 0920",
      "1300 - 1650",
      "1500 - 1750",
      "1700 - 1850",
      "1500 - 1620",
      "0900 - 1050",
      "1100 - 1250",
      "1600 - 1750",
      "1600 - 1650",
      "1200 - 1320",
      "1000 - 1120",
      "1130 - 1250",
      "1300 - 1420",
      "1600 - 1730",
      "1030 - 1150",
      "1330 - 1520",
      "1530 - 1710",
      "1230 - 1320",
      "1630 - 1750",
      "1430 - 1550",
      "1730 - 1850",
      "1730 - 1920",
      "1000 - 1150",
      "1530 - 1820",
      "1700 - 1750",
      "1100 - 1215",
      "0800 - 0959",
      "1530 - 1730",
      "1500 - 1700",
      "1700 - 1900",
      "1730 - 1930",
      "0600 - 0730",
      "1700 - 1950",
      "1500 - 1730",
      "1200 - 1450",
      "1730 - 2030",
      "1300 - 1550",
      "1730 - 1900",
      "0930 - 1020",
      "1830 - 1950",
      "1100 - 1350",
      "1800 - 2050",
      "1030 - 1120",
      "1430 - 1520",
      "1630 - 1720",
      "1130 - 1220",
      "1300 - 1520",
      "1300 - 1750",
      "0930 - 1220",
      "0800 - 1050",
      "1800 - 1950",
      "0930 - 1120",
      "1200 - 1420",
      "1400 - 1640",
      "1300 - 1540",
      "0900 - 1140",
      "0930 - 1210",
      "1600 - 1840",
      "1700 - 1940",
      "1330 - 1450",
      "1530 - 1800",
      "1400 - 1700",
      "1930 - 2050",
      "1830 - 2020",
      "0900 - 1220",
      "1300 - 1620",
      "1100 - 1450",
      "1500 - 1850",
      "1600 - 1850",
      "1530 - 1645",
      "1400 - 1515",
      "1700 - 1815",
      "1830 - 1945",
      "1230 - 1345",
      "1600 - 1740",
      "1200 - 1350",
      "1900 - 2050",
      "1530 - 1720",
      "1800 - 2100",
      "0900 - 1120",
      "1800 - 1920",
      "1630 - 1920",
      "1200 - 1650",
      "1100 - 1330",
      "0930 - 1200",
      "1000 - 2000",
      "1300 - 1430",
      "1830 - 2130",
      "1600 - 1700",
      "1830 - 2100",
      "1700 - 1800",
      "1000 - 1250",
      "1730 - 1845",
      "1630 - 1745",
      "1630 - 1730",
      "1300 - 1415",
      "1300 - 1600",
      "1000 - 1220",
      "1430 - 1820",
      "0900 - 1030",
      "1035 - 1150",
      "1430 - 1630",
      "1450 - 1735",
      "1400 - 1620",
      "1530 - 1750",
      "1145 - 1305",
      "0830 - 0950",
      "1100 - 1230",
      "1600 - 1800",
      "1800 - 2000",
      "1900 - 1930",
      "0730 - 1530",
      "1530 - 1550",
      "1000 - 1700",
      "1630 - 1800",
      "1100 - 1320",
      "1230 - 1430",
      "1200 - 1430",
      "1000 - 1200",
      "1700 - 2000",
      "1730 - 2020",
      "0900 - 1200",
      "1730 - 2130",
      "0900 - 1600",
      "1900 - 2200",
      "1900 - 1950",
      "1500 - 1615",
      "0800 - 1220",
      "1630 - 1910",
      "1700 - 1920",
      "1600 - 2050",
      "0830 - 1350",
      "0930 - 1040",
      "1500 - 1600",
      "1600 - 1820",
      "0900 - 1145",
      "1300 - 1545"
    ],
    "dateRanges": [],
    "scheduleTypes": [
      "Discussion/ Recitation",
      "Lecture",
      "Lecture-Discussion",
      "Online",
      "Independent Study",
      "Laboratory",
      "Online Lecture",
      "Laboratory-Discussion",
      "Online Discussion",
      "Conference",
      "Online Lecture Discussion",
      "Seminar",
      "Internship",
      "Study Abroad",
      "Research",
      "Travel",
      "Studio",
      "Online Lab",
      "Practice",
      "Quiz"
    ],
    "campuses": [],
    "attributes": [],
    "restrictions": [],
    "gradeBases": [],
    "locations": [
      {
        "lat": 40.10628,
        "long": -88.22621
      },
      {
        "lat": 40.1065684,
        "long": -88.2281746
      },
      {
        "lat": 40.105732,
        "long": -88.2281018
      },
      {
        "lat": 40.1072225,
        "long": -88.2262016
      },
      {
        "lat": 40.10944320239664,
        "long": -88.22602522743233
      },
      {
        "lat": 40.107534,
        "long": -88.2281548
      },
      {
        "lat": 40.1047599,
        "long": -88.2319514
      },
      {
        "lat": null,
        "long": null
      },
      {
        "lat": 40.10755766472843,
        "long": -88.22995430218522
      },
      {
        "lat": 40.103620555545135,
        "long": -88.22982720445013
      },
      {
        "lat": 40.1020773,
        "long": -88.2296394
      },
      {
        "lat": 40.106778040727896,
        "long": -88.2194617156191
      },
      {
        "lat": 40.1035833,
        "long": -88.228405
      },
      {
        "lat": 40.11246109008789,
        "long": -88.22831726074219
      },
      {
        "lat": 40.102726858556835,
        "long": -88.23259991223857
      },
      {
        "lat": 40.10127390836906,
        "long": -88.2226073524728
      },
      {
        "lat": 40.1035872,
        "long": -88.2306061
      },
      {
        "lat": 40.103627234541904,
        "long": -88.22601765311099
      },
      {
        "lat": 40.0995003,
        "long": -88.223104
      },
      {
        "lat": 40.101862,
        "long": -88.231737
      },
      {
        "lat": 40.1034533,
        "long": -88.2327596
      },
      {
        "lat": 40.104794,
        "long": -88.224264
      },
      {
        "lat": 40.103587,
        "long": -88.230606
      },
      {
        "lat": 40.107811,
        "long": -88.2260761
      },
      {
        "lat": 40.10783362157985,
        "long": -88.22476189569741
      },
      {
        "lat": 40.1033599,
        "long": -88.2292111
      },
      {
        "lat": 40.108419421661715,
        "long": -88.2261156301609
      },
      {
        "lat": 40.1083446,
        "long": -88.2282555
      },
      {
        "lat": 40.11380515934119,
        "long": -88.22490788390387
      },
      {
        "lat": 40.110811306674734,
        "long": -88.2248467072371
      },
      {
        "lat": 40.1108856,
        "long": -88.2269806
      },
      {
        "lat": 40.11171215875622,
        "long": -88.22530849701589
      },
      {
        "lat": 40.1109722,
        "long": -88.2282631
      },
      {
        "lat": 40.1131317,
        "long": -88.2264552
      },
      {
        "lat": 40.111691,
        "long": -88.2242511
      },
      {
        "lat": 40.1110937,
        "long": -88.2232348
      },
      {
        "lat": 40.1149296,
        "long": -88.2280589
      },
      {
        "lat": 40.10623714823253,
        "long": -88.2232659093846
      },
      {
        "lat": 40.1149521,
        "long": -88.2267561
      },
      {
        "lat": 40.1028373,
        "long": -88.2251326
      },
      {
        "lat": 40.092875494224195,
        "long": -88.22082220247309
      },
      {
        "lat": 40.1022093629303,
        "long": -88.22800864058527
      },
      {
        "lat": 40.105587640130146,
        "long": -88.22025111416733
      },
      {
        "lat": 40.10593795776367,
        "long": -88.2270736694336
      },
      {
        "lat": 40.108570819242026,
        "long": -88.22518453938676
      },
      {
        "lat": 40.11397164321797,
        "long": -88.2265192685827
      },
      {
        "lat": 40.11085653938169,
        "long": -88.22609810215927
      },
      {
        "lat": 40.10802885201532,
        "long": -88.22239700364068
      },
      {
        "lat": 40.11180304465921,
        "long": -88.22613003543475
      },
      {
        "lat": 40.10039170750639,
        "long": -88.21813070187608
      }
    ],
    "finalDates": [],
    "finalTimes": []
  }
}