{
  "subject": "LER",
  "scrapedAt": 1768450731692,
  "courseCount": 35,
  "courses": {
    "LER 120": [
      "Contemporary Labor Problems",
      {
        "B": [
          "53439",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Ashby, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Focuses on problems and challenges facing American workers and the U.S. labor movement. Topics include the deterioration of the labor-management \"social contract\" in recent decades; a review of labor and employment law; the health care crisis; globalization and cross-border union alliances; and union democracy.",
      []
    ],
    "LER 199": [
      "Undergraduate Open Seminar",
      {
        "": [
          "71039",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          5,
          4,
          0,
          [],
          -1
        ],
        "RW": [
          "78316",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Fortado, S",
                "Wood, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          5,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      null,
      []
    ],
    "LER 110": [
      "Labor and Social Movements",
      {
        "A": [
          "53035",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Ashby, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ],
        "B": [
          "53036",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Ashby, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Explores the role of labor unions in American society. Discusses the role of labor unions in initiating actions on social issues that impact the U.S. working class, the economy, public policy, and politics. Analyzes the labor movement's interaction with the civil rights, women's, student, global justice, and living wage movements.",
      []
    ],
    "LER 228": [
      "Human Resources Career Development",
      {
        "A": [
          "78055",
          [
            [
              21,
              "TR",
              "53 Inst Labor &  Industrial Rel",
              0,
              [
                "Neighbors, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Students will engage in an in-depth exploration of HR careers and career development in today’s dynamic workplace. The course combines examination of career theories with practical application, equipping students to approach HR careers from both the individual career planning and organizational perspective (i.e., organizational talent management). Students will learn how organizations design strategies to foster employee growth, enhance career pipelines, and retain talent, as well as how individuals actively shape and navigate their own career journeys.",
      []
    ],
    "LER 200": [
      "Globalization and Workers",
      {
        "A": [
          "53039",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Ashby, S",
                "Franklin, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Is globalization good for working people in the United States and around the world? Globalization is the driving force in the world economy but it is also provoking tremendous debate and popular resistance. Students will learn the basics about globalization and its institutions from the perspective of workers' right in the U.S. and the Third World. Analyzes the debate over free trade and sweatshops, trade agreements such as the North American Free Trade Agreement, and institutions such as the World Trade Organization and the International Monetary Fund. Closely examines working conditions in several Third World countries, and explores the role of the global justice movement.",
      []
    ],
    "LER 225": [
      "Labor Issues in Sports",
      {
        "A": [
          "73028",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Gilbert, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Examines major labor issues in sports. How do players’ unions work? Why are there so many work stoppages in sports? How do teams evaluate and develop talent? Should college athletes be considered employees? How do labor issues in sports intersect with broader structures of social inequality? Readings, films, discussions, and writing assignments equip students to be informed participants in the sports world, whether in their careers or in their lives as fans.",
      []
    ],
    "LER 100": [
      "Introduction to Labor Studies",
      {
        "A": [
          "53032",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Ashby, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ],
        "B": [
          "53033",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Ashby, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ],
        "C": [
          "53034",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Ashby, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Provides an overview of workers and unions in American society. Looks at economic, political, and workplace issues facing working people, why and how workers join unions, how unions are structured and function, and how unions and management bargain a contract. Provides a historical overview of the American labor movement, and discusses the contemporary struggles workers and unions face in a rapidly changing global economy.",
      []
    ],
    "LER 300": [
      "Workers, Unions, and Politics",
      {
        "A": [
          "53042",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Ashby, S",
                "Bruno, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "What is the meaning and impact of politics seen from the perspective of those at the bottom of the pyramid of political power rather than from the usual focus on the actions and perceptions of political elites? In what ways do workers become involved in politics? Under what circumstances are they likely to be successful in bringing about change? This course addresses these questions by exploring political power, political participation, and political change from a broad historical and cross-cultural perspective, but always focusing on a view of politics from the bottom up. The course analyzes the political economy of labor, and the labor movement's political influence in politics.",
      []
    ],
    "LER 130": [
      "Intro Labr Wrkng Class History",
      {
        "A": [
          "53038",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Labarbera-Twarog, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Do working people have a history worth studying? What does the history of the U.S. look like when viewed from the point of view of those who built the country? Introduces U.S. labor and working class history. Examines the conditions of life and work of the various groups of working people: enslaved, indentured, small farmers, but especially wage workers and their families from the civil War to the present. Studies the main collective actions workers have taken to protect and improve their lives and the organizations and social movements they created to do this. Students who complete LER 130 and want a more in-depth look at the subject should enroll in HIST 480.",
      []
    ],
    "LER 440": [
      "Economics of Labor Markets",
      {
        "A3": [
          "52790",
          [
            [
              16,
              "MW",
              "4029 Campus Instructional Facility",
              9,
              [
                "Borgschulte, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ],
        "A4": [
          "52789",
          [
            [
              16,
              "MW",
              "4029 Campus Instructional Facility",
              9,
              [
                "Borgschulte, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as ECON 440. See ECON 440.",
      []
    ],
    "LER 526": [
      "Machine Learning Applications in HR",
      {
        "A": [
          "77148",
          [
            [
              119,
              "M",
              "51 Inst Labor &  Industrial Rel",
              0,
              [
                "Min, H"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "The primary goal of this course is to equip human resources management professionals with a comprehensive understanding of how machine learning and big data analytics can be integrated into various HR functions. This includes developing a deep appreciation for the opportunities and challenges associated with applying these technologies in areas such as hiring, resume screening, performance appraisal, and worker safety. The course aims to foster critical thinking about the ethical implications and strategic decision-making involved in deploying AI and machine learning solutions in HR contexts. Discussion of potential biases in AI/machine-learning implementation will be integrated throughout the course.",
      []
    ],
    "LER 521": [
      "Employment Law for HR Managers: Separations, Worker’s Compensation, and Safety",
      {
        "A": [
          "74981",
          [
            [
              231,
              "M",
              "53 Inst Labor &  Industrial Rel",
              0,
              [
                "LeRoy, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Examines laws and court rulings that relate to the erosion of employment at will, including wrongful discharge; post-employment, non-compete covenants and trade secrets; plant closings; employee claims in Chapter 11 bankruptcy; pension plan terminations; unemployment insurance; ERISA's fiduciary duties; retirement issues; worker's compensation issues; and OSHA duties. Students will learn about employer liability related to these laws.",
      []
    ],
    "LER 532": [
      "Successful Change Management for HR Professionals",
      {
        "O": [
          "75880",
          [
            [
              232,
              "R",
              "ONLINE",
              0,
              [
                "Ireland, K",
                "Mies, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduces students to methodologies and practices for successful change management within any size organization. In addition, this course is intended to guide students through the role that HR professionals play in change management and to apply these concepts in practical ways to changes.",
      []
    ],
    "LER 536": [
      "Management of Workplace Gender Issues",
      {
        "A": [
          "75922",
          [
            [
              119,
              "W",
              "51 Inst Labor &  Industrial Rel",
              0,
              [
                "Park, Y"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Topics covered include stereotypes, workplace discrimination, leadership, work-life balance & career, LGBTQ, gender-inclusive climates, etc. This course will consist of lectures, discussions, case analyses, and students will conduct a project to facilitate an in-depth understanding of a gender issue and ways to address it in organizations. Students will gain knowledge of scientific literature to better understand the nature of workplace gender issues and obtain insights as to how to manage and address them in organizations.",
      []
    ],
    "LER 510": [
      "HR Analytics: Methods & Data-Driven Prediction",
      {
        "A": [
          "78058",
          [
            [
              51,
              "M",
              "51 Inst Labor &  Industrial Rel",
              0,
              [
                "Newman, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Expands your data-analytic toolkit for addressing HR problems. Topics include introductory data handling in the free software R, predictive modeling (multiple regression and logistic regression, for staffing and turnover), factor analysis and reliability (for employee surveys), research design (for training and program evaluation), and mediation and moderation analyses (for understanding training and diversity/test fairness). Assignments include weekly labs worked on in class, plus open-notes quizzes. This hands-on course develops practical, concrete skills in data analysis.",
      []
    ],
    "LER 541": [
      "Labor Economics II",
      {
        "A1": [
          "55182",
          [
            [
              21,
              "MW",
              "113 David Kinley Hall",
              36,
              [
                "Borgschulte, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as ECON 541. See ECON 541.",
      []
    ],
    "LER 535": [
      "Negotiation Principles in HR Context",
      {
        "O": [
          "75881",
          [
            [
              232,
              "R",
              "ONLINE",
              0,
              [
                "Cardador, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Develop your negotiation skills through practice and an improved understanding of the factors that underlie successful negotiations. In this course, you will not only learn what strategies work, but why they work, so that you can generalize these strategies to new situations. The typical format of the course sessions includes discussing what happened in the pre-class negotiation exercise and tying your experiences to course concepts.",
      []
    ],
    "LER 537": [
      "Employee Stress, Well-Being, & Safety",
      {
        "B": [
          "75918",
          [
            [
              119,
              "R",
              "35/43 Inst Labor &  Industrial Rel",
              0,
              [
                "Park, Y"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Uses the “organizational psychology” approach focusing on important psychosocial factors that affect employee stress, well-being, and safety. This focus helps students see the importance of good people management. The class will include lectures, in-class learning activities, and a group project. In this course, students will obtain fundamental and up-to-date knowledge of prevention and intervention strategies for minimizing the impact of stressors and ensuring healthy and safe work environments.",
      []
    ],
    "LER 542": [
      "Collective Bargaining",
      {
        "A": [
          "52774",
          [
            [
              119,
              "R",
              "51 Inst Labor &  Industrial Rel",
              0,
              [
                "Riordan, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ],
        "O": [
          "75879",
          [
            [
              123,
              "T",
              "ONLINE",
              0,
              [
                "Riordan, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Examination of: social values and social science concepts to develop a framework for explaining the basis and shape of collective bargaining as it has been practiced in the United States; government and law, unions, and employers as part of the development of this framework; the environment of collective bargaining with respect to the role of economics and bargaining structure; the negotiating process as the interactive basis for union-management relations; conflict and conflict resolution as part of the negotiating process; wage and other effects of collective bargaining as bargaining outcomes; contemporary changes in union management relations. Case materials and exercises may be used to supplement course materials. Same as ECON 542. Prerequisite: Consent of instructor.",
      []
    ],
    "LER 543": [
      "Workplace Dispute Resolution",
      {
        "1": [
          "52773",
          [
            [
              51,
              "W",
              "35/43 Inst Labor &  Industrial Rel",
              0,
              [
                "Kallas, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Examination of the use of procedures to resolve employment disputes in both union and nonunion workplaces; comparative analysis of grievance arbitration, interest arbitration, mediation, fact-finding, and combinations of these procedures; special emphasis given to the role of third party intervention.",
      []
    ],
    "LER 546": [
      "The Gender Wage Gap",
      {
        "A": [
          "75924",
          [
            [
              51,
              "T",
              "53 Inst Labor &  Industrial Rel",
              0,
              [
                "Weinstein, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Focuses on male-female differences in workforce participation, earnings, and occupations, and potential explanations for these differences, using insights from economic models. The course will also focus on applying economic intuition to evaluate potential impacts of employer and government policies on labor market outcomes.",
      []
    ],
    "LER 560": [
      "Macro Research Methods",
      {
        "A": [
          "75925",
          [
            [
              13,
              "R",
              "ARR Inst Labor &  Industrial Rel",
              0,
              [
                "Jung, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduces a core set of macro research methods to human resources and industrial relations PhD students. The main objective is to help students become enlightened users of statistical methods and develop their own \"toolkits\" for future research. Through short lectures, discussion sessions, in-class exercises, and weekly and final assignments, students learn about issues that will arise in macro research, acquire analytical skills to deal with those problems, and develop their own research topics.",
      []
    ],
    "LER 558": [
      "Faculty-Student Workshop",
      {
        "1": [
          "53441",
          [
            [
              233,
              "F",
              "35/43 Inst Labor &  Industrial Rel",
              0,
              [
                "Benton, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          11,
          0,
          [],
          -1
        ]
      },
      [],
      "Training and experience for Ph.D. students in the application of social science and industrial relations theory and research methodology to contemporary industrial relations problems through presentation and discussion of faculty and student research. Ph.D. students are required to make presentations and to participate in workshop discussions during the entire period of their campus residency.",
      []
    ],
    "LER 551": [
      "Social Justice and the Workplace",
      {
        "A": [
          "78063",
          [
            [
              119,
              "W",
              "53 Inst Labor &  Industrial Rel",
              0,
              [
                "Gilbert, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Examines how movements for social justice have shaped – and continue to shape – U.S. employment relations. How have social movements mobilized to address employment discrimination? How have campaigns for social justice influenced U.S. employment law, public policy, and workplace practices? How can the workplace leaders of today and tomorrow continue to build more just and equitable workplaces?",
      []
    ],
    "LER 554": [
      "Comparative Employment Relations Systems",
      {
        "B": [
          "75921",
          [
            [
              51,
              "W",
              "51 Inst Labor &  Industrial Rel",
              0,
              [
                "Mun, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Examines employment systems in selected developed, newly industrialized, and developing economies. We will discuss how distinctive labor market institutions emerged in the context of economic development and evolved through interactions with the global economy. Students will learn about management-labor relations, and the roles of firms, national governments, and international organizations in shaping employment systems. Emphasis will be placed on the analytical tools needed to make multi-country comparisons, to link theory and practice.",
      []
    ],
    "LER 561": [
      "Compensation Systems",
      {
        "A": [
          "53168",
          [
            [
              39,
              "R",
              "51 Inst Labor &  Industrial Rel",
              0,
              [
                "Zhang, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ],
        "O": [
          "75877",
          [
            [
              123,
              "W",
              "ONLINE",
              0,
              [
                "Schiller, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Compensation theory and practice. Course addresses the theoretical and practical issues associated with the design of effective compensation systems. The design phases include establishing internal equity, external equity, and individual equity. Budgeting and administration are also addressed. Case analyses and computer simulations may be used to supplement course materials.",
      []
    ],
    "LER 565": [
      "HR Management and Strategy",
      {
        "01": [
          "52770",
          [
            [
              39,
              "W",
              "53 Inst Labor &  Industrial Rel",
              0,
              [
                "Benton, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Designed to provide integration across the specific functional areas of the human resources management (HRM) field, while at the same time demonstrating the linkages horizontally within HRM and vertically with strategic management of the firm. This case-focused course places emphasis on human resources issues of strategic importance to the organization.",
      []
    ],
    "LER 566": [
      "International HR Management",
      {
        "A": [
          "53169",
          [
            [
              119,
              "T",
              "35/43 Inst Labor &  Industrial Rel",
              0,
              [
                "Jung, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Human resource management issues examined from the perspective of the multinational firm. Topics include globalization and human resource strategy, management and the structure of multinational firms, dealing with intercultural differences, selecting employees for foreign assignments, training and developing expatriate employees, evaluation and compensation of employees in international assignments. Individual and group projects.",
      []
    ],
    "LER 580": [
      "Internship",
      {
        "A": [
          "58055",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Barker, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          0,
          6,
          0,
          [],
          -1
        ]
      },
      [],
      "Full or part-time practice of human resources or employment relations in an off-campus government, corporate or not-for-profit environment.",
      []
    ],
    "LER 567": [
      "Negotiation in HR Decisions",
      {
        "A": [
          "53177",
          [
            [
              51,
              "R",
              "35/43 Inst Labor &  Industrial Rel",
              0,
              [
                "Zhang, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "General survey course concerning the strategies and tactics of bargaining and negotiation, with special emphasis on applications in human resource management contexts. Topics covered include: the structure of negotiated outcomes; integrative bargaining tactics; distributive bargaining tactics; negotiation planning; power, persuasion and influence; communication; negotiating in teams and groups; negotiating using 3rd parties (arbitrators, mediators, agents); cross-cultural negotiations. Students will discuss negotiation issues and build negotiation skills through a series of experiential exercises and cases.",
      []
    ],
    "LER 590": [
      "Individual Topics",
      {
        "": [
          "53819",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          4,
          0,
          [],
          -1
        ],
        "CT": [
          "75927",
          [
            [
              51,
              "R",
              "51 Inst Labor &  Industrial Rel",
              0,
              [
                "Kallas, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Students in labor and industrial relations may register for this unit with the consent of the curriculum adviser and the adviser under whom the student will perform individual study or research. Such individual work may include special study in a subject matter for which no course is available or an individual research project, including on-the-job research in industry, which is not being undertaken for a thesis.",
      []
    ],
    "LER 591": [
      "Employment Relations Systems",
      {
        "A": [
          "53172",
          [
            [
              39,
              "T",
              "51 Inst Labor &  Industrial Rel",
              0,
              [
                "Mun, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ],
        "O": [
          "77076",
          [
            [
              123,
              "M",
              "ONLINE",
              0,
              [
                "Kramer, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "General framework for the analysis of employment relationships. Topics include industrial relations theory, the American system of collective bargaining, intercountry system differences, and human resource management strategies and practices.",
      []
    ],
    "LER 593": [
      "Quantitative Methods in LER",
      {
        "AE1": [
          "53174",
          [
            [
              51,
              "T",
              "51 Inst Labor &  Industrial Rel",
              0,
              [
                "Alexander, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ],
        "AQ1": [
          "53175",
          [
            [
              20,
              "F",
              "51 Inst Labor &  Industrial Rel",
              0,
              [
                "Yu, Y"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          18,
          0,
          [],
          -1
        ],
        "AQ2": [
          "53176",
          [
            [
              17,
              "F",
              "51 Inst Labor &  Industrial Rel",
              0,
              [
                "Yu, Y"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          18,
          0,
          [],
          -1
        ],
        "O": [
          "75878",
          [
            [
              123,
              "W",
              "ONLINE",
              0,
              [
                "Ogolsky, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Application of statistical methods to problems in human resources and industrial relations. Analysis and presentation of results using computer software. Covers statistical techniques through analysis of variance and multiple regression.",
      []
    ],
    "LER 595": [
      "Managing Diversity Globally",
      {
        "O": [
          "77068",
          [
            [
              123,
              "R",
              "ONLINE",
              0,
              [
                "Kramer, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "In a global economy workplace diversity is not a trend; it is a reality faced by corporate leaders, human resource professionals and management consultants. Within the US, immigration, migration, and gender and racial differences have been major trends shaping workplace composition. Globalization places additional pressures on managing workplace diversity effectively. In this setting, training managers and human resource professionals to manage differences and adapt to multiple national and cultural contexts is an imperative. Course provides an in-depth understanding of how managers and HR professionals can be effective in not only managing diversity in a global context, but also in leveraging global diversity as a competitive advantage. By the end of this course students will have a holistic appreciation of the tools necessary to implement effective diversity management practices for a globally inclusive workplace.",
      []
    ],
    "LER 597": [
      "Employee Motivation & Perfmnce",
      {
        "O": [
          "75876",
          [
            [
              232,
              "R",
              "ONLINE",
              0,
              [
                "Franz, G"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Managing and motivating employees effectively is one of the most complex and challenging issues facing companies today. While business leaders acknowledge the need for implementing effective performance management systems, recent studies indicate that an overwhelming majority of performance management systems are unsuccessful. Takes a strategic approach to employee motivation and performance starting with a firm level view to reviewing current approaches to employee motivation and performance management. Aims at providing students with practical and conceptual tools that will aid them in future endeavors to design and implement employee development and performance management systems. Format includes in-class discussions, case studies and individual assignments and papers.",
      []
    ]
  },
  "caches": {
    "periods": [
      "1300 - 1540",
      "1400 - 1520",
      "1100 - 1220",
      "0000 - 0000",
      "1530 - 1650",
      "0930 - 1210",
      "1400 - 1640",
      "0900 - 1140",
      "1600 - 1840",
      "1700 - 1940",
      "1400 - 1700",
      "1700 - 1820",
      "1130 - 1250",
      "0900 - 1150",
      "1200 - 1250",
      "1300 - 1350",
      "1230 - 1350",
      "1000 - 1050",
      "0900 - 1020",
      "0800 - 0850",
      "0900 - 0950",
      "0930 - 1050",
      "1100 - 1150",
      "1030 - 1150",
      "1400 - 1450",
      "1500 - 1550",
      "1600 - 1650",
      "1200 - 1320",
      "1500 - 1620",
      "1630 - 1750",
      "1400 - 1550",
      "1600 - 1750",
      "1930 - 2050",
      "1300 - 1420",
      "0930 - 1020",
      "0800 - 0920",
      "1700 - 1950",
      "1100 - 1250",
      "1700 - 1750",
      "0800 - 1050",
      "1530 - 1820",
      "1300 - 1550",
      "0930 - 1220",
      "1830 - 2020",
      "1500 - 1650",
      "1400 - 1720",
      "0900 - 1220",
      "1300 - 1620",
      "1100 - 1450",
      "1500 - 1850",
      "1200 - 1450",
      "1400 - 1650",
      "1600 - 1850",
      "0900 - 1050",
      "1000 - 1150",
      "1000 - 1120",
      "0800 - 0950",
      "0800 - 1150",
      "1300 - 1520",
      "1530 - 1645",
      "1100 - 1215",
      "1400 - 1515",
      "1700 - 1815",
      "1830 - 1945",
      "0930 - 1045",
      "1230 - 1345",
      "1530 - 1620",
      "1630 - 1720",
      "1600 - 1740",
      "1200 - 1350",
      "1800 - 1950",
      "1330 - 1450",
      "1300 - 1450",
      "1600 - 1720",
      "1830 - 1950",
      "1300 - 1750",
      "1700 - 1850",
      "1300 - 1650",
      "1230 - 1320",
      "1900 - 2050",
      "1530 - 1720",
      "1800 - 2100",
      "1800 - 2050",
      "0900 - 1120",
      "1800 - 1920",
      "1630 - 1920",
      "1200 - 1650",
      "1100 - 1330",
      "0930 - 1200",
      "1530 - 1800",
      "1000 - 2000",
      "1200 - 1550",
      "1300 - 1430",
      "1830 - 2130",
      "1600 - 1700",
      "1430 - 1550",
      "1830 - 2100",
      "1630 - 1745",
      "1630 - 1730",
      "1000 - 1250",
      "1600 - 1715",
      "1730 - 1845",
      "1700 - 1800",
      "1300 - 1415",
      "1500 - 1720",
      "1300 - 1600",
      "1400 - 1630",
      "1000 - 1220",
      "1430 - 1820",
      "1500 - 1700",
      "0900 - 1030",
      "1430 - 1630",
      "1035 - 1150",
      "1700 - 1900",
      "1400 - 1620",
      "1450 - 1735",
      "1145 - 1305",
      "1530 - 1750",
      "1500 - 1750",
      "1100 - 1350",
      "0830 - 0950",
      "1100 - 1230",
      "1600 - 1800",
      "1800 - 2000",
      "1900 - 1930",
      "0730 - 1530",
      "1530 - 1550",
      "1000 - 1700",
      "1600 - 1730",
      "1730 - 1850",
      "1630 - 1800",
      "1100 - 1320",
      "1230 - 1430",
      "1500 - 1730",
      "1200 - 1430",
      "1000 - 1200",
      "1700 - 2000",
      "1730 - 2030",
      "1730 - 2020",
      "0900 - 1200",
      "1730 - 2130",
      "0900 - 1600",
      "1900 - 2200",
      "1900 - 1950",
      "1500 - 1615",
      "0800 - 1220",
      "1700 - 1920",
      "1630 - 1910",
      "1600 - 2050",
      "0830 - 1350",
      "0930 - 1040",
      "1500 - 1600",
      "1600 - 1820",
      "0900 - 1145",
      "1300 - 1545",
      "1230 - 1520",
      "1430 - 1620",
      "1010 - 1100",
      "1115 - 1205",
      "1230 - 1420",
      "1800 - 1850",
      "1800 - 2020",
      "0830 - 1120",
      "1530 - 1710",
      "1900 - 2020",
      "1900 - 2030",
      "1000 - 1130",
      "1000 - 1100",
      "0800 - 0940",
      "0900 - 1040",
      "1200 - 1340",
      "1000 - 1115",
      "1330 - 1620",
      "0930 - 1120",
      "1130 - 1320",
      "1030 - 1120",
      "1430 - 1520",
      "1130 - 1220",
      "1330 - 1445",
      "1200 - 1259",
      "1030 - 1145",
      "1330 - 1520",
      "1430 - 1545",
      "0900 - 1015",
      "1330 - 1420",
      "1325 - 1445",
      "1715 - 1830",
      "1729 - 1920",
      "0830 - 1020",
      "1500 - 1659",
      "1300 - 1459",
      "0850 - 1020",
      "1730 - 1930",
      "1330 - 1535",
      "0930 - 1135",
      "1700 - 1930",
      "0900 - 1159",
      "0930 - 1130",
      "0930 - 1129",
      "0915 - 1159",
      "1600 - 1859",
      "1600 - 1810",
      "1700 - 1859",
      "1500 - 1629",
      "1800 - 1915",
      "1600 - 1759",
      "1330 - 1615",
      "1500 - 1555",
      "1330 - 1559",
      "1330 - 1640",
      "1330 - 1630",
      "1345 - 1645",
      "1630 - 1820",
      "1730 - 1920",
      "0900 - 1700",
      "0900 - 1035",
      "1325 - 1450",
      "1500 - 1745",
      "1500 - 1729",
      "1501 - 1745",
      "1330 - 1429",
      "1745 - 1925",
      "1800 - 2005",
      "1740 - 2000",
      "1700 - 1830",
      "1330 - 1529",
      "1000 - 1159",
      "1030 - 1159",
      "1700 - 1910",
      "1010 - 1125",
      "0900 - 1000",
      "0800 - 1030",
      "1830 - 2030",
      "1200 - 1330"
    ],
    "dateRanges": [],
    "scheduleTypes": [
      "Laboratory",
      "Online Lecture",
      "Lecture",
      "Online",
      "Independent Study",
      "Lecture-Discussion",
      "Internship",
      "Studio",
      "Travel",
      "Conference",
      "Seminar",
      "Discussion/ Recitation",
      "Online Discussion",
      "Online Lab",
      "Laboratory-Discussion",
      "Research",
      "Practice",
      "Study Abroad",
      "Quiz",
      "Online Lecture Discussion"
    ],
    "campuses": [],
    "attributes": [],
    "restrictions": [],
    "gradeBases": [],
    "locations": [
      {
        "lat": null,
        "long": null
      },
      {
        "lat": 40.106778040727896,
        "long": -88.2194617156191
      },
      {
        "lat": 40.11171215875622,
        "long": -88.22530849701589
      },
      {
        "lat": 40.107534,
        "long": -88.2281548
      },
      {
        "lat": 40.110811306674734,
        "long": -88.2248467072371
      },
      {
        "lat": 40.105732,
        "long": -88.2281018
      },
      {
        "lat": 40.1083446,
        "long": -88.2282555
      },
      {
        "lat": 40.1131317,
        "long": -88.2264552
      },
      {
        "lat": 40.1020773,
        "long": -88.2296394
      },
      {
        "lat": 40.11246109008789,
        "long": -88.22831726074219
      },
      {
        "lat": 40.11380515934119,
        "long": -88.22490788390387
      },
      {
        "lat": 40.108419421661715,
        "long": -88.2261156301609
      },
      {
        "lat": 40.1072225,
        "long": -88.2262016
      },
      {
        "lat": 40.1110937,
        "long": -88.2232348
      },
      {
        "lat": 40.103587,
        "long": -88.230606
      },
      {
        "lat": 40.1108856,
        "long": -88.2269806
      },
      {
        "lat": 40.1109722,
        "long": -88.2282631
      },
      {
        "lat": 40.107811,
        "long": -88.2260761
      },
      {
        "lat": 40.10944320239664,
        "long": -88.22602522743233
      },
      {
        "lat": 40.1065684,
        "long": -88.2281746
      },
      {
        "lat": 40.10628,
        "long": -88.22621
      },
      {
        "lat": 40.105587640130146,
        "long": -88.22025111416733
      },
      {
        "lat": 40.103620555545135,
        "long": -88.22982720445013
      },
      {
        "lat": 40.1035872,
        "long": -88.2306061
      },
      {
        "lat": 40.10593795776367,
        "long": -88.2270736694336
      },
      {
        "lat": 40.10755766472843,
        "long": -88.22995430218522
      },
      {
        "lat": 40.102726858556835,
        "long": -88.23259991223857
      },
      {
        "lat": 40.101862,
        "long": -88.231737
      },
      {
        "lat": 40.1149296,
        "long": -88.2280589
      },
      {
        "lat": 40.108570819242026,
        "long": -88.22518453938676
      },
      {
        "lat": 40.1047599,
        "long": -88.2319514
      },
      {
        "lat": 40.092875494224195,
        "long": -88.22082220247309
      },
      {
        "lat": 40.11397164321797,
        "long": -88.2265192685827
      },
      {
        "lat": 40.104794,
        "long": -88.224264
      },
      {
        "lat": 40.10783362157985,
        "long": -88.22476189569741
      },
      {
        "lat": 40.111691,
        "long": -88.2242511
      },
      {
        "lat": 40.1035833,
        "long": -88.228405
      },
      {
        "lat": 40.1033599,
        "long": -88.2292111
      },
      {
        "lat": 40.103627234541904,
        "long": -88.22601765311099
      },
      {
        "lat": 40.10127390836906,
        "long": -88.2226073524728
      },
      {
        "lat": 40.0995003,
        "long": -88.223104
      },
      {
        "lat": 40.11085653938169,
        "long": -88.22609810215927
      },
      {
        "lat": 40.1149521,
        "long": -88.2267561
      },
      {
        "lat": 40.10802885201532,
        "long": -88.22239700364068
      },
      {
        "lat": 40.11180304465921,
        "long": -88.22613003543475
      },
      {
        "lat": 40.1022093629303,
        "long": -88.22800864058527
      },
      {
        "lat": 40.10623714823253,
        "long": -88.2232659093846
      },
      {
        "lat": 40.10039170750639,
        "long": -88.21813070187608
      },
      {
        "lat": 40.1034533,
        "long": -88.2327596
      },
      {
        "lat": 40.1028373,
        "long": -88.2251326
      },
      {
        "lat": 40.1048704,
        "long": -88.2229036
      },
      {
        "lat": 40.10099,
        "long": -88.23159
      }
    ],
    "finalDates": [],
    "finalTimes": []
  }
}