{
  "subject": "NPRE",
  "scrapedAt": 1768434505612,
  "courseCount": 30,
  "courses": {
    "NPRE 398": [
      "Special Topics",
      {
        "AI": [
          "65750",
          [
            [
              16,
              "TR",
              "3217 Everitt Laboratory",
              16,
              [
                "Kozlowski, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Subject offerings of new and developing areas of knowledge in nuclear, plasma, and radiological engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites.",
      []
    ],
    "NPRE 101": [
      "Introduction to Energy Sources",
      {
        "A": [
          "34624",
          [
            [
              24,
              "MWF",
              "165 Noyes Laboratory",
              0,
              [
                "Andruczyk, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          6,
          0,
          [],
          -1
        ]
      },
      [],
      "Explanation of energy technologies using an elementary approach presupposing no prior scientific or technical background. Coverage of all energy sources including fossil fueled, solar, hydro, and nuclear power. Integral demonstrations and a tour of the University's power plant. Discussion of energy related incidents with emphasis on environmental, economic, and social impact.",
      []
    ],
    "NPRE 247": [
      "Modeling Nuclear Energy System",
      {
        "C": [
          "34695",
          [
            [
              6,
              "MWF",
              "140 Burrill Hall",
              18,
              [
                "Alam, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Applications of elementary nuclear physics in nuclear engineering. Nuclear reactor materials and components. Steady-state and transient operation of nuclear reactors. Nuclear energy removal and conversion. Radiation shielding.",
      []
    ],
    "NPRE 199": [
      "Undergraduate Open Seminar",
      {
        "A": [
          "34684",
          [
            [
              8,
              "T",
              "4039 Campus Instructional Facility",
              14,
              [
                "Meline, B",
                "Uddin, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          5,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "May be repeated in separate terms to a maximum of 2 times.",
      []
    ],
    "NPRE 297": [
      "Independent Study",
      {
        "": [
          "78217",
          [
            [
              0,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Individual investigations or studies of freshman and sophomore phase of nuclear, plasma, or radiological engineering selected by the student and approved by the department.",
      []
    ],
    "NPRE 412": [
      "Nuclear Power Econ & Fuel Mgmt",
      {
        "A": [
          "70363",
          [
            [
              26,
              "TR",
              "3018 Campus Instructional Facility",
              14,
              [
                "Huff, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ],
        "D4": [
          "70365",
          [
            [
              26,
              "TR",
              "3018 Campus Instructional Facility",
              14,
              [
                "Huff, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Quantitative analysis of the impact of the nuclear power industry; nuclear fuel cycle and capital costs for thermal and fast reactors; optimization of the use of nuclear fuels to provide the lowest energy costs and highest system performance; comparison between fossil fuel systems, fission systems, and controlled thermonuclear fusion systems.",
      []
    ],
    "NPRE 349": [
      "Introduction to NPRE Heat Transfer",
      {
        "A": [
          "74670",
          [
            [
              6,
              "MW",
              "2018 Campus Instructional Facility",
              14,
              [
                "Brooks, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Engineering principles in heat and mass transfer with emphasis on applications in NPRE will be covered. Specifically, the focus in this course will be on heat conduction, convection, radiation, and boiling.",
      []
    ],
    "NPRE 397": [
      "Independent Study",
      {
        "": [
          "10071",
          [
            [
              0,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Individual investigations or studies of any phase of nuclear engineering selected by the student and approved by the department.",
      []
    ],
    "NPRE 402": [
      "Nuclear Power Engineering",
      {
        "D3": [
          "34697",
          [
            [
              12,
              "MWF",
              "2035 Campus Instructional Facility",
              14,
              [
                "Ragheb, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ],
        "D4": [
          "34702",
          [
            [
              12,
              "MWF",
              "2035 Campus Instructional Facility",
              14,
              [
                "Ragheb, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ],
        "ONL": [
          "72560",
          [
            [
              0,
              "",
              "ONLINE",
              0,
              [
                "Ragheb, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Principles of utilization of fission energy in nuclear power engineering; includes such topics as fission processes and controlled chain reactions; nuclear reactor types, design principles, and operational characteristics; power reactor design criteria; radiation hazards and radioactive waste treatment; economics; other applications such as propulsion and research reactors.",
      []
    ],
    "NPRE 421": [
      "Plasma and Fusion Science",
      {
        "L": [
          "34715",
          [
            [
              26,
              "TR",
              "2018 Campus Instructional Facility",
              14,
              [
                "Curreli, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Physics of plasmas, including particle and fluid descriptions, waves, collisions, stability, and confinement, with applications to controlled thermonuclear fusion reactors, problems in fusion engineering, and astrophysics.",
      []
    ],
    "NPRE 441": [
      "Radiation Protection",
      {
        "E": [
          "34725",
          [
            [
              62,
              "MW",
              "3018 Campus Instructional Facility",
              14,
              [
                "Meng, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Sources of nuclear radiation; ionization and energy deposition in matter with an emphasis on biological systems; principles of dosimetry; determination of exposure and limits for internal and external emitters; basic shielding calculations.",
      []
    ],
    "NPRE 451": [
      "NPRE Laboratory",
      {
        "AB5": [
          "57428",
          [
            [
              106,
              "R",
              "101B Talbot Laboratory",
              0,
              [
                "Di Fulvio, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ],
        "AB6": [
          "57429",
          [
            [
              59,
              "F",
              "101B Talbot Laboratory",
              0,
              [
                "Di Fulvio, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ],
        "AE1": [
          "34751",
          [
            [
              5,
              "MW",
              "0018 Campus Instructional Facility",
              14,
              [
                "Di Fulvio, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Radiation detection and instrumentation; radiation dosimetry and shielding; basic measurements in nuclear engineering; engineering applications; micro computer data acquisition and experimental control.",
      []
    ],
    "NPRE 429": [
      "Plasma Engineering",
      {
        "D1": [
          "68869",
          [
            [
              14,
              "MWF",
              "2018 Campus Instructional Facility",
              14,
              [
                "Sankaran, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Basic principles and examples for adapting and applying the plasma state to solve a number of modern engineering problems. Plasma processing of materials for microelectronics and other uses, lighting, plasma displays, and other technologies.",
      []
    ],
    "NPRE 455": [
      "Neutron Diffusion & Transport",
      {
        "N": [
          "34761",
          [
            [
              107,
              "TR",
              "106B1 Engineering Hall",
              20,
              [
                "Novak, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ],
        "ONL": [
          "78009",
          [
            [
              0,
              "",
              "ONLINE",
              0,
              [
                "Novak, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Neutron migration, neutron slowing down and thermalization; neutron continuity equation, multigroup diffusion theory, homogeneous and heterogeneous medium, thermal and fast assemblies; numerical methods for multigroup diffusion equations; reactor dynamics perturbation theory; reactivity coefficients; introductory transport theory.",
      []
    ],
    "NPRE 442": [
      "Radioactive Waste Management",
      {
        "A": [
          "48424",
          [
            [
              17,
              "TR",
              "3018 Campus Instructional Facility",
              14,
              [
                "Roy, W"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Radiation and radiological concepts and measurement, the fuel cycle and waste classification, Part 61, state and federal regulations and regulatory agencies, radiochemistry and the environmental fate of radionuclides, uranium-related wastes, low-level wastes, high-level wastes, used fuel reprocessing, private fuel storage, waste package stability, risk assessment, geologic repositories, transporting radioactive wastes, decommissioning wastes, transmutation, an international perspective on radioactive waste management, and the global nuclear energy partnership.",
      []
    ],
    "NPRE 458": [
      "Design in NPRE",
      {
        "A": [
          "34764",
          [
            [
              18,
              "W",
              "1302 Siebel Center for Comp Sci",
              0,
              [
                "Stubbins, J"
              ],
              -1,
              -1,
              -1
            ],
            [
              24,
              "MF",
              "3018 Campus Instructional Facility",
              14,
              [
                "Stubbins, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Design in nuclear, plasma, and radiological engineering systems; basic principles of definition, organization, constraints, modeling and optimization of system design; case studies; class design projects applying these basic principles.",
      []
    ],
    "NPRE 457": [
      "Safety Anlys Nucl Reactor Syst",
      {
        "D": [
          "78050",
          [
            [
              6,
              "MWF",
              "3018 Campus Instructional Facility",
              14,
              [
                "Ragheb, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ],
        "D4": [
          "78051",
          [
            [
              6,
              "MWF",
              "3018 Campus Instructional Facility",
              14,
              [
                "Ragheb, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ],
        "ONL": [
          "78052",
          [
            [
              0,
              "",
              "ONLINE",
              0,
              [
                "Ragheb, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Basic safety philosophy in nuclear reactor systems; brief review of nuclear reactor systems; regulatory processes; siting considerations; safety problems related to reactor dynamics; evaluation of postulated accidents; risks associated with nuclear fuel cycle; methods of systems safety analysis.",
      []
    ],
    "NPRE 470": [
      "Fuel Cells & Hydrogen Sources",
      {
        "A": [
          "53124",
          [
            [
              13,
              "TR",
              "114 Transportation Building",
              0,
              [
                "Kim, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ],
        "ONL": [
          "72561",
          [
            [
              0,
              "",
              "ONLINE",
              0,
              [
                "Kim, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "The role of hydrogen as a global energy form, hydrogen production by nuclear, fossil and renewable energy sources; hydrogen handling, safety; transportation and storage methods including high-pressure, cryogenic, metal hydrides and chemical hydrides; basic science and technology of fuel cells, including electrochemical processes; fuel cell thermodynamics; low- and high-temperature fuel cells; applications including portable electronics, automotive vehicles, distributed and back-up power, and space power.",
      []
    ],
    "NPRE 475": [
      "Wind Power Systems",
      {
        "GR": [
          "53129",
          [
            [
              14,
              "MWF",
              "1310 Digital Computer Laboratory",
              21,
              [
                "Reihani, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ],
        "ONL": [
          "72562",
          [
            [
              0,
              "",
              "ONLINE",
              0,
              [
                "Reihani, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ],
        "UG": [
          "53126",
          [
            [
              14,
              "MWF",
              "1310 Digital Computer Laboratory",
              21,
              [
                "Reihani, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Overview of wind energy systems; historical development, safety aspect, environmental considerations, wind properties and measurement, site selection, and wind turbine design; transmission systems considerations; mechanical, electrical, control aerodynamic and environmental engineering of modern wind turbines; fatigue failure; annual power production; economics and environmental aspects and accident prevention and mitigation; computational fluid dynamics (CFD) analysis of wind flow and blade interactions; energy storage options; hydrogen production; electrical power transmission issues; licensing issues; alternative wind energy systems; design project involving a wind farm or the construction of a specific type of wind turbine based on a wind park site visit.",
      []
    ],
    "NPRE 480": [
      "Energy and Security",
      {
        "AE1": [
          "34770",
          [
            [
              19,
              "TR",
              "1302 Everitt Laboratory",
              16,
              [
                "Liebenberg, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ],
        "ONL": [
          "72563",
          [
            [
              0,
              "",
              "ONLINE",
              0,
              [
                "Liebenberg, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Security and supplies of energy, mineral resources, and water. Evolution of the importance of various fuels in conflicts (including coal, oil, uranium, and natural gas) starting with the Franco-Prussian Wars. Theories of international conflict and examination of the role of individual leaders versus institutional factors in the precipitation and outcome of pivotal wars. Econometric analyses relevant to past and projected future energy use.",
      []
    ],
    "NPRE 498": [
      "Special Topics",
      {
        "FG4": [
          "40728",
          [
            [
              16,
              "TR",
              "106B3 Engineering Hall",
              20,
              [
                "Andruczyk, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          6,
          0,
          [],
          -1
        ],
        "FU3": [
          "62530",
          [
            [
              16,
              "TR",
              "106B3 Engineering Hall",
              20,
              [
                "Andruczyk, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          6,
          0,
          [],
          -1
        ],
        "NC3": [
          "43862",
          [
            [
              12,
              "MWF",
              "305 Materials Science & Eng Bld",
              0,
              [
                "Vergari, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          6,
          0,
          [],
          -1
        ],
        "NC4": [
          "47108",
          [
            [
              12,
              "MWF",
              "305 Materials Science & Eng Bld",
              0,
              [
                "Vergari, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          6,
          0,
          [],
          -1
        ]
      },
      [],
      "Subject offerings of new and developing areas of knowledge in nuclear, plasma, and radiological engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites.",
      []
    ],
    "NPRE 511": [
      "Nuclear Reactor Heat Transfer",
      {
        "CB": [
          "40726",
          [
            [
              26,
              "TR",
              "206 Transportation Building",
              0,
              [
                "Brooks, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Selected topics in nuclear reactor heat transfer: thermal analysis of fuel elements under steady and transient operation; convective energy transport from reactor cores; two-phase flow and boiling in reactor cores; liquid metal coolant systems.",
      []
    ],
    "NPRE 483": [
      "Seminar on Security",
      {
        "A": [
          "34783",
          [
            [
              25,
              "M",
              "4036 Campus Instructional Facility",
              14,
              [
                "Stubbins, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Preparation of reports on a set of introductory lectures and student choices from various on-campus seminar series relevant to technology of domestic and international security and the regional and international contexts that influence the nature of security problems.",
      []
    ],
    "NPRE 497": [
      "Independent Study",
      {
        "": [
          "78218",
          [
            [
              0,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Independent learning of topics relevant to nuclear, plasma, and radiological engineering. Generic learning outcomes include demonstration of independent learning, literature search, and technical writing.",
      []
    ],
    "NPRE 521": [
      "Interact of Radiation w/Matter",
      {
        "A": [
          "34799",
          [
            [
              18,
              "MW",
              "136 Burrill Hall",
              18,
              [
                "Xi, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Topics in the interaction of radiation with matter of interest to the nuclear engineering field: the kinematics, kinetics, and cross sections involved in the interaction of charged particles, electromagnetic radiation, and neutrons.",
      []
    ],
    "NPRE 531": [
      "Nuclear Materials",
      {
        "D": [
          "39059",
          [
            [
              13,
              "TR",
              "169 Davenport Hall",
              2,
              [
                "Stubbins, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Metallurgical principles applied to materials problems in nuclear engineering; topics in production of uranium, corrosion, radiation damage, fuel element fabrication, and fuel reprocessing.",
      []
    ],
    "NPRE 558": [
      "Advanced Design in NPRE",
      {
        "A": [
          "34932",
          [
            [
              18,
              "W",
              "1302 Siebel Center for Comp Sci",
              0,
              [
                "Stubbins, J"
              ],
              -1,
              -1,
              -1
            ],
            [
              24,
              "MF",
              "3018 Campus Instructional Facility",
              14,
              [
                "Stubbins, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Classroom exercise in the conceptual design of a nuclear engineering system involving a synthesis of previous learning in the field of nuclear engineering and related disciplines. The design includes all necessary ingredients for the system, such as core, thermal-hydraulics, shielding, material selection, and control.",
      []
    ],
    "NPRE 554": [
      "Independent Lab Investigations",
      {
        "": [
          "10072",
          [
            [
              0,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Individual experimental investigation in areas of nuclear, plasma, and radiological engineering.",
      []
    ],
    "NPRE 596": [
      "Seminar in Nuclear Sci & Engrg",
      {
        "A": [
          "34941",
          [
            [
              25,
              "T",
              "4025 Campus Instructional Facility",
              14,
              [
                "Uddin, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          2,
          0,
          [],
          -1
        ],
        "ONL": [
          "73600",
          [
            [
              25,
              "T",
              "ONLINE",
              0,
              [
                "Uddin, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Lectures and discussions on current work in research and development in nuclear engineering and related fields by staff, advanced students, and visiting lecturers.",
      []
    ],
    "NPRE 597": [
      "Independent Study",
      {
        "": [
          "10076",
          [
            [
              0,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Individual study in areas of nuclear engineering and closely related fields not covered by regular course offerings. The work is carried out under the supervision of a member of the faculty.",
      []
    ]
  },
  "caches": {
    "periods": [
      "0000 - 0000",
      "1400 - 1650",
      "0800 - 1050",
      "1800 - 2000",
      "1830 - 2030",
      "0900 - 0950",
      "1000 - 1050",
      "1300 - 1350",
      "1200 - 1250",
      "1000 - 1150",
      "0800 - 0950",
      "1300 - 1450",
      "1100 - 1150",
      "1400 - 1520",
      "1400 - 1450",
      "0900 - 1020",
      "1100 - 1220",
      "1530 - 1650",
      "1500 - 1650",
      "1230 - 1350",
      "1600 - 1720",
      "1430 - 1550",
      "1300 - 1420",
      "1500 - 1750",
      "1500 - 1550",
      "1600 - 1650",
      "0930 - 1050",
      "1200 - 1320",
      "1000 - 1120",
      "1700 - 1820",
      "1400 - 1550",
      "1100 - 1350",
      "1800 - 1930",
      "1500 - 1720",
      "1600 - 1820",
      "1400 - 1720",
      "1100 - 1320",
      "1100 - 1215",
      "1530 - 1645",
      "1530 - 1620",
      "1230 - 1345",
      "1400 - 1515",
      "1030 - 1150",
      "1230 - 1520",
      "1300 - 1550",
      "1500 - 1620",
      "1600 - 1850",
      "1230 - 1430",
      "1530 - 1820",
      "1320 - 1450",
      "0900 - 1150",
      "1430 - 1820",
      "0900 - 1040",
      "0800 - 0850",
      "0900 - 1050",
      "1100 - 1250",
      "1700 - 1750",
      "1400 - 1750",
      "0900 - 1250",
      "1300 - 1650",
      "1600 - 1750",
      "1200 - 1450",
      "1200 - 1350",
      "1700 - 1850",
      "1000 - 1350",
      "0930 - 1220",
      "1000 - 1250",
      "1630 - 1730",
      "1330 - 1500",
      "1600 - 1715",
      "1800 - 1950",
      "0800 - 0920",
      "1530 - 1720",
      "0930 - 1045",
      "0600 - 0720",
      "1700 - 1920",
      "0800 - 0930",
      "1700 - 1830",
      "1900 - 2050",
      "1430 - 1520",
      "1630 - 1750",
      "1430 - 1620",
      "1330 - 1450",
      "1830 - 2050",
      "1430 - 1630",
      "0830 - 0950",
      "1730 - 1820",
      "1100 - 1300",
      "0930 - 1100",
      "1400 - 1530",
      "1500 - 1630",
      "1730 - 1900",
      "1100 - 1230",
      "1800 - 2050",
      "1800 - 1850",
      "1930 - 2130",
      "1730 - 1850",
      "1800 - 2020",
      "1700 - 2000",
      "1900 - 2200",
      "1000 - 1300",
      "1400 - 1630",
      "1900 - 2150",
      "1800 - 1920",
      "1200 - 1300",
      "1000 - 1130",
      "1700 - 2050",
      "1330 - 1520"
    ],
    "dateRanges": [],
    "scheduleTypes": [
      "Internship",
      "Independent Study",
      "Lecture-Discussion",
      "Online",
      "Quiz",
      "Discussion/ Recitation",
      "Lecture",
      "Laboratory",
      "Online Lecture",
      "Seminar",
      "Laboratory-Discussion",
      "Online Discussion",
      "Online Lab",
      "Conference",
      "Study Abroad",
      "Practice",
      "Packaged Section"
    ],
    "campuses": [],
    "attributes": [],
    "restrictions": [],
    "gradeBases": [],
    "locations": [
      {
        "lat": null,
        "long": null
      },
      {
        "lat": 40.10628,
        "long": -88.22621
      },
      {
        "lat": 40.1072225,
        "long": -88.2262016
      },
      {
        "lat": 40.1034533,
        "long": -88.2327596
      },
      {
        "lat": 40.1047599,
        "long": -88.2319514
      },
      {
        "lat": 40.105732,
        "long": -88.2281018
      },
      {
        "lat": 40.1035833,
        "long": -88.228405
      },
      {
        "lat": 40.104794,
        "long": -88.224264
      },
      {
        "lat": 40.107534,
        "long": -88.2281548
      },
      {
        "lat": 40.1065684,
        "long": -88.2281746
      },
      {
        "lat": 40.1083446,
        "long": -88.2282555
      },
      {
        "lat": 40.1033599,
        "long": -88.2292111
      },
      {
        "lat": 40.107811,
        "long": -88.2260761
      },
      {
        "lat": 40.1020773,
        "long": -88.2296394
      },
      {
        "lat": 40.11246109008789,
        "long": -88.22831726074219
      },
      {
        "lat": 40.1028373,
        "long": -88.2251326
      },
      {
        "lat": 40.1109722,
        "long": -88.2282631
      },
      {
        "lat": 40.1110937,
        "long": -88.2232348
      },
      {
        "lat": 40.103587,
        "long": -88.230606
      },
      {
        "lat": 40.1149296,
        "long": -88.2280589
      },
      {
        "lat": 40.1108856,
        "long": -88.2269806
      },
      {
        "lat": 40.1131317,
        "long": -88.2264552
      },
      {
        "lat": 40.10593795776367,
        "long": -88.2270736694336
      },
      {
        "lat": 40.101862,
        "long": -88.231737
      },
      {
        "lat": 40.1116416,
        "long": -88.2248868
      },
      {
        "lat": 40.111691,
        "long": -88.2242511
      }
    ],
    "finalDates": [],
    "finalTimes": []
  }
}