{
  "subject": "RST",
  "scrapedAt": 1768696067263,
  "courseCount": 55,
  "courses": {
    "RST 101": [
      "Orientation to Recreation, Sport and Tourism",
      {
        "A": [
          "43098",
          [
            [
              2,
              "MW",
              "1002 Huff Hall",
              32,
              [
                "Schroeder, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduction to Recreation, Sport and Tourism which provides an overview of the RST curriculum, areas of study, and opportunities available for a career in the field.",
      []
    ],
    "RST 180": [
      "Professional Applications",
      {
        "A": [
          "68080",
          [
            [
              25,
              "T",
              "1001 Huff Hall",
              32,
              [
                "Raycraft, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "This course examines elements of administration, programming, and facility planning and management to high profile recreation, sport, and tourism destinations. The course consists of 6 modules completed during the second 8 weeks and concludes with a 12-day domestic tour (offered in May/early June) of RST related destinations in Indiana, Ohio, New York, Massachusetts, and Pennsylvania. The course will provide students with a unique opportunity to engage with industry leaders at the destinations. The course allows students to explore, discuss, compare and contrast RST destinations, facilities, and professions and apply concepts from the classroom.",
      []
    ],
    "RST 120": [
      "Parks, Recreation, and Environments",
      {
        "A": [
          "43101",
          [
            [
              8,
              "",
              "ONLINE",
              8,
              [
                "Tewari, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "This course focuses on the study of recreation behaviors in different environments—the great outdoors, cities, and specialized settings. In particular, students develop a deeper understanding of how these three different environments support or limit various recreation behaviors. The course employs a holistic definition of environment that includes physical settings, social norms, and policies, all of which impact recreation behaviors. To understand the complex relationships between environments and recreation, the course applies theories and methodologies developed in the field of environment and behavior—spanning psychology, sociology, urban planning, and landscape architecture. Throughout the course, students discuss how gender, race-ethnicity, and socio-economic status can contribute to shaping the relationships between environments and recreation behaviors.",
      []
    ],
    "RST 199": [
      "Undergraduate Open Seminar",
      {
        "CR": [
          "67415",
          [
            [
              3,
              "F",
              "2001 Huff Hall",
              32,
              [
                "Endres, B",
                "Endres, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          5,
          1,
          0,
          [],
          -1
        ],
        "DL": [
          "43612",
          [
            [
              25,
              "T",
              "1001 Huff Hall",
              32,
              [
                "Raycraft, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          5,
          1,
          0,
          [],
          -1
        ],
        "IC": [
          "57491",
          [
            [
              14,
              "TR",
              "1000 Siebel Center for Design",
              33,
              [
                "Kluch, Y"
              ],
              -1,
              -1,
              -1
            ]
          ],
          5,
          1,
          0,
          [],
          -1
        ],
        "ID": [
          "54326",
          [
            [
              4,
              "TR",
              "1000 Siebel Center for Design",
              33,
              [
                "Deterding, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          5,
          1,
          0,
          [],
          -1
        ],
        "NT": [
          "43108",
          [
            [
              3,
              "F",
              "2001 Huff Hall",
              32,
              [
                "Endres, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          5,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Covering various topics for undergraduates in Recreation, Sport & Tourism.",
      []
    ],
    "RST 130": [
      "Foundations of Sport Mgt",
      {
        "A": [
          "43102",
          [
            [
              10,
              "TR",
              "2001 Huff Hall",
              32,
              [
                "Raycraft, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Examines career opportunities within the sport industry and provides knowledge relevant to the management, marketing, legal, and financial operations of sport organizations. Incorporates applications in a variety of sport entities including intercollegiate athletics, campus recreation, event and facility management, professional sport, management and marketing agencies, and international sport.",
      []
    ],
    "RST 185": [
      "Professional Field Experiences",
      {
        "R66": [
          "70862",
          [
            [
              17,
              "M",
              "3019 Huff Hall",
              32,
              [
                "Endres, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Provides students with professional career exploration experiences that involve developing networking knowledge and skills while engaging with recreation, sport, and tourism industry alumni and professionals in their offices, agencies, and facilities. Students are exposed to best practices and current challenges in the industry, and are given opportunities to make connections for internships, mentorship, and career advancement.",
      []
    ],
    "RST 118": [
      "Illini Student-Athlete Transition Seminar",
      {
        "A": [
          "78173",
          [
            [
              81,
              "MW",
              "112 Huff Hall",
              32,
              [
                "Santos, C",
                "Siskind, S"
              ],
              -1,
              -1,
              -1
            ],
            [
              8,
              "MW",
              "ONLINE",
              8,
              [
                "Santos, C",
                "Siskind, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Designed to expose student-athletes to the unique challenges and opportunities they will face throughout their time as student athletes. The course will explore their personal, academic, and athletic experiences. Students will learn strategies and techniques to be academically successful, develop leadership skills, explore careers and college majors, and gain insights to assist in the transition to higher education and the University of Illinois.",
      []
    ],
    "RST 182": [
      "Sapora Symposium",
      {
        "SS1": [
          "77755",
          [
            [
              8,
              "",
              "ONLINE",
              8,
              [
                "Raycraft, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          4,
          0,
          [],
          -1
        ],
        "SS2": [
          "77757",
          [
            [
              8,
              "",
              "ONLINE",
              8,
              [
                "Raycraft, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "The Sapora Symposium is an applied learning series designed to enhance skills and foster collaboration for future recreation, sport and tourism change makers. The course features sessions with high-profile industry veterans and faculty as they explore the latest trends, innovations, and challenges in RST fields. Through expert-led workshops, keynote sessions, and interactive panels, students gain actionable insights into leadership, contemporary issues, and management challenges facing the next generation of industry professionals.",
      []
    ],
    "RST 150": [
      "Foundations of Tourism",
      {
        "B": [
          "78067",
          [
            [
              9,
              "TR",
              "130 Wohlers Hall",
              25,
              [
                "Endres, R"
              ],
              -1,
              -1,
              -1
            ],
            [
              8,
              "TR",
              "ONLINE",
              8,
              [
                "Endres, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Survey of travel and tourism with emphasis upon tourist behavior, motivations, preferences, decision-making, attractions, transportation services, facilities and information sources. Examines travel and tourism as an element of leisure service delivery from an interdisciplinary perspective.",
      []
    ],
    "RST 100": [
      "Recreation, Sport, and Tourism in Modern Society",
      {
        "A": [
          "43096",
          [
            [
              14,
              "TR",
              "101 Armory",
              6,
              [
                "Liechty, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "ON1": [
          "77845",
          [
            [
              8,
              "",
              "ONLINE",
              8,
              [
                "Shinew, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ],
        "ONL": [
          "43097",
          [
            [
              8,
              "",
              "ONLINE",
              8,
              [
                "Shinew, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "This course examines central issues in defining leisure, recreation, sport, and tourism. Historical, philosophical, sociological, psychological, and economic approaches to understanding these areas, their behaviors and meanings, social contexts, and personal and social resources are examined. By the end of the semester, students should understand their history and evolution, as well as their impact on contemporary society.",
      []
    ],
    "RST 204": [
      "Issues in Sport & Higher Education",
      {
        "A": [
          "77754",
          [
            [
              8,
              "",
              "ONLINE",
              8,
              [
                "Raycraft, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "This course examines the enterprise of intercollegiate athletics in the United States. Its primary focus is the contemporary challenges facing higher education administrators in sustaining a competitive advantage and thriving on a college campus. Course content and readings inspire students to identify critical issues, consider reasonable outcomes, and support recommendations for actionable change.",
      []
    ],
    "RST 210": [
      "Management in Recreation, Sport and Tourism",
      {
        "A": [
          "71955",
          [
            [
              3,
              "MWF",
              "166 Bevier Hall",
              4,
              [
                "Norrito, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "This course will introduce students to management issues in the field of recreation, sport, and tourism. Students will be encouraged to begin thinking like a manager and to develop skills related to using management techniques and theories to solve problems that arise in the RST industry. The course will address foundational concepts related to: 1) the RST industry (e.g., sectoral differences, organizational structures and types); 2) management of RST organizations (e.g., leadership, ethics, management theory); and 3) skills to effectively manage human, financial, and marketing resources. This course is intended to prepare students for more advanced courses related to management in RST.",
      []
    ],
    "RST 225": [
      "Environmental Politics & Policy",
      {
        "A": [
          "72091",
          [
            [
              4,
              "TR",
              "242 Armory",
              6,
              [
                "Pahre, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      null,
      []
    ],
    "RST 200": [
      "Leadership in Recreation, Sport and Tourism",
      {
        "A": [
          "43109",
          [
            [
              0,
              "MW",
              "1002 Huff Hall",
              32,
              [
                "Schroeder, J"
              ],
              -1,
              -1,
              -1
            ],
            [
              8,
              "MW",
              "ONLINE",
              8,
              [
                "Schroeder, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          1,
          0,
          [],
          -1
        ],
        "B": [
          "43110",
          [
            [
              2,
              "MW",
              "1002 Huff Hall",
              32,
              [
                "Schroeder, J"
              ],
              -1,
              -1,
              -1
            ],
            [
              8,
              "MW",
              "ONLINE",
              8,
              [
                "Schroeder, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Leadership theories and practices as related to design and delivery of leisure programs. Processes of group development and interpersonal communication in leisure service organizations.",
      []
    ],
    "RST 224": [
      "Politics of the National Parks",
      {
        "A": [
          "74609",
          [
            [
              8,
              "",
              "ONLINE",
              8,
              [
                "Pahre, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      null,
      []
    ],
    "RST 226": [
      "Esports Foundations",
      {
        "A": [
          "78078",
          [
            [
              11,
              "TR",
              "241 Wohlers Hall",
              25,
              [
                "Fredericks, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "This course introduces the study of the role of video games and esports in society. It explores how the design, implementation, and culture of esports connects with themes related to health, socialization, community development, economic development, and nationhood. Specific focus will be placed on the esports industry broadly defined, including individual stakeholders, game developers and publishers, communication and distribution platforms, live events and venues, and the broader cultural impact of esports.",
      []
    ],
    "RST 205": [
      "Issues in Intercollegiate Athletics: The Big Ten Conference",
      {
        "BIG": [
          "71416",
          [
            [
              8,
              "",
              "ONLINE",
              8,
              [
                "Raycraft, M",
                "Sherman, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "For more than 120 years THE BIG TEN has set the standard for college sports. This course will take an historical review of the important decisions and policies conference leaders have made to shape and define the league. With insights and analyses from Big Ten executives, the course will critically examine factors and variables that led to the Rose Bowl partnership, conference expansion, the Big Ten Network, and bold initiatives in growing women's sports.",
      []
    ],
    "RST 216": [
      "Technology in Recreation, Sport and Tourism",
      {
        "B": [
          "71415",
          [
            [
              4,
              "TR",
              "110 Speech & Hearing Science Bldg",
              29,
              [
                "Tucker, C"
              ],
              -1,
              -1,
              -1
            ],
            [
              8,
              "TR",
              "ONLINE",
              8,
              [
                "Tucker, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Assist students in understanding technological advances in recreation, sport and tourism behavior and management through virtual reality (VR) demonstrations and class debates; discuss technology adoption rates in eastern and western cultures and contexts by examining global trends in technology innovations; and critiquing technology’s impacts on personal lives, experiences, and worldviews.",
      []
    ],
    "RST 238": [
      "Professional Sports: Front Office Management",
      {
        "A": [
          "77756",
          [
            [
              11,
              "TR",
              "112 Huff Hall",
              32,
              [
                "Schroeder, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Exploring the inner workings of professional sports organizations is the goal. Students will analyze key functions such as industry trends, franchise ownership and governance, sponsorships and marketing, revenue models, labor relations and collective bargaining, stadium design trends, and more. This elective is designed to familiarize students with an overview of various business avenues and prepare students for careers in professional sport organizations. Students will synthesize course materials to create a proposal for an expansion franchise.",
      []
    ],
    "RST 230": [
      "Diversity in Recreation, Sport, and Tourism",
      {
        "A": [
          "43112",
          [
            [
              8,
              "",
              "ONLINE",
              8,
              [
                "Crickman, O",
                "Stodolska, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Course is designed to increase awareness and knowledge of the needs of members of ethnic and racial minorities, people of lower socio-economic status, women, older adults, people of alternative lifestyles, and people with disabilities when it comes to recreation, sport, and tourism services. It introduces students to concepts and factors that influence the delivery of recreation, sport, and tourism services to diverse populations.",
      []
    ],
    "RST 242": [
      "Nature and American Culture",
      {
        "ONA": [
          "61458",
          [
            [
              8,
              "",
              "ONLINE",
              8,
              [
                "Grimes, D",
                "Park, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ],
        "ONB": [
          "61459",
          [
            [
              8,
              "",
              "ONLINE",
              8,
              [
                "Grimes, D",
                "Park, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Designed to aid in students' understanding, appreciation, and critique of cultural meanings associated with American natural landscapes. To do so, traditional perspectives including colonial American, romantic, and science-based conservation are characterized, as well as revisionist themes aligned with gender, cultural pluralism, and societal meanings of parks and protected areas. Implications of diversity including gender and multicultural meanings toward nature are developed and provide the basis for assessing tenets of contemporary environmental policy and supporting concepts associated with community-based conservation.",
      []
    ],
    "RST 255": [
      "Ethical Issues in Recreation, Sport and Tourism",
      {
        "A": [
          "43105",
          [
            [
              2,
              "MW",
              "1001 Huff Hall",
              32,
              [
                "Janarthanan, R"
              ],
              -1,
              -1,
              -1
            ],
            [
              8,
              "MW",
              "ONLINE",
              8,
              [
                "Janarthanan, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          1,
          0,
          [],
          -1
        ],
        "B": [
          "43106",
          [
            [
              0,
              "MW",
              "1002 Huff Hall",
              32,
              [
                "Janarthanan, R"
              ],
              -1,
              -1,
              -1
            ],
            [
              8,
              "MW",
              "ONLINE",
              8,
              [
                "Janarthanan, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Explores ethical issues related to government, recreational sport, sport tourism and travel, journalism and media, education, coaching, and business. Students become familiar with concepts and principles of applied ethics and gain insight in to the complexity of ethical issues in recreation, sport and tourism.",
      []
    ],
    "RST 280": [
      "Practicum in Recreation, Sport and Tourism",
      {
        "P": [
          "71413",
          [
            [
              8,
              "",
              "ONLINE",
              8,
              [
                "Hardin, H"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          8,
          0,
          [],
          -1
        ]
      },
      [],
      "The practicum course is a 1-credit course that requires students to complete a minimum of 100 hours over the term/semester with an agency that relates to the field of recreation, sport, and tourism. The course enhances the practicum experience by leading students through assignments that will assist them in reflecting on their learning/working experience. The Job Description must be approved and the Site Confirmation Form and Affiliation Agreement must be in place prior to the start of the practicum experience. Students should contact the practicum coordinator for specific instructions and recommendations 3-weeks prior to the start date.",
      []
    ],
    "RST 301": [
      "Sport Brand Management",
      {
        "SBM": [
          "71414",
          [
            [
              10,
              "TR",
              "136 Armory",
              6,
              [
                "Woolf, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Provides an in-depth study of sport brand management. Students will learn how to build and manage brands pursuant to the development of brand equity and how to brand architecture strategies and manage brands over time and across geographic boundaries. Students will apply theories and models of branding to sport branding scenarios and making sound business decisions. Student will gain an understanding of the importance of branding and its impact on consumer behavior.",
      []
    ],
    "RST 240": [
      "Financial Resource Management in Recreation, Sport and Tourism",
      {
        "A": [
          "69060",
          [
            [
              82,
              "TR",
              "2001 Huff Hall",
              32,
              [
                "Endres, R"
              ],
              -1,
              -1,
              -1
            ],
            [
              8,
              "TR",
              "ONLINE",
              8,
              [
                "Endres, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "This course examines financial concepts in the RST industry across public, private, for-profit, and not-for-profit sectors. It covers revenue management, pricing strategies, grantsmanship, fundraising, sponsorship, budgeting, and ratio analysis.",
      []
    ],
    "RST 260": [
      "Disability in Recreation, Sport and Tourism",
      {
        "A1": [
          "70060",
          [
            [
              8,
              "",
              "ONLINE",
              8,
              [
                "Fesemyer, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "This course explores issues affecting recreation, sport, tourism (RST) opportunities and access for people with physical, sensory, developmental, and cognitive disabilities. With the goal of increasing knowledge and skills necessary to enhance RST opportunities for people with disabilities, this course focuses on exploring disability characteristics and RST service provider strategies for reducing barriers to and providing accommodations for participation.",
      []
    ],
    "RST 316": [
      "Human Development and Recreation, Sport and Tourism",
      {
        "A": [
          "43114",
          [
            [
              7,
              "MW",
              "2001 Huff Hall",
              32,
              [
                "Son, J"
              ],
              -1,
              -1,
              -1
            ],
            [
              8,
              "MW",
              "ONLINE",
              8,
              [
                "Son, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "This course will examine the impacts of recreation, sport and tourism activities on human development throughout the lifespan. We will discuss how these activities can promote and/or hinder development across the lifespan as well as how development influences individuals' participation in these activities over time. Building on these concepts, we will discuss applications for creating programs, services, and facilities that are appropriate and satisfying for people in different life stages.",
      []
    ],
    "RST 335": [
      "Leisure and Consumer Culture",
      {
        "A": [
          "66970",
          [
            [
              8,
              "",
              "ONLINE",
              8,
              [
                "Brooks, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ],
        "B": [
          "67987",
          [
            [
              8,
              "",
              "ONLINE",
              8,
              [
                "Brooks, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Examination of contemporary patterns and meanings of leisure in a consumer society. Understanding of the impact of consumption on expressions of identity, gender, social class, race and ethnicity.",
      []
    ],
    "RST 325": [
      "Marketing in Recreation, Sport and Tourism",
      {
        "A": [
          "67038",
          [
            [
              14,
              "TR",
              "1092 Lincoln Hall",
              1,
              [
                "Motoyama, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Application of marketing concepts to the delivery of leisure services. Introduces consumer decision theory analysis. Provides an integrative study of the methods and models for developing and evaluating alternative marketing strategies.",
      []
    ],
    "RST 340": [
      "Facility Management in Recreation, Sport and Tourism",
      {
        "A": [
          "43127",
          [
            [
              9,
              "TR",
              "1046 Siebel Center for Design",
              33,
              [
                "Deterding, R",
                "Puddicombe, N"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Basic understanding of park operations, facility design, construction, and maintenance practices; staff allocations, job analysis, contract administration, organizational structures.",
      []
    ],
    "RST 350": [
      "Tourism and Culture",
      {
        "A": [
          "67042",
          [
            [
              17,
              "MW",
              "1001 Huff Hall",
              32,
              [
                "Russell, Z"
              ],
              -1,
              -1,
              -1
            ],
            [
              8,
              "MW",
              "ONLINE",
              8,
              [
                "Russell, Z"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Studies the relationships that exist between tourists, hosts, their respective culture(s), and the cultural environments in which they interact. Studies tourism and its impacts across cultural boundaries, as well as concepts of cultural authenticity, modernity, image creation, social justice, diversity, and representation of social, racial and ethnic groups. Field trip required.",
      []
    ],
    "RST 393": [
      "Special Problems",
      {
        "A": [
          "45064",
          [
            [
              8,
              "",
              "ONLINE",
              8,
              [
                "Santos, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Special projects in research and independent investigation in any phase of health, physical education, recreation, or related areas selected by the student.",
      []
    ],
    "RST 354": [
      "Legal Aspects of Sport",
      {
        "A": [
          "43118",
          [
            [
              83,
              "W",
              "2001 Huff Hall",
              32,
              [
                "Emkes, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "A study of legal principles and their impact on the sport industry; the course examines the application of different areas of law including tort, contract, constitutional, anti-trust, and intellectual property law to professional, amateur and recreational sport.",
      []
    ],
    "RST 440": [
      "HR Management in RST",
      {
        "A": [
          "67044",
          [
            [
              0,
              "MWF",
              "2001 Huff Hall",
              32,
              [
                "Agate, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Concepts, principles, and objectives of supervision; the nature of the supervisory relationship; supervisory functions and processes; identification and application of methods and techniques; organizational and operational patterns of supervision in recreation and park settings.",
      []
    ],
    "RST 370": [
      "Research Methods & Analysis",
      {
        "A": [
          "43119",
          [
            [
              2,
              "MWF",
              "333 Armory",
              6,
              [
                "Kim, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Educates students in principles of research design, data collection, measurement, methods of statistical analysis, techniques in summarizing data, and the interpretation and application of research findings to the field of Leisure Studies.",
      []
    ],
    "RST 407": [
      "Sport Analytics: Data-Driven Decision Making",
      {
        "A": [
          "74633",
          [
            [
              9,
              "TR",
              "1001 Huff Hall",
              32,
              [
                "Sato, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ],
        "AG": [
          "75063",
          [
            [
              9,
              "TR",
              "1001 Huff Hall",
              32,
              [
                "Sato, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduces students to the basic analytical techniques and quantitative methods that are being used to inform data-driven decisions in the sport industry. Students will discuss and analyze the methods of sport analytic topics, such as player performance, team management, in-game decision making, market research, and data segmentation. To facilitate the teaching and learning process, this class will consist of lectures, discussions, in-class exercises, homework, and individual and team projects.",
      []
    ],
    "RST 429": [
      "Contemporary Issues in Recreation, Sport and Tourism",
      {
        "A": [
          "43123",
          [
            [
              84,
              "MW",
              "1010 Wymer Hall",
              8,
              [
                "Fredericks, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Provides a capstone experience to encourage critical and creative thinking regarding knowledge students accrued from prior courses. The first eight weeks students will meet as a whole and focus on leisure concepts in general, and the second eight weeks students will focus on their specific concentration, (Sport Management, Tourism, or Community Recreation).",
      []
    ],
    "RST 410": [
      "Strategic Management in Recreation, Sport and Tourism",
      {
        "A1": [
          "43121",
          [
            [
              10,
              "TR",
              "384 Armory",
              6,
              [
                "Sato, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "In this capstone course, students integrate previous knowledge including management, marketing, finance and budgeting, operations, and human resources into the development of management strategies for the recreation, sport and tourism industries. Students acquire in-depth knowledge and critical understanding of the various frameworks in which RST organizations operate (commercial, for-profit, not-for-profit, public) and the associated management processes that align with these frameworks including strategic management, industry and competitive analyses, competitive advantage, internal strategies, and issues pertaining to the social responsibility of RST organizations.",
      []
    ],
    "RST 441": [
      "Community Planning and Engagement",
      {
        "A": [
          "68555",
          [
            [
              14,
              "TR",
              "1001 Huff Hall",
              32,
              [
                "Deterding, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ],
        "G": [
          "72743",
          [
            [
              14,
              "TR",
              "1001 Huff Hall",
              32,
              [
                "Deterding, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "This project-based course will provide students with a practical opportunity to collaborate with a community in Illinois. This course focuses on the planning process related to outdoor recreational use of lands in the public domain and seeks to develop a deeper understanding of how to inventory, analyze, and create a strategic vision for recreational services in communities. We will build on the students' knowledge from other RST courses (e.g., RST 210, RST 240, and RST 325) and incorporate literature reflective of current research and past trends in leisure, psychology, sociology, urban planning, and landscape architecture.",
      []
    ],
    "RST 430": [
      "Sport & Development",
      {
        "A": [
          "69059",
          [
            [
              4,
              "TR",
              "1046 Siebel Center for Design",
              33,
              [
                "Kluch, Y"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Provides an overview of sport development and sport for development, and the linkages and intersections between the two concepts. Sport development is concerned with the creation and management of systems designed to optimize participation in sport, and the movement of athletes both vertically and horizontally through the sport system. Sport for development focuses on the use of sport to potentially achieve social change and development outcomes at the individual, community, and societal levels. Invariably, these concepts are linked, and one cannot exist without the other. Each module will take an integrative approach and examine sport development and sport for development concurrently, with focus on practical applications of all concepts.",
      []
    ],
    "RST 485": [
      "Internship",
      {
        "A": [
          "67045",
          [
            [
              8,
              "",
              "ONLINE",
              8,
              [
                "Hardin, H"
              ],
              -1,
              -1,
              -1
            ]
          ],
          12,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "The internship course requires you to complete a minimum of 400 hours over 10 weeks with an agency that relates to your major. The course is designed to enhance the internship experience by leading you through practical steps that empower you in the learning/working experience, practice skills and concepts presented in academic classes, explore areas of personal and professional interest, and by introducing problem and conflict solving techniques.",
      []
    ],
    "RST 465": [
      "Event Implementation and Evaluation in Recreation, Sport and Tourism",
      {
        "A": [
          "70064",
          [
            [
              11,
              "TR",
              "2001 Huff Hall",
              32,
              [
                "Agate, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "B": [
          "77814",
          [
            [
              14,
              "TR",
              "331 Armory",
              6,
              [
                "Agate, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "This course is the second of a two course event capstone series. The first class (RST 460) examines the core basics from idea generation through initial planning stages. This course (RST 465) builds on material covered in the first course and includes an in-depth, thorough, and critical examination of the event experience including the roles of the event manager, event planning strategies, marketing and sponsorship concepts, legal aspects, staff management, budgeting, and evaluation.",
      []
    ],
    "RST 480": [
      "Orientation to Internship",
      {
        "A": [
          "43124",
          [
            [
              5,
              "MW",
              "160 English Building",
              10,
              [
                "Hardin, H"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Prepares students for the RST Internship (RST 485). Topics include placement requirements and policies, resume preparation, interviewing skills, acquiring letters of application, and the roles and issues of professional practice.",
      []
    ],
    "RST 516": [
      "Financial Management and Budgeting in Recreation, Sport & Tourism",
      {
        "A": [
          "57494",
          [
            [
              14,
              "TR",
              "1002 Huff Hall",
              32,
              [
                "Berdychevsky, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ],
        "OLM": [
          "77296",
          [
            [
              8,
              "",
              "ONLINE",
              8,
              [
                "Berdychevsky, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Addresses the financial needs of organizations in recreation, sport and tourism. Students are introduced to the terminology and financial measurement tools used by academics and firms in the industry. Current economic issues, revenue streams, and budgeting are emphasized. Students develop the ability to critically assess the financial strengths and vulnerabilities of individual organizations and the field as a whole. An in-depth examination of an organization's internal and external environment in recreation, sport or tourism serves as the capstone.",
      []
    ],
    "RST 502": [
      "Critical Issues Recreation Mgt",
      {
        "OLM": [
          "72086",
          [
            [
              8,
              "",
              "ONLINE",
              8,
              [
                "Payne, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "In-depth study of the public administrative functions in large complex organizational structures; development of an understanding of change and evolution in leisure service agencies as related to the internal and external environments; study of various management styles and situations in leisure service agencies.",
      []
    ],
    "RST 504": [
      "Applied Evaluation and Needs Assessment in RST",
      {
        "OLM": [
          "76022",
          [
            [
              8,
              "",
              "ONLINE",
              8,
              [
                "Mulvaney, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Designed to increase students' understanding of applied research and program evaluation with an emphasis on research approaches, strategies, and methods used in park, recreation, sport, and tourism settings to address management issues and improve overall organizational functioning.",
      []
    ],
    "RST 519": [
      "Strategic Management in RST",
      {
        "OLM": [
          "76023",
          [
            [
              8,
              "",
              "ONLINE",
              8,
              [
                "Fredericks, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "In this capstone module, students integrate previous knowledge, including management, marketing, finance, RST operations and human resources, in the development of business strategy in a competitive setting in recreation, sport and tourism industries. Students acquire in-depth knowledge and critical understanding of the environment in which RST organizations operate, the strategic management process, industry and competitive analysis, strategies to build competitive advantage, managing the internal organization and issues pertaining to the social responsibility of RST organizations.",
      []
    ],
    "RST 501": [
      "Foundations and Current Issues in Recreation, Sport & Tourism",
      {
        "OLM": [
          "76020",
          [
            [
              8,
              "",
              "ONLINE",
              8,
              [
                "Soulard, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Basic philosophical, historical, and scientific foundations and developments in leisure and recreation; analyses of the significance of leisure in modern societies; critical review of major writings in the field with attention to particular special problem areas and current issues.",
      []
    ],
    "RST 551": [
      "Contemporary Issues in Leisure",
      {
        "A": [
          "58745",
          [
            [
              84,
              "MW",
              "3019 Huff Hall",
              32,
              [
                "Inoue, Y"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Provides students with a greater understanding and appreciation of the various disciplines that influence, and are related to, leisure. Examines how these disciplines might influence future research in leisure studies.",
      []
    ],
    "RST 515": [
      "Marketing in RST",
      {
        "A": [
          "50250",
          [
            [
              44,
              "TR",
              "1002 Huff Hall",
              32,
              [
                "Soulard, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Examines quality service issues and service strategies needed to attain competitive advantage across leisure industries. Using a customer-focused management framework, the course focuses on customer satisfaction and retention, linking service quality, customer lifetime value, profitability segmentation, services mapping, understanding customer expectations and developing service and customer-focused relationship marketing strategies.",
      []
    ],
    "RST 530": [
      "Critical Issues Tourism Mgt",
      {
        "OLM": [
          "76815",
          [
            [
              8,
              "",
              "ONLINE",
              8,
              [
                "Rich, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Exposes students to advanced theories, methods, practices and principles that govern tourism behavior. Survey the body of literature on tourism, examining ongoing debates regarding how individuals travel and the structures of institutions that shape travel.",
      []
    ],
    "RST 585": [
      "Inclusive by Design in RST",
      {
        "A": [
          "74696",
          [
            [
              4,
              "TR",
              "1000 Siebel Center for Design",
              33,
              [
                "Deterding, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduces the fundamental principles of inclusive design specifically in the Recreation, Sport and Tourism arena and prepares the learner for further exploration, study and focus on all aspects of lifespan development. The course discusses inclusive and universal design, laws and standards, facility design, programming/events, policies and procedures, communication methods and workplace culture. Students will examine the types and ranges of user identities that contribute to the diversity of the stakeholders in our communities.",
      []
    ],
    "RST 560": [
      "Teaching in the Professoriate",
      {
        "A": [
          "77992",
          [
            [
              85,
              "T",
              "209 Huff Hall",
              32,
              [
                "Gobin, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as HK 562 and SHS 565. See HK 562.",
      []
    ],
    "RST 590": [
      "Doctoral Research Seminar and Colloquium",
      {
        "A": [
          "43130",
          [
            [
              8,
              "",
              "ONLINE",
              8,
              [
                "Unassigned Instructor"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Required of all doctoral students for four semesters. Presentations and discussions of current research by doctoral students, faculty members, visiting scholars, and professional leaders. Discussion of topics critical to the academic preparation of doctoral students will also be included, e.g., ethics of conducting research, publication process, grantsmanship, and academic job search.",
      []
    ],
    "RST 594": [
      "Special Topics in Leisure",
      {
        "CRG": [
          "46298",
          [
            [
              3,
              "F",
              "2001 Huff Hall",
              32,
              [
                "Endres, B",
                "Endres, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ],
        "DL1": [
          "43132",
          [
            [
              25,
              "T",
              "1001 Huff Hall",
              32,
              [
                "Raycraft, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ],
        "IC": [
          "53056",
          [
            [
              14,
              "TR",
              "1000 Siebel Center for Design",
              33,
              [
                "Kluch, Y"
              ],
              -1,
              -1,
              -1
            ],
            [
              8,
              "TR",
              "ONLINE",
              8,
              [
                "Kluch, Y"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ],
        "R66": [
          "57265",
          [
            [
              17,
              "M",
              "3019 Huff Hall",
              32,
              [
                "Endres, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Lecture courses in topics of current interest; specific subject matter will be announced in the Class Schedule.",
      []
    ]
  },
  "caches": {
    "periods": [
      "0900 - 0950",
      "1000 - 1050",
      "1100 - 1150",
      "1300 - 1350",
      "0930 - 1050",
      "1200 - 1250",
      "1400 - 1450",
      "1500 - 1550",
      "ARRANGED",
      "1530 - 1650",
      "1100 - 1220",
      "1400 - 1520",
      "1500 - 1620",
      "1700 - 1820",
      "1230 - 1350",
      "1500 - 1720",
      "1600 - 1820",
      "1600 - 1650",
      "0800 - 0950",
      "1000 - 1150",
      "1200 - 1350",
      "1400 - 1550",
      "1600 - 1750",
      "1800 - 1950",
      "1300 - 1450",
      "1700 - 1750",
      "1000 - 1250",
      "1300 - 1550",
      "1600 - 1850",
      "0800 - 1050",
      "1100 - 1350",
      "1400 - 1650",
      "1700 - 1950",
      "1130 - 1250",
      "1800 - 1850",
      "1900 - 1950",
      "2000 - 2050",
      "1700 - 1850",
      "1000 - 1120",
      "1300 - 1650",
      "0800 - 1150",
      "0900 - 1150",
      "1300 - 1420",
      "1630 - 1750",
      "1800 - 1920",
      "1930 - 2050",
      "1700 - 1830",
      "0930 - 1210",
      "1130 - 1300",
      "1500 - 1650",
      "1500 - 1750",
      "1530 - 1620",
      "1030 - 1150",
      "1600 - 1720",
      "1330 - 1450",
      "0930 - 1150",
      "1330 - 1550",
      "1400 - 1620",
      "1200 - 1320",
      "1530 - 1750",
      "1730 - 1850",
      "1400 - 1515",
      "0900 - 1050",
      "1100 - 1250",
      "1530 - 1720",
      "1100 - 1215",
      "0800 - 0920",
      "1430 - 1550",
      "1600 - 1715",
      "0900 - 1130",
      "0930 - 1130",
      "0900 - 1020",
      "1000 - 1130",
      "1500 - 1730",
      "0900 - 1140",
      "0930 - 1045",
      "0800 - 0850",
      "1530 - 1645",
      "1700 - 1815",
      "0800 - 0915",
      "1230 - 1345",
      "1900 - 2020",
      "0930 - 1020",
      "1800 - 2030",
      "1400 - 1540",
      "1530 - 1710"
    ],
    "dateRanges": [],
    "scheduleTypes": [
      "Laboratory",
      "Lecture-Discussion",
      "Discussion/ Recitation",
      "Lecture",
      "Online",
      "Independent Study",
      "Laboratory-Discussion",
      "Online Lecture",
      "Internship",
      "Conference",
      "Seminar"
    ],
    "campuses": [],
    "attributes": [],
    "restrictions": [],
    "gradeBases": [],
    "locations": [
      {
        "lat": 40.10628,
        "long": -88.22621
      },
      {
        "lat": 40.1065684,
        "long": -88.2281746
      },
      {
        "lat": 40.1072225,
        "long": -88.2262016
      },
      {
        "lat": 40.105732,
        "long": -88.2281018
      },
      {
        "lat": 40.104794,
        "long": -88.224264
      },
      {
        "lat": 40.108419421661715,
        "long": -88.2261156301609
      },
      {
        "lat": 40.1047599,
        "long": -88.2319514
      },
      {
        "lat": 40.1033599,
        "long": -88.2292111
      },
      {
        "lat": null,
        "long": null
      },
      {
        "lat": 40.110811306674734,
        "long": -88.2248467072371
      },
      {
        "lat": 40.107534,
        "long": -88.2281548
      },
      {
        "lat": 40.10755766472843,
        "long": -88.22995430218522
      },
      {
        "lat": 40.1035833,
        "long": -88.228405
      },
      {
        "lat": 40.1020773,
        "long": -88.2296394
      },
      {
        "lat": 40.1083446,
        "long": -88.2282555
      },
      {
        "lat": 40.1110937,
        "long": -88.2232348
      },
      {
        "lat": 40.111691,
        "long": -88.2242511
      },
      {
        "lat": 40.11171215875622,
        "long": -88.22530849701589
      },
      {
        "lat": 40.11246109008789,
        "long": -88.22831726074219
      },
      {
        "lat": 40.108570819242026,
        "long": -88.22518453938676
      },
      {
        "lat": 40.103587,
        "long": -88.230606
      },
      {
        "lat": 40.11085653938169,
        "long": -88.22609810215927
      },
      {
        "lat": 40.103627234541904,
        "long": -88.22601765311099
      },
      {
        "lat": 40.1109722,
        "long": -88.2282631
      },
      {
        "lat": 40.106778040727896,
        "long": -88.2194617156191
      },
      {
        "lat": 40.103620555545135,
        "long": -88.22982720445013
      },
      {
        "lat": 40.0995003,
        "long": -88.223104
      },
      {
        "lat": 40.1028373,
        "long": -88.2251326
      },
      {
        "lat": 40.10944320239664,
        "long": -88.22602522743233
      },
      {
        "lat": 40.10764262805109,
        "long": -88.23074052515514
      },
      {
        "lat": 40.1108856,
        "long": -88.2269806
      },
      {
        "lat": 40.10783362157985,
        "long": -88.22476189569741
      },
      {
        "lat": 40.1034533,
        "long": -88.2327596
      },
      {
        "lat": 40.102726858556835,
        "long": -88.23259991223857
      }
    ],
    "finalDates": [],
    "finalTimes": []
  }
}