{
  "subject": "SHS",
  "scrapedAt": 1768450879438,
  "courseCount": 48,
  "courses": {
    "SHS 271": [
      "Communication and Aging",
      {
        "AD1": [
          "66786",
          [
            [
              20,
              "W",
              "166 Education Building",
              8,
              [
                "Pucilowski, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          11,
          0,
          [],
          -1
        ],
        "AD2": [
          "71691",
          [
            [
              17,
              "W",
              "166 Education Building",
              8,
              [
                "Pucilowski, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          11,
          0,
          [],
          -1
        ],
        "AD3": [
          "71692",
          [
            [
              22,
              "W",
              "166 Education Building",
              8,
              [
                "Pucilowski, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          11,
          0,
          [],
          -1
        ],
        "AL1": [
          "77738",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Pucilowski, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Course introduces social and physical issues of communication and aging, with particular emphasis on intergenerational interactions and on the physical disabilities of aging (e.g., hearing loss, Parkinson's disease, strokes, dementia). Discourse analysis techniques are used to integrate the social and physical aspects of aging and communication that are discussed in class.",
      []
    ],
    "SHS 200": [
      "General Phonetics",
      {
        "AD1": [
          "37201",
          [
            [
              20,
              "M",
              "209 Huff Hall",
              48,
              [
                "Huang, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ],
        "AD2": [
          "37308",
          [
            [
              17,
              "M",
              "209 Huff Hall",
              48,
              [
                "Huang, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ],
        "AD3": [
          "37199",
          [
            [
              22,
              "M",
              "209 Huff Hall",
              48,
              [
                "Huang, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ],
        "AL1": [
          "37310",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Huang, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Basic principles of phonetic study; includes observation and representation of pronunciation, ear training, and practice in transcription.",
      []
    ],
    "SHS 121": [
      "American Sign Language I",
      {
        "A": [
          "53282",
          [
            [
              188,
              "MW",
              "430 Armory",
              30,
              [
                "Colon, I"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ],
        "C": [
          "53284",
          [
            [
              54,
              "TR",
              "ONLINE",
              0,
              [
                "Williams, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ],
        "D": [
          "53285",
          [
            [
              72,
              "TR",
              "1060 Wymer Hall",
              0,
              [
                "Colon, I"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "This is an introductory course in American Sign Language (ASL). No prior experience with the language is necessary. Students will learn vocabulary, elementary-level grammatical structures, and elements of U.S. Deaf Culture in order to engage in entry-level conversations in ASL. Basic social and communication skills associated with the use of ASL will be emphasized. This course is part of a sequence of courses that will fulfill the foreign language requirement for UIUC undergraduate students.",
      []
    ],
    "SHS 221": [
      "American Sign Language II",
      {
        "A": [
          "51117",
          [
            [
              54,
              "MW",
              "ONLINE",
              0,
              [
                "Williams, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ],
        "B": [
          "58002",
          [
            [
              56,
              "TR",
              "ONLINE",
              0,
              [
                "Williams, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ],
        "C": [
          "46615",
          [
            [
              54,
              "TR",
              "1002 Huff Hall",
              48,
              [
                "Colon, I"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ],
        "D": [
          "48077",
          [
            [
              72,
              "MW",
              "429 Armory",
              30,
              [
                "Colon, I"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "This intermediate course in American Sign Language (ASL) is part of a sequence to fulfill the foreign language requirement. Students must have successfully completed SHS 121 or should be able to demonstrate advanced beginner ASL skills. Students will continue to learn vocabulary items and intermediate-level grammatical structures in order to improve conversation skills. As compared to SHS 121, a greater focus is placed on ASL constructions involving the complex use of space (e.g., verb inflections, so-called \"classifiers\", and constructed action).",
      []
    ],
    "SHS 199": [
      "Undergraduate Open Seminar",
      {
        "": [
          "10167",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          5,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Approved for letter and S/U grading. May be repeated, if topics vary.",
      []
    ],
    "SHS 291": [
      "Research Lab Experience in SHS",
      {
        "": [
          "61492",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Supervised participation in research laboratory and scholarly activities, usually as an assistant to an investigator.",
      []
    ],
    "SHS 170": [
      "Intro Hum Comm Sys & Disorders",
      {
        "AD1": [
          "71800",
          [
            [
              20,
              "W",
              "2233 Everitt Laboratory",
              16,
              [
                "Fogerty, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          11,
          0,
          [],
          -1
        ],
        "AD2": [
          "71801",
          [
            [
              17,
              "W",
              "2233 Everitt Laboratory",
              16,
              [
                "Fogerty, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          11,
          0,
          [],
          -1
        ],
        "AD3": [
          "71802",
          [
            [
              22,
              "W",
              "2233 Everitt Laboratory",
              16,
              [
                "Fogerty, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          11,
          0,
          [],
          -1
        ],
        "AL": [
          "37177",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Fogerty, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Examines broad perspectives of theories and information regarding normal and abnormal communication: how speech and language develop, how people hear, how they produce speech and what can go wrong; addresses the impact of speech and hearing science on society, culture, and modern technologies.",
      []
    ],
    "SHS 120": [
      "Child, Comm, & Lang Ability",
      {
        "C1": [
          "55588",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Sone, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Provides an introduction to the study of the human communication and language capacity and includes an overview of three areas of inquiry: language science, language development in children, and language disability in children.",
      []
    ],
    "SHS 191": [
      "Freshmen Seminar",
      {
        "": [
          "10164",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          9,
          4,
          0,
          [],
          -1
        ],
        "X": [
          "37186",
          [
            [
              22,
              "MW",
              "32 Psychology Building",
              25,
              [
                "Warnes, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          9,
          9,
          0,
          [],
          -1
        ]
      },
      [],
      "Special experimental seminar or independent study course intended to cover topics not treated by regular course offerings; open to undergraduates at any level. Requests for activation of this course may be made by students or by faculty and should be directed to the head of the academic department concerned. Although credit toward graduation is normally granted, credit toward satisfying specific college or departmental requirements is contingent upon approval by the appropriate college or departmental committee.",
      []
    ],
    "SHS 222": [
      "Language & Culture of Deaf Communities",
      {
        "C01": [
          "62206",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Seremeth, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Students will learn about culture and how it is manifested in various subgroups of society with a particular focus on the culture and language of Deaf people in the United States. Themes include: the linguistics of American Sign Language, aspects of social unity for Deaf people, common experiences of Deaf individuals, the educational system and Deaf students, and current issues that affect the Deaf community. For those students requiring 4 semesters of language other than English credit (LAS or BUS), SHS 222 can be used as the fourth course in the American Sign Language sequence that includes SHS 121, 221, and 321 to fulfill that requirement but cannot also then be used for Gen Ed requirements.",
      []
    ],
    "SHS 352": [
      "Hearing Health and Society",
      {
        "A": [
          "53352",
          [
            [
              16,
              "MW",
              "1090 Lincoln Hall",
              19,
              [
                "Flaherty, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "An analysis of how hearing loss influences behavior of individuals and interactions among individuals within larger social/societal groups across the lifespan. Considers issues associated with early detection of hearing loss and promoting hearing conservation in different environments. Approaches to promoting behaviors that enhance communication in the presence of hearing loss will be explored. Philosophical, policy, and cultural controversies for defining hearing loss as a disability will be examiend. Each of these topics will be considered within the interplay between the individual person, culture, age, disability, educational environment, community, and social/family interactions.",
      []
    ],
    "SHS 321": [
      "American Sign Language III",
      {
        "A": [
          "55445",
          [
            [
              56,
              "MW",
              "ONLINE",
              0,
              [
                "Williams, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ],
        "B": [
          "55442",
          [
            [
              72,
              "MW",
              "ONLINE",
              0,
              [
                "Seremeth, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ],
        "C": [
          "60682",
          [
            [
              44,
              "MW",
              "ONLINE",
              0,
              [
                "Seremeth, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "This advanced-intermediate course in American Sign Language (ASL) is part of a sequence to fulfill the foreign language requirement. Students must have successfully completed SHS 221 or should be able to demonstrate intermediate ASL conversation skills. Students will learn technical vocabulary items and complex elements of ASL narratives. In this course, students will focus on the fluid use of ASL across various registers and situations. Special emphasis will be placed on receptive fluency of complex constructions in ASL.",
      []
    ],
    "SHS 395": [
      "Honors Individual Study",
      {
        "": [
          "10173",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Individual study leading either to a thesis or to departmental honors.",
      []
    ],
    "SHS 301": [
      "General Speech Science",
      {
        "AB1": [
          "37319",
          [
            [
              20,
              "F",
              "1002 Huff Hall",
              48,
              [
                "Bottalico, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ],
        "AB2": [
          "63728",
          [
            [
              17,
              "F",
              "1002 Huff Hall",
              48,
              [
                "Bottalico, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ],
        "AE1": [
          "37321",
          [
            [
              4,
              "TR",
              "213 Gregory Hall",
              5,
              [
                "Bottalico, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Consideration of the physiology of the speaking act, and the acoustical and perceptual aspects of speech.",
      []
    ],
    "SHS 390": [
      "Individual Study",
      {
        "": [
          "10170",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Individual investigation of special problems.",
      []
    ],
    "SHS 389": [
      "Neuroplasticity and Communication",
      {
        "A": [
          "70635",
          [
            [
              21,
              "TR",
              "144 Armory",
              30,
              [
                "Monson, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "The human brain adapts and changes continually throughout the human lifespan. This phenomenon is known as neuroplasticity. In this course, we will come to a better understanding of the principles of neuroplasticity, including during development, critical periods, learning and skill mastery, and reorganization/rehabilitation of functional abilities following brain damage. We will draw heavily on current research pertaining to neuroplasticity involving brain structures and functions important for communication.",
      []
    ],
    "SHS 375": [
      "Communication Partners and Health",
      {
        "A": [
          "53347",
          [
            [
              38,
              "M",
              "1001 Huff Hall",
              48,
              [
                "Mertes, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Combines a community-based volunteer experience with class-based readings/discussion to introduce students to the study of communication in context. Students will use learning journals to document their volunteer experiences, describe the characteristics of conversational interactions they observe, and reflect on their own skills as flexible communication partners with people of various backgrounds and abilities and in a variety of clinical and professional settings. Includes a one-hour weekly discussion section (taught by SHS faculty/instructional staff) and three-four hour weekly community volunteer experiences (supervised by volunteer site employees).",
      []
    ],
    "SHS 380": [
      "Comm Competence and Disorders",
      {
        "CCD": [
          "63610",
          [
            [
              2,
              "R",
              "W109 Turner Hall",
              0,
              [
                "Channell, M"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "R",
              "ONLINE",
              0,
              [
                "Channell, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          11,
          0,
          [],
          -1
        ]
      },
      [],
      "This course explores ways of defining and documenting communicative competence for individuals with communication disorders in everyday interactions. It introduces students to theories of communication-in-context and methods of discourse analysis. Students will critically review research on discourse of individuals with communication disorders across the lifespan and discuss its relevance to clinical practice.",
      []
    ],
    "SHS 385": [
      "Interpreting Clinical Research in Speech & Hearing Science",
      {
        "EBP": [
          "66099",
          [
            [
              1,
              "MW",
              "1092 Lincoln Hall",
              19,
              [
                "Flaherty, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Designed to examine how the field of Speech and Hearing Science creates knowledge or evidence to support the assessment and intervention of individuals with communication disorders. Students will gain an introductory understanding of clinical research methodology and become familiar with the process of selecting evidence-based practices.",
      []
    ],
    "SHS 427": [
      "Language and the Brain",
      {
        "G4": [
          "50793",
          [
            [
              16,
              "TR",
              "432 Armory",
              30,
              [
                "Pucilowski, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ],
        "UG3": [
          "50792",
          [
            [
              16,
              "TR",
              "432 Armory",
              30,
              [
                "Pucilowski, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "How the human brain supports production and comprehension of language. Topics covered include: neuroanatomy of language; neuroimaging of language; language disorders; brain lateralization for language; bilingualism and the brain; sign language and the brain.",
      []
    ],
    "SHS 451": [
      "Aural Rehab Children to Adults",
      {
        "B": [
          "77736",
          [
            [
              1,
              "R",
              "3025 Campus Instructional Facility",
              9,
              [
                "Braun, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Principles and methods of clinical and classroom retraining of the hard-of-hearing; includes lip reading, auditory training, speech disorders and conservation, and counseling.",
      []
    ],
    "SHS 473": [
      "Augmentative & Alternative Communication",
      {
        "UG3": [
          "54625",
          [
            [
              4,
              "MW",
              "223 Gregory Hall",
              5,
              [
                "Brittlebank, S",
                "Fanta Alarcon, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduces students to the field of augmentative and alternative communication (AAC), to the range of assistive technologies, and to diagnostic and treatment approaches used by speech-language pathologists. Focuses on the communicative needs of adults and children with acquired communication disorders in a variety of settings (e.g., hospital, school, home, work).",
      []
    ],
    "SHS 475": [
      "Prepracticum in SHS",
      {
        "AUD": [
          "53319",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Braun, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          5,
          0,
          [],
          -1
        ],
        "SLP": [
          "53321",
          [
            [
              20,
              "M",
              "1001 Huff Hall",
              48,
              [
                "Franz, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "A mentoring experience in which students will be paired with clinical instructors in SHS and provided opportunities to observe clinical speech-language pathology and audiology sessions in a variety of settings. Prepracticum is designed to provide students: 1) initial opportunities to integrate course work with clinical practice; 2) supported experiences in documentation/data collection skills used in clinical settings; and 3) supervised observation hours required by the American Speech-Language and Hearing Association (ASHA) for certification as a Speech-Language Pathologist or Audiologist.",
      []
    ],
    "SHS 532": [
      "Language Disorders & Literacy in School-Age Children & Youth",
      {
        "C": [
          "37415",
          [
            [
              82,
              "M",
              "256 Speech & Hearing Science Bldg",
              53,
              [
                "McKenna, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "A graduate-level course on language and literacy development in children during the elementary, middle, and high school years. It is intended to provide students with the foundation to offer speech-language pathology services to school-age children and youth. Students will gain knowledge in the diagnosis, assessment and treatment of language disorders and learning disabilities in school-age children and youth with an emphasis on evidence-based practice.",
      []
    ],
    "SHS 477": [
      "Beginning Practicum in Speech-Language Pathology",
      {
        "BRU": [
          "73413",
          [
            [
              19,
              "F",
              "256 Speech & Hearing Science Bldg",
              53,
              [
                "Dahman, J"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "F",
              "ONLINE",
              0,
              [
                "Dahman, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          11,
          0,
          [],
          -1
        ],
        "BUR": [
          "53829",
          [
            [
              19,
              "F",
              "256 Speech & Hearing Science Bldg",
              53,
              [
                "Dahman, J"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "F",
              "ONLINE",
              0,
              [
                "Dahman, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          11,
          0,
          [],
          -1
        ],
        "DAH": [
          "53831",
          [
            [
              19,
              "F",
              "256 Speech & Hearing Science Bldg",
              53,
              [
                "Dahman, J"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "F",
              "ONLINE",
              0,
              [
                "Dahman, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          11,
          0,
          [],
          -1
        ],
        "FRA": [
          "53799",
          [
            [
              19,
              "F",
              "256 Speech & Hearing Science Bldg",
              53,
              [
                "Dahman, J"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "F",
              "ONLINE",
              0,
              [
                "Dahman, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          11,
          0,
          [],
          -1
        ],
        "HOL": [
          "75594",
          [
            [
              19,
              "F",
              "256 Speech & Hearing Science Bldg",
              53,
              [
                "Dahman, J"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "F",
              "ONLINE",
              0,
              [
                "Dahman, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          11,
          0,
          [],
          -1
        ],
        "MEN": [
          "53830",
          [
            [
              19,
              "F",
              "256 Speech & Hearing Science Bldg",
              53,
              [
                "Dahman, J"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "F",
              "ONLINE",
              0,
              [
                "Dahman, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          11,
          0,
          [],
          -1
        ],
        "MIN": [
          "59411",
          [
            [
              19,
              "F",
              "256 Speech & Hearing Science Bldg",
              53,
              [
                "Dahman, J"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "F",
              "ONLINE",
              0,
              [
                "Dahman, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          11,
          0,
          [],
          -1
        ],
        "UG": [
          "74484",
          [
            [
              19,
              "F",
              "256 Speech & Hearing Science Bldg",
              53,
              [
                "Dahman, J"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "F",
              "ONLINE",
              0,
              [
                "Dahman, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          11,
          0,
          [],
          -1
        ]
      },
      [],
      "Mentored experience in which students are paired with a clinical instructor in SHS and provided opportunities to assist in the ongoing management of clinical cases in a variety of settings. The beginning practicum is designed for students with less than a year of supervised clinical experience (i.e., 100 or fewer contact hours as defined by the American Speech-Language Hearing Association - ASHA). Working with a clinical educator, the beginning practicum will provide students with: 1) supported opportunities to assist in all aspects of clinical practice (e.g., diagnosis, intervention, documentation, team meetings/planning); 2) opportunities to obtain supervised contact hours and clinical competencies required by ASHA for certification in Speech-Language Pathology.",
      []
    ],
    "SHS 481": [
      "Creating and Procuring Accessible Electronic Materials",
      {
        "AD2": [
          "75595",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "McCarthy, M",
                "Rangin, H",
                "Thompson, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "This course examines how people with disabilities are impacted by different technologies and electronic formats. The course will expose you to the building blocks of the web—HTML and CSS—and provide an introduction to multimedia accessibility and document formats including MS Word, PDF, and PowerPoint. The course also explores some of the more challenging areas of accessibility, like maps and emerging media-rich design trends. The course reviews best practices for purchasing and vetting third-party vendors and techniques for conducting usability/accessibility testing for audiences with disabilities.",
      []
    ],
    "SHS 482": [
      "Designing Universally Accessible Web Resources",
      {
        "AD3": [
          "75596",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "McCarthy, M",
                "Thompson, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "This course covers usability and accessibility principles and techniques, including W3C Web Content Accessibility Guidelines (WCAG) 2.1 and WAI Accessible Rich Internet Application (ARIA) techniques. You will learn how HTML5, CSS, and JavaScript interact with web browsers to make content available to assistive technologies, such as screen readers. Throughout the course, you will use assistive technologies and automated tools to understand the accessibility features of HTML5 and ARIA.",
      []
    ],
    "SHS 533": [
      "Approaches to Language Diagnostics and Clinical Reasoning",
      {
        "A": [
          "66832",
          [
            [
              69,
              "R",
              "256 Speech & Hearing Science Bldg",
              53,
              [
                "Dahman, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ],
        "B2": [
          "71706",
          [
            [
              69,
              "T",
              "256 Speech & Hearing Science Bldg",
              53,
              [
                "Dahman, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Advanced study of concepts in evaluation and diagnosis of language disorders in children and adolescents, with a particular emphasis on critical thinking about current assessment methods and the development of clinical reasoning.",
      []
    ],
    "SHS 511": [
      "Assessment and Management of Voice Disorders",
      {
        "P": [
          "51732",
          [
            [
              39,
              "T",
              "256 Speech & Hearing Science Bldg",
              53,
              [
                "Mendes Bahia, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Study of the anatomy, pathophysiology, etiology, acoustics, and perception of abnormal voice production, including foundational skills for assessment, differential diagnosis, and management of voice disorders.",
      []
    ],
    "SHS 534": [
      "Aphasia and Related Disorders",
      {
        "A": [
          "37422",
          [
            [
              39,
              "R",
              "256 Speech & Hearing Science Bldg",
              53,
              [
                "Pucilowski, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Focuses on the advanced study of aphasia, the communication disorders resulting from adult-onset neurological impairments, and adult-onset neurogenic communication disorders (right hemisphere disorder and primary progressive aphasia). The students will engage in critical analysis of the research literature, examination of current theories regarding aphasia and related disorders; evaluation of existing paradigms of diagnosis and intervention.",
      []
    ],
    "SHS 551": [
      "Auditory Electrophysiology I",
      {
        "A": [
          "40391",
          [
            [
              77,
              "W",
              "220 Speech & Hearing Science Bldg",
              53,
              [
                "Mertes, I"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Study of basic electrophysiologic measurements of the auditory system. The course focuses on the auditory brainstem response and includes laboratory experience in electrophysiologic assessments.",
      []
    ],
    "SHS 557": [
      "Advanced Clinical Practicum in Audiological Assessment and Rehabilitation",
      {
        "B": [
          "63715",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Braun, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          16,
          0,
          [],
          -1
        ],
        "C": [
          "54064",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Braun, S",
                "Chesnut, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          16,
          0,
          [],
          -1
        ],
        "E": [
          "54065",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Braun, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          16,
          0,
          [],
          -1
        ]
      },
      [],
      "Supervised assessment and management of patients. Includes audiological evaluation techniques; treatment counseling; hearing aid selection, evaluation, and dispensing; and aural rehabilitation therapy. External placement in a variety of sites is available as well as in the departmental Audiology Clinic.",
      []
    ],
    "SHS 554": [
      "Auditory Electrophysiology II",
      {
        "B": [
          "39053",
          [
            [
              13,
              "W",
              "220 Speech & Hearing Science Bldg",
              53,
              [
                "Mertes, I"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Study of advanced electrophysiologic assessment of the auditory system. Includes electrophysiologic responses from cochlea to cortex. Also includes physiologic assessments such as wideband acoustic immittance and otoacoustic emissions.",
      []
    ],
    "SHS 565": [
      "Teaching in the Professoriate",
      {
        "A": [
          "77993",
          [
            [
              163,
              "T",
              "209 Huff Hall",
              48,
              [
                "Gobin, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as HK 562 and RST 560. See HK 562.",
      []
    ],
    "SHS 574": [
      "Communication in Individuals with Autism Spectrum Disorders",
      {
        "ASD": [
          "74209",
          [
            [
              52,
              "R",
              "110 Speech & Hearing Science Bldg",
              53,
              [
                "Sone, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "This is a graduate-level course on foundational issues in autism spectrum disorder (ASD) for speech-language pathologists and other professionals. It is intended to prepare them to understand this neurodevelopmental disorder and serve this unique population as key team members in assessment and intervention. Ninety percent of school-based professionals serve students with ASD. Content areas include diagnostic criteria (signs & symptoms), etiology, language and communication patterns, assessment, and interventions for individuals with ASD.",
      []
    ],
    "SHS 575": [
      "School Methods in Speech-Language Pathology",
      {
        "C": [
          "43555",
          [
            [
              13,
              "M",
              "147 Armory",
              30,
              [
                "Burie, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Study of methods and materials used in the schools by the speech-language pathologist.",
      []
    ],
    "SHS 578": [
      "Medical Methods in Speech-Language Pathology",
      {
        "MSP": [
          "73459",
          [
            [
              30,
              "TR",
              "110 Speech & Hearing Science Bldg",
              53,
              [
                "Bauer Malandraki, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Covers the interprofessional nature of rehabilitation and case management in medical settings for speech-language pathologists. It includes case management/studies and common policies of medical settings. Ethics, principles of documentation, and introduction to Medicare and other payor sources will be reviewed. The course discusses the treatment of common conditions faced by speech-language pathologists in medical settings across the lifespan.",
      []
    ],
    "SHS 576": [
      "School Intrnshp Spch-Lang Path",
      {
        "D": [
          "40682",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Dahman, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          11,
          0,
          [],
          -1
        ]
      },
      [],
      "The student is assigned to a school-based speech-language pathologist for a practical learning experience in P-12 schools full-time for 8-16 weeks. The student is expected to apply knowledge learned in the academic and clinical portions of their program to the entire school caseload by the end of this experience.",
      []
    ],
    "SHS 577": [
      "Advanced Practicum in Speech-Language Pathology",
      {
        "BRU": [
          "37455",
          [
            [
              14,
              "M",
              "110 Speech & Hearing Science Bldg",
              53,
              [
                "Mendes, C"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "M",
              "ONLINE",
              0,
              [
                "Mendes, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          11,
          0,
          [],
          -1
        ],
        "BUR": [
          "53323",
          [
            [
              14,
              "M",
              "110 Speech & Hearing Science Bldg",
              53,
              [
                "Mendes, C"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "M",
              "ONLINE",
              0,
              [
                "Mendes, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          11,
          0,
          [],
          -1
        ],
        "DAH": [
          "37448",
          [
            [
              14,
              "M",
              "110 Speech & Hearing Science Bldg",
              53,
              [
                "Mendes, C"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "M",
              "ONLINE",
              0,
              [
                "Mendes, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          11,
          0,
          [],
          -1
        ],
        "FRA": [
          "37446",
          [
            [
              14,
              "M",
              "110 Speech & Hearing Science Bldg",
              53,
              [
                "Mendes, C"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "M",
              "ONLINE",
              0,
              [
                "Mendes, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          11,
          0,
          [],
          -1
        ],
        "HOL": [
          "59413",
          [
            [
              14,
              "M",
              "110 Speech & Hearing Science Bldg",
              53,
              [
                "Mendes, C"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "M",
              "ONLINE",
              0,
              [
                "Mendes, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          11,
          0,
          [],
          -1
        ],
        "MEN": [
          "52167",
          [
            [
              14,
              "M",
              "110 Speech & Hearing Science Bldg",
              53,
              [
                "Mendes, C"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "M",
              "ONLINE",
              0,
              [
                "Mendes, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          11,
          0,
          [],
          -1
        ],
        "MIN": [
          "37452",
          [
            [
              14,
              "M",
              "110 Speech & Hearing Science Bldg",
              53,
              [
                "Mendes, C"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "M",
              "ONLINE",
              0,
              [
                "Mendes, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          11,
          0,
          [],
          -1
        ],
        "X": [
          "65924",
          [
            [
              14,
              "M",
              "110 Speech & Hearing Science Bldg",
              53,
              [
                "Mendes, C"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "M",
              "ONLINE",
              0,
              [
                "Mendes, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          11,
          0,
          [],
          -1
        ]
      },
      [],
      "A mentored experience in which students are paired with a clinical instructor in SHS and provided opportunities to assist and take leadership roles in the ongoing management of clinical cases in a variety of settings. The advanced practicum is designed for students with more than a year of supervised clinical experience (i.e., more than 100 contact hours as defined by the American Speech-Language and Hearing Association - ASHA). Working within a clinical team, the advanced practicum will provide students with: 1) supported opportunities to assist in all aspects of clinical practice (e.g., diagnosis, intervention, documentation, team meetings/planning); 2) take lead clinician and/or case management roles for some cases; 3) opportunities to obtain supervised contact hours and clinical competencies required by the ASHA for certification in Speech-Language Pathology.",
      []
    ],
    "SHS 580": [
      "Cochlear Implants",
      {
        "A": [
          "51011",
          [
            [
              13,
              "M",
              "111 Speech & Hearing Science Bldg",
              53,
              [
                "Aronoff, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Focuses on current cochlear implant technologies, principles of evidence-based practice of cochlear implant assessment and intervention by audiologists and speech-language pathologists, and empirical outcomes for children and adults.",
      []
    ],
    "SHS 592": [
      "Prosem Spch & Hear Sci",
      {
        "A": [
          "37467",
          [
            [
              14,
              "F",
              "1090 Lincoln Hall",
              19,
              [
                "Mudar, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          5,
          0,
          [],
          -1
        ],
        "B": [
          "61231",
          [
            [
              15,
              "F",
              "111 Speech & Hearing Science Bldg",
              53,
              [
                "Mudar, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Required seminar for all graduate students; involves reporting of ongoing research of faculty, visiting researchers, and students as well as discussion of topics related to professional and academic research careers.",
      []
    ],
    "SHS 582": [
      "Speech Communication, Aging, and Aural Rehabilitation",
      {
        "A": [
          "77739",
          [
            [
              80,
              "M",
              "Location Pending",
              0,
              [
                "Fogerty, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Advanced seminar investigating theoretical, empirical, and clinical research on aging and speech communication from peripheral to cognitive factors. Bridges research to clinical practice in rehabilitation for adults with hearing loss.",
      []
    ],
    "SHS 588": [
      "Adv Sem Neural Bases Com Dis",
      {
        "A": [
          "65549",
          [
            [
              69,
              "W",
              "111 Speech & Hearing Science Bldg",
              53,
              [
                "Bottalico, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Study of theoretical and empirical research in the neural bases of speech, language, hearing, cognitive, and/or swallowing disorders in pediatric and adult populations. Students will critically analyze and interpret the extant literature; lead seminar discussions and write scholarly reviews; and/or design original research projects. Specific topics will vary and be announced in the Class Schedule.",
      []
    ],
    "SHS 590": [
      "History of CSD",
      {
        "A": [
          "63810",
          [
            [
              53,
              "TR",
              "111 Speech & Hearing Science Bldg",
              53,
              [
                "Hadley, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "This doctoral seminar explores the evolution of the field of Communication Sciences and Disorders (CSD) by examining: 1) the historical research base of the field; 2) critical research and practice issues that have emerged across the history of field; and 3) the contributions of key figures in the field. The course is designed to help students understand how the discipline has been organized and where their own research interests fit with the respect to the history of the discipline.",
      []
    ],
    "SHS 591": [
      "Clinical Case Project in Communication Sciences and Disorders",
      {
        "A": [
          "74210",
          [
            [
              26,
              "T",
              "110 Speech & Hearing Science Bldg",
              53,
              [
                "Mudar, R",
                "Pucilowski, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          0,
          15,
          0,
          [],
          -1
        ]
      },
      [],
      "Students will complete a summative individual clinical case project to evaluate the student’s attained knowledge required to assess and treat individuals with communication disorders and apply that knowledge to authentic, clinically relevant situations.",
      []
    ],
    "SHS 593": [
      "Special Problems",
      {
        "": [
          "10179",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          4,
          0,
          [],
          -1
        ],
        "VC1": [
          "39454",
          [
            [
              4,
              "TR",
              "213 Gregory Hall",
              5,
              [
                "Bottalico, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Investigative projects in speech and hearing not including theses.",
      []
    ],
    "SHS 594": [
      "PhD Early Research Project",
      {
        "": [
          "71408",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "This mentored research experience provides individualized opportunities for PhD students to conduct research projects under the direction of their faculty mentors/advisors.",
      []
    ],
    "SHS 595": [
      "Audiology Clinical Practicum Full-Time Externship",
      {
        "A": [
          "74211",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Braun, S",
                "Chesnut, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          5,
          6,
          0,
          [],
          -1
        ]
      },
      [],
      "Advanced supervised assessment and management of patients in a full-time audiology externship. Includes audiological evaluation techniques; treatment counseling; amplification selection, evaluation, and dispensing; and aural rehabilitation.",
      []
    ]
  },
  "caches": {
    "periods": [
      "1300 - 1540",
      "1400 - 1520",
      "1100 - 1220",
      "0000 - 0000",
      "1530 - 1650",
      "0930 - 1210",
      "1400 - 1640",
      "0900 - 1140",
      "1600 - 1840",
      "1700 - 1940",
      "1400 - 1700",
      "1700 - 1820",
      "1130 - 1250",
      "0900 - 1150",
      "1200 - 1250",
      "1300 - 1350",
      "1230 - 1350",
      "1000 - 1050",
      "0900 - 1020",
      "0800 - 0850",
      "0900 - 0950",
      "0930 - 1050",
      "1100 - 1150",
      "1030 - 1150",
      "1400 - 1450",
      "1500 - 1550",
      "1600 - 1650",
      "1200 - 1320",
      "1500 - 1620",
      "1630 - 1750",
      "1400 - 1550",
      "1600 - 1750",
      "1930 - 2050",
      "1300 - 1420",
      "0930 - 1020",
      "0800 - 0920",
      "1700 - 1950",
      "1100 - 1250",
      "1700 - 1750",
      "0800 - 1050",
      "1530 - 1820",
      "1300 - 1550",
      "0930 - 1220",
      "1830 - 2020",
      "1500 - 1650",
      "1400 - 1720",
      "0900 - 1220",
      "1300 - 1620",
      "1100 - 1450",
      "1500 - 1850",
      "1200 - 1450",
      "1400 - 1650",
      "1600 - 1850",
      "0900 - 1050",
      "1000 - 1150",
      "1000 - 1120",
      "0800 - 0950",
      "0800 - 1150",
      "1300 - 1520",
      "1530 - 1645",
      "1100 - 1215",
      "1400 - 1515",
      "1700 - 1815",
      "1830 - 1945",
      "0930 - 1045",
      "1230 - 1345",
      "1530 - 1620",
      "1630 - 1720",
      "1600 - 1740",
      "1200 - 1350",
      "1800 - 1950",
      "1330 - 1450",
      "1300 - 1450",
      "1600 - 1720",
      "1830 - 1950",
      "1300 - 1750",
      "1700 - 1850",
      "1300 - 1650",
      "1230 - 1320",
      "1900 - 2050",
      "1530 - 1720",
      "1800 - 2100",
      "1800 - 2050",
      "0900 - 1120",
      "1800 - 1920",
      "1630 - 1920",
      "1200 - 1650",
      "1100 - 1330",
      "0930 - 1200",
      "1530 - 1800",
      "1000 - 2000",
      "1200 - 1550",
      "1300 - 1430",
      "1830 - 2130",
      "1600 - 1700",
      "1430 - 1550",
      "1830 - 2100",
      "1630 - 1745",
      "1630 - 1730",
      "1000 - 1250",
      "1600 - 1715",
      "1730 - 1845",
      "1700 - 1800",
      "1300 - 1415",
      "1500 - 1720",
      "1300 - 1600",
      "1400 - 1630",
      "1000 - 1220",
      "1430 - 1820",
      "1500 - 1700",
      "0900 - 1030",
      "1430 - 1630",
      "1035 - 1150",
      "1700 - 1900",
      "1400 - 1620",
      "1450 - 1735",
      "1145 - 1305",
      "1530 - 1750",
      "1500 - 1750",
      "1100 - 1350",
      "0830 - 0950",
      "1100 - 1230",
      "1600 - 1800",
      "1800 - 2000",
      "1900 - 1930",
      "0730 - 1530",
      "1530 - 1550",
      "1000 - 1700",
      "1600 - 1730",
      "1730 - 1850",
      "1630 - 1800",
      "1100 - 1320",
      "1230 - 1430",
      "1500 - 1730",
      "1200 - 1430",
      "1000 - 1200",
      "1700 - 2000",
      "1730 - 2030",
      "1730 - 2020",
      "0900 - 1200",
      "1730 - 2130",
      "0900 - 1600",
      "1900 - 2200",
      "1900 - 1950",
      "1500 - 1615",
      "0800 - 1220",
      "1700 - 1920",
      "1630 - 1910",
      "1600 - 2050",
      "0830 - 1350",
      "0930 - 1040",
      "1500 - 1600",
      "1600 - 1820",
      "0900 - 1145",
      "1300 - 1545",
      "1230 - 1520",
      "1430 - 1620",
      "1010 - 1100",
      "1115 - 1205",
      "1230 - 1420",
      "1800 - 1850",
      "1800 - 2020",
      "0830 - 1120",
      "1530 - 1710",
      "1900 - 2020",
      "1900 - 2030",
      "1000 - 1130",
      "1000 - 1100",
      "0800 - 0940",
      "0900 - 1040",
      "1200 - 1340",
      "1000 - 1115",
      "1330 - 1620",
      "0930 - 1120",
      "1130 - 1320",
      "1030 - 1120",
      "1430 - 1520",
      "1130 - 1220",
      "1330 - 1445",
      "1200 - 1259",
      "1030 - 1145",
      "1330 - 1520",
      "1430 - 1545",
      "0900 - 1015",
      "1330 - 1420",
      "1325 - 1445",
      "1715 - 1830",
      "1729 - 1920",
      "0830 - 1020",
      "1500 - 1659",
      "1300 - 1459",
      "0850 - 1020",
      "1730 - 1930",
      "1330 - 1535",
      "0930 - 1135",
      "1700 - 1930",
      "0900 - 1159",
      "0930 - 1130",
      "0930 - 1129",
      "0915 - 1159",
      "1600 - 1859",
      "1600 - 1810",
      "1700 - 1859",
      "1500 - 1629",
      "1800 - 1915",
      "1600 - 1759",
      "1330 - 1615",
      "1500 - 1555",
      "1330 - 1559",
      "1330 - 1640",
      "1330 - 1630",
      "1345 - 1645",
      "1630 - 1820",
      "1730 - 1920",
      "0900 - 1700",
      "0900 - 1035",
      "1325 - 1450",
      "1500 - 1745",
      "1500 - 1729",
      "1501 - 1745",
      "1330 - 1429",
      "1745 - 1925",
      "1800 - 2005",
      "1740 - 2000",
      "1700 - 1830",
      "1330 - 1529",
      "1000 - 1159",
      "1030 - 1159",
      "1700 - 1910",
      "1010 - 1125",
      "0900 - 1000",
      "0800 - 1030",
      "1830 - 2030",
      "1200 - 1330",
      "1800 - 1930",
      "1320 - 1450",
      "1400 - 1750",
      "0900 - 1250",
      "1000 - 1350",
      "1330 - 1500",
      "0600 - 0720",
      "0800 - 0930",
      "1830 - 2050",
      "1100 - 1300",
      "1730 - 1820",
      "0930 - 1100",
      "1400 - 1530",
      "1500 - 1630",
      "1730 - 1900",
      "1930 - 2130",
      "1000 - 1300",
      "1900 - 2150",
      "1200 - 1300",
      "1700 - 2050",
      "1800 - 1900",
      "0900 - 1300",
      "1900 - 2100",
      "0600 - 0750",
      "1200 - 1315",
      "1100 - 1200",
      "1400 - 1600",
      "1430 - 1530",
      "2000 - 2050",
      "1130 - 1300",
      "0930 - 1150",
      "1330 - 1550",
      "0900 - 1130",
      "0800 - 0915",
      "1800 - 2030",
      "1400 - 1540",
      "1200 - 1420",
      "1500 - 1800"
    ],
    "dateRanges": [],
    "scheduleTypes": [
      "Laboratory",
      "Online Lecture",
      "Lecture",
      "Online",
      "Independent Study",
      "Lecture-Discussion",
      "Internship",
      "Studio",
      "Travel",
      "Conference",
      "Seminar",
      "Discussion/ Recitation",
      "Online Discussion",
      "Online Lab",
      "Laboratory-Discussion",
      "Research",
      "Practice",
      "Study Abroad",
      "Quiz",
      "Online Lecture Discussion",
      "Packaged Section"
    ],
    "campuses": [],
    "attributes": [],
    "restrictions": [],
    "gradeBases": [],
    "locations": [
      {
        "lat": null,
        "long": null
      },
      {
        "lat": 40.106778040727896,
        "long": -88.2194617156191
      },
      {
        "lat": 40.11171215875622,
        "long": -88.22530849701589
      },
      {
        "lat": 40.107534,
        "long": -88.2281548
      },
      {
        "lat": 40.110811306674734,
        "long": -88.2248467072371
      },
      {
        "lat": 40.105732,
        "long": -88.2281018
      },
      {
        "lat": 40.1083446,
        "long": -88.2282555
      },
      {
        "lat": 40.1131317,
        "long": -88.2264552
      },
      {
        "lat": 40.1020773,
        "long": -88.2296394
      },
      {
        "lat": 40.11246109008789,
        "long": -88.22831726074219
      },
      {
        "lat": 40.11380515934119,
        "long": -88.22490788390387
      },
      {
        "lat": 40.108419421661715,
        "long": -88.2261156301609
      },
      {
        "lat": 40.1072225,
        "long": -88.2262016
      },
      {
        "lat": 40.1110937,
        "long": -88.2232348
      },
      {
        "lat": 40.103587,
        "long": -88.230606
      },
      {
        "lat": 40.1108856,
        "long": -88.2269806
      },
      {
        "lat": 40.1109722,
        "long": -88.2282631
      },
      {
        "lat": 40.107811,
        "long": -88.2260761
      },
      {
        "lat": 40.10944320239664,
        "long": -88.22602522743233
      },
      {
        "lat": 40.1065684,
        "long": -88.2281746
      },
      {
        "lat": 40.10628,
        "long": -88.22621
      },
      {
        "lat": 40.105587640130146,
        "long": -88.22025111416733
      },
      {
        "lat": 40.103620555545135,
        "long": -88.22982720445013
      },
      {
        "lat": 40.1035872,
        "long": -88.2306061
      },
      {
        "lat": 40.10593795776367,
        "long": -88.2270736694336
      },
      {
        "lat": 40.10755766472843,
        "long": -88.22995430218522
      },
      {
        "lat": 40.102726858556835,
        "long": -88.23259991223857
      },
      {
        "lat": 40.101862,
        "long": -88.231737
      },
      {
        "lat": 40.1149296,
        "long": -88.2280589
      },
      {
        "lat": 40.108570819242026,
        "long": -88.22518453938676
      },
      {
        "lat": 40.1047599,
        "long": -88.2319514
      },
      {
        "lat": 40.092875494224195,
        "long": -88.22082220247309
      },
      {
        "lat": 40.11397164321797,
        "long": -88.2265192685827
      },
      {
        "lat": 40.104794,
        "long": -88.224264
      },
      {
        "lat": 40.10783362157985,
        "long": -88.22476189569741
      },
      {
        "lat": 40.111691,
        "long": -88.2242511
      },
      {
        "lat": 40.1035833,
        "long": -88.228405
      },
      {
        "lat": 40.1033599,
        "long": -88.2292111
      },
      {
        "lat": 40.103627234541904,
        "long": -88.22601765311099
      },
      {
        "lat": 40.10127390836906,
        "long": -88.2226073524728
      },
      {
        "lat": 40.0995003,
        "long": -88.223104
      },
      {
        "lat": 40.11085653938169,
        "long": -88.22609810215927
      },
      {
        "lat": 40.1149521,
        "long": -88.2267561
      },
      {
        "lat": 40.10802885201532,
        "long": -88.22239700364068
      },
      {
        "lat": 40.11180304465921,
        "long": -88.22613003543475
      },
      {
        "lat": 40.1022093629303,
        "long": -88.22800864058527
      },
      {
        "lat": 40.10623714823253,
        "long": -88.2232659093846
      },
      {
        "lat": 40.10039170750639,
        "long": -88.21813070187608
      },
      {
        "lat": 40.1034533,
        "long": -88.2327596
      },
      {
        "lat": 40.1028373,
        "long": -88.2251326
      },
      {
        "lat": 40.1048704,
        "long": -88.2229036
      },
      {
        "lat": 40.10099,
        "long": -88.23159
      },
      {
        "lat": 40.1116416,
        "long": -88.2248868
      },
      {
        "lat": 40.10764262805109,
        "long": -88.23074052515514
      }
    ],
    "finalDates": [],
    "finalTimes": []
  }
}