{
  "subject": "SOCW",
  "scrapedAt": 1768450888001,
  "courseCount": 56,
  "courses": {
    "SOCW 299": [
      "Study Abroad",
      {
        "A": [
          "62708",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          18,
          17,
          0,
          [],
          -1
        ]
      },
      [],
      "Lectures, seminars, and practical work in an approved study-abroad program in Social Work appropriate to the student's course of study.",
      []
    ],
    "SOCW 240": [
      "Death & Dying",
      {
        "A": [
          "63536",
          [
            [
              61,
              "TR",
              "119 English Building",
              3,
              [
                "Shelton, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ],
        "CHP": [
          "78034",
          [
            [
              61,
              "MW",
              "212 David Kinley Hall",
              36,
              [
                "Andrade, F"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "This course will focus on various aspects of death and dying. Content will examine different types of death, impact of death throughout the lifespan, cultural beliefs and practices regarding death and dying, grief, healing after loss, legal and ethical issues related to death, and the roll of social workers at the end of life. Students will be encouraged to examine their own thoughts, values, feeling, and beliefs about death and dying.",
      []
    ],
    "SOCW 225": [
      "Social Work Statistics",
      {
        "A": [
          "59513",
          [
            [
              103,
              "MW",
              "2027 1010 W Nevada",
              0,
              [
                "Garthe, R",
                "Nag, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduction of basic concepts in statistics with emphasis on the application of statistical methods in social work research. Topics include: descriptive statistics, probability theory and distributions, point and interval estimation, hypothesis testing, central tendency, variability, independence, contrasts, correlation and regression, non-parametrics, concepts of levels of measurements, and statistical vs. practical significance. Priority will be given to Social Work majors.",
      []
    ],
    "SOCW 235": [
      "The Science of Youth Violence Prevention",
      {
        "A": [
          "78010",
          [
            [
              144,
              "MW",
              "2027 1010 W Nevada",
              0,
              [
                "Garthe, R",
                "Nag, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Introduction to the scientific research and practices of preventing youth violence. Topics include conceptual and theoretical models of violence, principles of prevention science and evaluation methods, and the assessments, data, programs, and research across forms of youth violence (bullying, dating violence/intimate partner violence, sexual violence, community violence). Students will learn how to critically evaluate research and evidence-based practices to assess the development and impact of violence prevention efforts.",
      []
    ],
    "SOCW 200": [
      "Introduction to Social Work",
      {
        "A": [
          "32827",
          [
            [
              64,
              "TR",
              "2027 1010 W Nevada",
              0,
              [
                "Earls Larrison, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ],
        "B": [
          "32828",
          [
            [
              65,
              "TR",
              "2027 1010 W Nevada",
              0,
              [
                "Earls Larrison, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ],
        "C": [
          "50351",
          [
            [
              100,
              "MW",
              "169 Davenport Hall",
              12,
              [
                "Keaton, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ],
        "D": [
          "77096",
          [
            [
              100,
              "TR",
              "2018 1010 W Nevada",
              0,
              [
                "Earls Larrison, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Broad survey of the field of social work; introduction to social services, social welfare organizations, major social problems and target population groups, and the methods used in working with individuals, groups, and communities; includes the range of personnel and skills in social work agencies, and the means of education and training for social work professionals.",
      []
    ],
    "SOCW 199": [
      "Undergraduate Open Seminar",
      {
        "": [
          "10059",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Approved for letter and S/U grading. May be repeated.",
      []
    ],
    "SOCW 297": [
      "Asian Families in America",
      {
        "A": [
          "62095",
          [
            [
              100,
              "TR",
              "2030 1010 W Nevada",
              0,
              [
                "Balgopal, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ],
        "B": [
          "73010",
          [
            [
              64,
              "TR",
              "137 Armory",
              30,
              [
                "Chih, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Offers a comparative analysis of Asian families as they cope and adapt to American society. Examines: 1) how families from four major Asian-American groups (Chinese, Indian, Japanese and Korean) function in American society; 2) how these families compare to families in their country of origin; and 3) how these families are similar to or different from the 'typical American' family. Includes visits to Asian cultural institutions and with Asian families.",
      []
    ],
    "SOCW 321": [
      "Social Entre & Social Change",
      {
        "A": [
          "65409",
          [
            [
              60,
              "TR",
              "ONLINE",
              0,
              [
                "Laursen, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Intended for undergraduates who have an interest in creating programs and products that have social values for communities. Features social entrepreneurship as an approach to social development and will consider its application and related change strategies to a wide array of social problems. Social entrepreneurship has emerged as a change approach that features the application of entrepreneurial practices to social ventures. Social entrepreneurship is similar to business entrepreneurship in its emphasis on selected program development and management principles and processes, but social entrepreneurs have the primary goal of creating social value in communities rather than personal or shareholder wealth. The initial part of the class will emphasize instructing students in broad concepts and principles related to entrepreneurship, while the latter portion of the course will feature students working on teams to design social projects.",
      []
    ],
    "SOCW 310": [
      "UG Research Assistance",
      {
        "": [
          "62041",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Assist departmental faculty in on-going research. Topics and nature of assistance vary. Capstone paper required.",
      []
    ],
    "SOCW 300": [
      "Diversity: Identities & Issues",
      {
        "A": [
          "58396",
          [
            [
              60,
              "TR",
              "2027 1010 W Nevada",
              0,
              [
                "Coy, A",
                "Watkins, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ],
        "B": [
          "52693",
          [
            [
              183,
              "TR",
              "2019 1010 W Nevada",
              0,
              [
                "Watkins, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ],
        "C": [
          "72697",
          [
            [
              144,
              "MW",
              "31 Psychology Building",
              25,
              [
                "Coy, A",
                "Prather, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "This introductory course explores multiple dimensions of diversity in a pluralistic and increasingly globalized society. Using a social work strengths perspective as well as historical, constructivist, and critical conceptual frameworks; the course examines issues of identity, culture, privilege stigma, prejudice, and discrimination. The social construction and implications of race, class, gender, sexual orientation, and other dimensions of difference is examined at individual, interpersonal, and systems levels. Students are expected to use the course material to explore their personal values, biases, family backgrounds, culture, and formative experiences in order to deepen their self-awareness and develop interpersonal skills in bridging differences. Finally, students apply learning from the course to identify characteristics of effective social work and other health and human service provision among people culturally different themselves; and to identify opportunities for change contributing to prejudice reduction and cross-cultural acceptance at home, work and in society.",
      []
    ],
    "SOCW 401": [
      "Practice I",
      {
        "A": [
          "57395",
          [
            [
              54,
              "MW",
              "2018 1010 W Nevada",
              0,
              [
                "Wilson Smith, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ],
        "B": [
          "77097",
          [
            [
              30,
              "TR",
              "2030 1010 W Nevada",
              0,
              [
                "Wilson Smith, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Overview of generalist social work practice with individuals, families, groups, organizations, and communities. Designed to introduce core concepts, values, and ethical principles of the profession as well as to provide basic skills, and knowledge related to generalist social work practice with a broad array of client systems. Emphasis is give to the biological-psychological-social-spiritual framework, person-in-environment, strengths perspective, and system theory. Skills in developing beginning professional relationships, which are characterized by mutuality, collaboration, empowerment, and client self determination within the problem-solving process are addressed.",
      []
    ],
    "SOCW 370": [
      "Social Work and Disability Studies",
      {
        "A": [
          "69043",
          [
            [
              60,
              "R",
              "2030 1010 W Nevada",
              0,
              [
                "Wilson Smith, C"
              ],
              -1,
              -1,
              -1
            ],
            [
              60,
              "T",
              "ONLINE",
              0,
              [
                "Wilson Smith, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ],
        "I": [
          "75955",
          [
            [
              273,
              "R",
              "ONLINE",
              0,
              [
                "Curtin, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "This course provides a foundation for generalist practice and promotes social justice, inclusion, and ability when working with all people. Skills and knowledge will be gained to help empower individuals with disabilities and to intervene in various systems to ameliorate bias. The course examines key policies, historic legislation, service delivery, education, and social issues that impact individuals with disabilities. Through projects and assignments completed in-class and in the community, students will learn about the varying abilities and strengths of people with a variety of different needs. Applications of social work values and ethics are stressed in relation to working with people with disabilities.",
      []
    ],
    "SOCW 402": [
      "Practice II",
      {
        "A": [
          "55520",
          [
            [
              64,
              "MW",
              "2030 1010 W Nevada",
              0,
              [
                "Hensold, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ],
        "B": [
          "64356",
          [
            [
              60,
              "TR",
              "2019 1010 W Nevada",
              0,
              [
                "Hensold, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ],
        "C": [
          "55522",
          [
            [
              59,
              "TR",
              "2027 1010 W Nevada",
              0,
              [
                "Perepa, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ],
        "I": [
          "72534",
          [
            [
              234,
              "M",
              "ONLINE",
              0,
              [
                "Cintron, V"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Provides students with culturally responsive, micro-level skills development for working with and on behalf of individuals, families, and groups. Builds on the basic helping skills learned in SOCW 401 and offers further practice on interviewing skills, more emphasis on ethical decision-making, assessment, and intervention, evaluation applied to individuals, families, and groups.",
      []
    ],
    "SOCW 330": [
      "International Perspectives",
      {
        "A": [
          "61158",
          [
            [
              73,
              "T",
              "ONLINE",
              0,
              [
                "Smith, D"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "F",
              "ONLINE",
              0,
              [
                "Smith, D"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "MTWRFSU",
              "ONLINE",
              0,
              [
                "Smith, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          6,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "This course provides cross-cultural learning experiences within the context of international community-based service learning. Students will explore human service delivery through direct involvement with international social service institutions. This cultural immersion course is a collaborative partnership between the University of Illinois School of Social Work and selected international universities. Countries visited, varies by semester.",
      []
    ],
    "SOCW 360": [
      "Social Work and the Military",
      {
        "A": [
          "60166",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Adkins, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ],
        "B": [
          "78037",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Adkins, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "This course provides an overview of military social work practice including: military culture, issues and needs of soldiers and their families, ethical considerations, and the roll of social workers.",
      []
    ],
    "SOCW 322": [
      "Sexual Health and Social Work",
      {
        "A": [
          "78035",
          [
            [
              65,
              "TR",
              "2101 1010 W Nevada",
              0,
              [
                "Moore, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Examination of sexuality topics from social work perspectives, embracing sexuality as a human right using the reproductive justice framework. We will learn how to incorporate a sex positive and strengths-based perspective with a focus on the application of social work skills, theories, and values to integrate sexuality into the practice of social work.",
      []
    ],
    "SOCW 404": [
      "Social Work Case Management Practice",
      {
        "I": [
          "70618",
          [
            [
              273,
              "W",
              "ONLINE",
              0,
              [
                "Wilson Smith, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "This course builds upon and extends generalist social work theories, knowledge and clinical skills required for case management practice. Content focuses on inter-professional collaborative team-based approaches for patient/client assessment, care planning, service delivery coordination, and evaluating outcomes. Emphasis is on organizational context, theoretical models, social work roles, culturally sensitive approaches, biopsychosocial assessments, triage, advocacy, interdisciplinary and inter-organizational collaboration and record keeping.",
      []
    ],
    "SOCW 410": [
      "Social Welfare Pol and Svcs",
      {
        "A": [
          "66054",
          [
            [
              65,
              "TR",
              "2030 1010 W Nevada",
              0,
              [
                "Cho, H"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ],
        "B": [
          "58705",
          [
            [
              61,
              "MW",
              "2030 1010 W Nevada",
              0,
              [
                "Sanabria Veaz, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ],
        "C": [
          "78038",
          [
            [
              60,
              "MW",
              "2030 1010 W Nevada",
              0,
              [
                "Anderson, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Examination of social welfare within a historical context, addressing the economic, political, social and ideological influences that have shaped the social welfare system and programs. Critical study of the income maintenance system in the United States as a response to the problems of inequality of opportunity and income, poverty, and income security; consideration of alternative approaches with discussion of the social worker's role in the system.",
      []
    ],
    "SOCW 403": [
      "Practice III",
      {
        "A": [
          "57400",
          [
            [
              64,
              "TR",
              "2030 1010 W Nevada",
              0,
              [
                "Miller, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ],
        "B": [
          "77099",
          [
            [
              64,
              "MW",
              "2027 1010 W Nevada",
              0,
              [
                "Tan, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ],
        "I": [
          "78054",
          [
            [
              234,
              "R",
              "ONLINE",
              0,
              [
                "Candler, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Provides knowledge and skills about the theory and practice of planned change in communities and organizations using a generalist model of social work practice. Builds on the foundation knowledge and skills gained in SOCW 401 with emphasis on assessment, planning, intervention, and evaluation skills for macro-level practice.",
      []
    ],
    "SOCW 412": [
      "Social Work with Latine",
      {
        "A": [
          "58707",
          [
            [
              234,
              "R",
              "ONLINE",
              0,
              [
                "Cintron, V"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Students will gain cross-cultural knowledge and awareness of the diversity of cultures within the Latine population, as well as the issues that impact these communities, including historical patterns of immigration and oppression, socioeconomic disparities, documented status, and complex racial and ethnic identities. Students will also learn about models and theoretical principles of social work practice with Latine and explore the challenges and opportunities in providing social services to Latine individuals, families, and communities. For graduate credit, students must participate in a community service-learning project, supporting a community organization that serves Latine clients to gain hands-on experience and contribute to community betterment.",
      []
    ],
    "SOCW 416": [
      "Child Welfare Issues & Trends",
      {
        "A": [
          "60167",
          [
            [
              33,
              "R",
              "2018 1010 W Nevada",
              0,
              [
                "Large, D"
              ],
              -1,
              -1,
              -1
            ],
            [
              33,
              "T",
              "ONLINE",
              0,
              [
                "Large, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "This course examines theoretical and programmatic aspects for child welfare practice. Emphasis is placed on the roles and functions of child welfare workers, including engagement, assessment, intervention and permanency planning.",
      []
    ],
    "SOCW 461": [
      "Professional Practice Seminar I",
      {
        "A": [
          "58704",
          [
            [
              109,
              "R",
              "Location Pending",
              0,
              [
                "Faulkner, S"
              ],
              -1,
              -1,
              -1
            ],
            [
              274,
              "T",
              "2101 1010 W Nevada",
              0,
              [
                "Faulkner, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ],
        "B": [
          "77100",
          [
            [
              272,
              "W",
              "Location Pending",
              0,
              [
                "Munoz-Najar, J"
              ],
              -1,
              -1,
              -1
            ],
            [
              275,
              "M",
              "2019 1010 W Nevada",
              0,
              [
                "Munoz-Najar, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          0,
          0,
          [],
          -1
        ],
        "I": [
          "74878",
          [
            [
              276,
              "T",
              "ONLINE",
              0,
              [
                "Stauffer, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "The goal of this course is to begin the process of integrating all the foundation knowledge of generalist social work that students have learned and begin applying it to real life situations. Students will complete a portfolio and a service learning experience that will help them being to make the connection between the core competencies, theories and applications to real life experiences. During this course students will begin the process of being matched with the agency where they will serve their internship during the last semester of their senior year.",
      []
    ],
    "SOCW 451": [
      "HBSE I: Human Development",
      {
        "A": [
          "32837",
          [
            [
              59,
              "MW",
              "2030 1010 W Nevada",
              0,
              [
                "Yang, F"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ],
        "B": [
          "55701",
          [
            [
              65,
              "MW",
              "2030 1010 W Nevada",
              0,
              [
                "Kim, H"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ],
        "I": [
          "74877",
          [
            [
              234,
              "R",
              "ONLINE",
              0,
              [
                "Yang, F"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Examination of the major theories that inform social work's understanding of human behavior in a variety of social contexts. A bio-ecological systems framework, together with a developmental approach in understanding the ways in which individuals, families, groups, organizations, institutions, and communities interact, is presented. Issues of gender, race, ethnicity, socioeconomic status, disability and sexual orientation are introduced so students can gain understanding of how these components affect and influence development across the lifespan.",
      []
    ],
    "SOCW 456": [
      "Philanthropy & Social Justice",
      {
        "A": [
          "75151",
          [
            [
              123,
              "M",
              "2019 1010 W Nevada",
              0,
              [
                "Iverson, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ],
        "ONL": [
          "76130",
          [
            [
              123,
              "M",
              "ONLINE",
              0,
              [
                "Iverson, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Explores the important dimensions of human service organization fundraising, grant writing, and philanthropy relevant to social work leadership and critically examines these topics in relation to social change, power, privilege, and social movements. Students will practice the skills and approaches necessary to fulfill the fundraising responsibilities of a nonprofit leader or services provider, including grant writing, data mining, storytelling, donor cultivation, and legal requirements and ethical considerations.",
      []
    ],
    "SOCW 427": [
      "Social Work Research Methods",
      {
        "A": [
          "32836",
          [
            [
              60,
              "MW",
              "2027 1010 W Nevada",
              0,
              [
                "Fleming, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ],
        "B": [
          "78039",
          [
            [
              61,
              "TR",
              "2027 1010 W Nevada",
              0,
              [
                "Fleming, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ],
        "I": [
          "55718",
          [
            [
              234,
              "W",
              "ONLINE",
              0,
              [
                "Zhan, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Basic principles of social science research and importance for social work practice: overview of research principles including the stages of a research project, design of research; quantitative and qualitative methodologies, design of questionnaires, methods of data collection and preparation of reports. Introduction to various research designs such as the survey, program evaluation, single subject design, quasi-experiments, and experimental design. Enrollment preference given to students in the MSW program.",
      []
    ],
    "SOCW 417": [
      "Dementia Care for Older Adults",
      {
        "A": [
          "67582",
          [
            [
              100,
              "MW",
              "2018 1010 W Nevada",
              0,
              [
                "Palmer, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "This course will equip students with a body of knowledge to supervise, participate in, and facilitate care for persons with dementia throughout the lifespan. Upon completion of the course, students will be eligible for certification as approved dementia trained practitioners. The course will introduce and develop social work practice skills on all levels and choices of dementia care interventions and assessments. Special attention is given to practice skills for working with vulnerable populations and their caregivers through service learning site opportunities and assignments. The course uses an integrated health and person-center care approach with special attention to multi-cultural backgrounds and new family lifestyles related to dementia care.",
      []
    ],
    "SOCW 470": [
      "Field Practicum & Professional Seminar II",
      {
        "A": [
          "57416",
          [
            [
              230,
              "T",
              "Location Pending",
              0,
              [
                "Harden, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          15,
          16,
          0,
          [],
          -1
        ],
        "B": [
          "64992",
          [
            [
              230,
              "T",
              "Location Pending",
              0,
              [
                "Adams, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          15,
          16,
          0,
          [],
          -1
        ],
        "I": [
          "75736",
          [
            [
              234,
              "M",
              "ONLINE",
              0,
              [
                "Rice, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          15,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "A supervised field practice experience and seminar where students apply knowledge and skills in social work engagement, assessment, planning and interventions to individuals, groups, families, organizations, and communities. Students are expected to promote sustainable social change through planned problem solving and empowerment to enhance the well-being of others.",
      []
    ],
    "SOCW 418": [
      "Independent Study",
      {
        "": [
          "10060",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Independent study of a topic of special interest in the field of social work.",
      []
    ],
    "SOCW 480": [
      "UG Research Project",
      {
        "": [
          "62042",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Conduct research study under the supervision of a departmental faculty member. Topics and nature of assistance vary. Capstone paper required.",
      []
    ],
    "SOCW 500": [
      "SW Practice with Indiv and Fam",
      {
        "24A": [
          "44558",
          [
            [
              234,
              "W",
              "ONLINE",
              0,
              [
                "Piedra, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Systematically and critically examines the theory, procedures, and techniques of selected practice models within four main approaches to social work: cognitive-behavioral, systemic (family and ecological systems; crisis intervention), task-centered, and radical-structural (structural; feminist). Uses selected criteria to analyze and assess those models, examines outcome research, and identifies current practice issues.",
      []
    ],
    "SOCW 510": [
      "Theories of Diversity, Inequality, and Social Change",
      {
        "25A": [
          "73023",
          [
            [
              123,
              "W",
              "ONLINE",
              0,
              [
                "Decker-Tonnesen, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Explores important dimensions of social justice and social change relevant to social work leadership. The first phase of the course focuses on theories of diversity, social identity and social justice. The second phase focuses on theories of social change and stasis. Students will develop their own working models of these theories. They will also understand how issues of diversity and social justice should inform social work practice at micro, meso and macro-social work levels. Implications for social work leadership will also be explored.",
      []
    ],
    "SOCW 505": [
      "Behav and Cogn Methods for SW",
      {
        "A": [
          "32840",
          [
            [
              13,
              "T",
              "2018 1010 W Nevada",
              0,
              [
                "Miebach, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Students are introduced to brief behavioral and cognitive methods for treating a wide range of human problems, crises, and mental disorders. Content includes: (1) conceptualizing and assessing client problems; (2) identifying appropriate treatment goals; (3) developing comprehensive and differential treatment plans; (4) conducting brief interventions; and (5) evaluating client outcomes using research, consultation, and supervision.",
      []
    ],
    "SOCW 509": [
      "Adv Clin Assess & Interviewing",
      {
        "25A": [
          "59404",
          [
            [
              234,
              "M",
              "ONLINE",
              0,
              [
                "McDonald, H"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ],
        "25B": [
          "65453",
          [
            [
              234,
              "T",
              "ONLINE",
              0,
              [
                "Dean, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ],
        "25C": [
          "53203",
          [
            [
              234,
              "W",
              "ONLINE",
              0,
              [
                "Cintron, V"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ],
        "25D": [
          "74958",
          [
            [
              234,
              "R",
              "ONLINE",
              0,
              [
                "McDonald, H"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ],
        "25E": [
          "75945",
          [
            [
              165,
              "M",
              "ONLINE",
              0,
              [
                "McKean, T"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ],
        "A": [
          "32856",
          [
            [
              41,
              "M",
              "2018 1010 W Nevada",
              0,
              [
                "Hensold, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ],
        "B": [
          "32857",
          [
            [
              13,
              "W",
              "2023 1010 W Nevada",
              0,
              [
                "Piedra, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Advanced practice class designed to enhance students' understanding of clinical assessment and interviewing methods. Includes methods for therapeutically intervening with clients who are highly distressed, angry or agitated, resistant or involuntarily mandated for treatment, experiencing severe symptoms, or who have unique and complex problems. Clinical interviewing skills taught in this class will build upon knowledge and skills acquired in previous direct practice classes.",
      []
    ],
    "SOCW 508": [
      "Family Therapy Seminar",
      {
        "A": [
          "32845",
          [
            [
              41,
              "R",
              "2023 1010 W Nevada",
              0,
              [
                "Herzog, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Advanced seminar providing in-depth exposure to the principles, values, ethics, issues and practice of family therapy in social work. Focuses on family therapy process, the practitioner role, issues in assessment, intervention and evaluation; how discrimination and oppression impact intervention strategies; skills that advance social and economic justice; presentation of cases; use of supervision and consultation, and family therapy with diverse populations. Combines lecture/discussion with taped observations of noted family therapists and participation in a family therapy practicum.",
      []
    ],
    "SOCW 503": [
      "Trauma Informed Social Work with Children and Adolescents",
      {
        "24A": [
          "60168",
          [
            [
              277,
              "M",
              "ONLINE",
              0,
              [
                "Aviram, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ],
        "24B": [
          "60840",
          [
            [
              165,
              "M",
              "ONLINE",
              0,
              [
                "Cohen, F"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ],
        "A": [
          "61015",
          [
            [
              13,
              "R",
              "2023 1010 W Nevada",
              0,
              [
                "Cohen, F"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "This course uses a case study and inquiry based approach to foster student learning of the core concepts of trauma (theory and foundational knowledge) and evidence-based practice interventions effective in treating children, youth, and families that experience trauma. Cases discussed include children, youth, and families exposed to traumatic events (i.e. abuse, neglect, domestic violence, community violence and natural disasters). Strength-based practice interventions that build on existing child and family strengths that enhance growth and resiliency after trauma are studied.",
      []
    ],
    "SOCW 507": [
      "School Social Work Practice",
      {
        "24A": [
          "59398",
          [
            [
              234,
              "M",
              "ONLINE",
              0,
              [
                "Graham, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ],
        "A": [
          "32843",
          [
            [
              41,
              "T",
              "2023 1010 W Nevada",
              0,
              [
                "Mahoney, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Examination of the design and delivery of school social work interventions with special emphasis given to students with physical/mental disabilities and vulnerable populations. Course content provides a foundation for the development of a comprehensive and in-depth understanding of an ecological systems approach to social work practice based upon a foundation of professional values and ethics.",
      []
    ],
    "SOCW 514": [
      "Mental Health Pol and Svcs",
      {
        "24A": [
          "59395",
          [
            [
              234,
              "T",
              "ONLINE",
              0,
              [
                "Kingery, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ],
        "24B": [
          "62799",
          [
            [
              234,
              "T",
              "ONLINE",
              0,
              [
                "Gounder, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ],
        "24C": [
          "57403",
          [
            [
              234,
              "T",
              "ONLINE",
              0,
              [
                "Hernandez, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ],
        "A": [
          "32830",
          [
            [
              13,
              "M",
              "2023 1010 W Nevada",
              0,
              [
                "Larrison, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ],
        "B": [
          "46588",
          [
            [
              13,
              "M",
              "2101 1010 W Nevada",
              0,
              [
                "Schultz, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Examination of comprehensive community mental health services as they evolve from definitions of the problems and changes in federal and state social policy; the concept of normalization and its criteria for program evaluation; and changing roles of mental health professionals, paraprofessionals, and consumers in policy making and service delivery. Presents the history of mental health policy and services in the U.S.; current policies and activities of the mental health delivery system are critically analyzed.",
      []
    ],
    "SOCW 515": [
      "Integrated Health Care Policy and Services",
      {
        "24A": [
          "67788",
          [
            [
              234,
              "T",
              "ONLINE",
              0,
              [
                "Cella, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ],
        "A": [
          "69044",
          [
            [
              13,
              "M",
              "2019 1010 W Nevada",
              0,
              [
                "Harden, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Integrated Health Care Policy and Services is examined from a multidisciplinary perspective including social, cultural, political, economic, ethical and legal issues. Integrated health care services are described in relation to various definitions of health and mental health conditions and access to care. Current problems and issues in integrated health care including government responsibility and source of authority, policy development and analysis, proposals for reforms, and financing and cost containment are discussed and analyzed.",
      []
    ],
    "SOCW 516": [
      "Child, Youth and Family Svcs",
      {
        "24A": [
          "57785",
          [
            [
              234,
              "R",
              "ONLINE",
              0,
              [
                "Gulbrandson-Andrews, H"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ],
        "A": [
          "32831",
          [
            [
              41,
              "T",
              "2019 1010 W Nevada",
              0,
              [
                "Gulbrandson-Andrews, H"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Examines a range of direct service and public policy issues that social workers encounter when working with vulnerable children, adolescents, and families. Focuses particular attention on the families involved with child protection. Addresses the following questions: What factors help explain the etiology of violence and neglect in the family home? Once vulnerable families are identified and become involved with social service agencies, what interventions are most effective with regard to decreasing risks and strengthening protective factors? How can social service systems best prepare vulnerable adolescent for the transition to adulthood?",
      []
    ],
    "SOCW 519": [
      "Public School Policy/Services",
      {
        "24A": [
          "32834",
          [
            [
              234,
              "T",
              "ONLINE",
              0,
              [
                "Mahoney, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          1,
          0,
          [],
          -1
        ],
        "A": [
          "32833",
          [
            [
              13,
              "T",
              "2023 1010 W Nevada",
              0,
              [
                "Mahoney, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Presents content on children with physical and mental disabilities, educational policies related to vulnerable populations, and federal and state legislation, with particular emphasis given to the Individuals with Disabilities Act (IDEA). The following topics are highlighted: eligibility requirements, general characteristics of the disabling conditions, education as a continuum from early childhood to adulthood, school finance, and current educational issues. Content is presented pertaining to meeting the needs of exceptional children, students with other special needs, and their families in public schools and the community.",
      []
    ],
    "SOCW 531": [
      "Field Practicum and Integrative Seminar I",
      {
        "PEL": [
          "32846",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Buttera, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          12,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "This course is comprised of a field practicum and integrative seminar. The field practicum is educationally directed and supervised by an approved field instructor. The seminar component assists students with the integration of knowledge, skills, values and attitudes of social work practice acquired in the classroom with the hands-on practice experience in the field practicum setting. Learning experiences emphasize the application of knowledge and practice in the areas of ethical and professional behavior, diversity and difference, human rights and social, economic and environmental justice, research informed practice, policy practice, and engagement, assessment, intervention and evaluation with individuals, families, groups, organizations and communities.",
      []
    ],
    "SOCW 532": [
      "Field Practicum and Integrative Seminar II",
      {
        "A": [
          "32848",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Buttera, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          12,
          3,
          0,
          [],
          -1
        ],
        "B": [
          "32849",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Halcom, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          12,
          3,
          0,
          [],
          -1
        ],
        "C": [
          "48456",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Smith, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          12,
          3,
          0,
          [],
          -1
        ],
        "D": [
          "57404",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Escobar-Sawicki, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          12,
          3,
          0,
          [],
          -1
        ],
        "E": [
          "59406",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Dunlap Johnson, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          12,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "This course builds on the learning of SOCW 531 and is comprised of a field practicum and integrative seminar. Learning is directed at the development and demonstration of advanced competency skills. The field practicum is educationally directed and supervised by an approved field instructor. The seminar component assists students with the integration of advanced knowledge, skills, values and attitudes of social work practice acquired in the classroom with the hands-on practice experience in the field practicum setting. The advanced learning experiences emphasize the application of knowledge and practice in the areas of ethical and professional behavior, diversity and difference, human rights and social, economic and environmental justice, research informed practice, policy practice, and engagement, assessment, intervention and evaluation with individuals, families, groups, organizations and communities.",
      []
    ],
    "SOCW 541": [
      "Clinical Research Seminar",
      {
        "A": [
          "32864",
          [
            [
              36,
              "M",
              "2023 1010 W Nevada",
              0,
              [
                "Turner, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Develops skills for assessing effectiveness of social work interventions using research methods. The course assumes students have had prior courses in research methods and statistical analysis. Building on these courses, this course will focus on the use of research methods in examining important aspects of social work interventions. Students will also develop skills necessary to evaluate social work research practice and practice evidence, as well as skills in grant writing and data analysis.",
      []
    ],
    "SOCW 526": [
      "Managing Human Service Orgs",
      {
        "25A": [
          "64412",
          [
            [
              234,
              "M",
              "ONLINE",
              0,
              [
                "Bailey, N"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ],
        "A": [
          "46590",
          [
            [
              13,
              "W",
              "2101 1010 W Nevada",
              0,
              [
                "Iverson, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Focus on the design, administration and management of social programs from a social work perspective. Content includes: principles and process of administration and management, history of social welfare administration and how this relates to the design of current programs, review of administration Organizational and leadership theories, policy formulation, agency structure, staff organization, budgeting and evaluation of management practice.",
      []
    ],
    "SOCW 533": [
      "Field Practicum III",
      {
        "A": [
          "69559",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Trout, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          6,
          6,
          0,
          [],
          -1
        ]
      },
      [],
      "Learning is directed at the development and demonstration of advanced competency skills. The part-time field practicum is educationally directed and supervised by an approved field instructor. The advanced learning experiences emphasize the application of knowledge and practice in the areas of ethical and professional behavior; diversity and difference; human rights; social, economic and environmental justice; research informed practice; policy practice; and engagement, assessment, intervention and evaluation with individuals, families, groups, organizations and communities.",
      []
    ],
    "SOCW 542": [
      "Program Evaluation",
      {
        "A": [
          "67351",
          [
            [
              13,
              "R",
              "2018 1010 W Nevada",
              0,
              [
                "Kim, H"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "An advanced research course that develops skills for evaluating social service programs. The course assumes students have had prior courses in research methods and statistical analysis. This course provides an understanding of theoretical concepts, techniques, and research findings for evaluating a specific program, its implementation, and its effectiveness. It systematically analyzes program evaluation models and critically examines application of these models in the context of social work practice and social welfare policy.",
      []
    ],
    "SOCW 552": [
      "HBSE II: Mental Disorders",
      {
        "25A": [
          "48972",
          [
            [
              234,
              "M",
              "ONLINE",
              0,
              [
                "Wade, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ],
        "25B": [
          "53251",
          [
            [
              234,
              "T",
              "ONLINE",
              0,
              [
                "Wade, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ],
        "25C": [
          "69681",
          [
            [
              234,
              "W",
              "ONLINE",
              0,
              [
                "Turley, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ],
        "25D": [
          "70815",
          [
            [
              234,
              "R",
              "ONLINE",
              0,
              [
                "Turner, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ],
        "A": [
          "32853",
          [
            [
              41,
              "R",
              "2019 1010 W Nevada",
              0,
              [
                "Hensold, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Interrelationship of biological, emotional, learning and social aspects of mental disorders, and implications for the patient/client, family, and community. Focus on diagnostic assessment and biopsychosocial treatment methods including psychosocial treatment methods, medications, and social work interventions. Students also learn to recognize the potential for bias that can result when assessments are applied across cultural, ethnic, racial, socioeconomic, gender and other groups.",
      []
    ],
    "SOCW 561": [
      "Special Studies in Soc Work I",
      {
        "": [
          "10062",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          4,
          0,
          [],
          -1
        ],
        "B": [
          "43838",
          [
            [
              277,
              "W",
              "ONLINE",
              0,
              [
                "Campbell, C",
                "Harris, A",
                "Liechty, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          3,
          0,
          [],
          -1
        ],
        "D": [
          "27106",
          [
            [
              92,
              "W",
              "ONLINE",
              0,
              [
                "Cornell, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          3,
          0,
          [],
          -1
        ],
        "H": [
          "27099",
          [
            [
              41,
              "W",
              "2023 1010 W Nevada",
              0,
              [
                "Smith, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          5,
          0,
          [],
          -1
        ],
        "KW": [
          "27135",
          [
            [
              13,
              "R",
              "2101 1010 W Nevada",
              0,
              [
                "Wegmann, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          5,
          0,
          [],
          -1
        ],
        "SA": [
          "27077",
          [
            [
              73,
              "T",
              "ONLINE",
              0,
              [
                "Smith, D"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "F",
              "ONLINE",
              0,
              [
                "Smith, D"
              ],
              -1,
              -1,
              -1
            ],
            [
              3,
              "MTWRFSU",
              "ONLINE",
              0,
              [
                "Smith, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Independent or group study in areas of special interest; application of social work principles to special problems or settings.",
      []
    ],
    "SOCW 553": [
      "Integrated Behavorial Health & Health Care",
      {
        "24A": [
          "59402",
          [
            [
              234,
              "R",
              "ONLINE",
              0,
              [
                "Steward, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ],
        "A": [
          "43836",
          [
            [
              41,
              "M",
              "2023 1010 W Nevada",
              0,
              [
                "Johnson, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Students will learn therapeutic approaches, brief interventions and bioethical frameworks to help patients/family navigate illness, disability, and healthcare systems and promote health and wellness. Students will learn roles and functions of clinical social workers in healthcare settings with special attention to Integrated Care models and roles of the behavioral health consultant/provider and medical social worker on healthcare teams. Holistic biopsychosocial models that are patient/family centered, team-based, collaborative, and that integrate physical and behavioral health care to address social determinants of health and health equity will be emphasized. Common chronic and acute health conditions and medical terminology are discussed as well as evidence-based psychosocial interventions in hospital, primary care, and other outpatient settings.",
      []
    ],
    "SOCW 579": [
      "Social Work Practice Theories",
      {
        "A": [
          "70398",
          [
            [
              13,
              "W",
              "2019 1010 W Nevada",
              0,
              [
                "Schneider, W"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Presents theories for social work interventions with individuals, families, groups, and communities and organizations; critically analyzes different theoretical frameworks for such interventions; and examines the conceptual links between theory, process, outcome, and evaluations. This course is intended for students in the Ph.D. program in Social Work.",
      []
    ],
    "SOCW 581": [
      "Gender Relations & International Development",
      {
        "A": [
          "64394",
          [
            [
              51,
              "R",
              "131 English Building",
              3,
              [
                "Fogelman, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as CGGE 581 and GWS 512. See CGGE 581.",
      []
    ],
    "SOCW 589": [
      "Social Work and the Law",
      {
        "B": [
          "32862",
          [
            [
              41,
              "W",
              "2018 1010 W Nevada",
              0,
              [
                "Kopels, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Legal procedures and issues of special relevance to social work practice; includes legal provisions related to poverty, family development and crises, racial and ethnic minorities, institutionalized persons, crime and delinquency, legal authority of social agencies, and regulation of the profession.",
      []
    ],
    "SOCW 594": [
      "Individual Research",
      {
        "": [
          "10066",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Course is designed to enhance the research skills of Doctoral students in social work through research collaboration with a faculty member.",
      []
    ],
    "SOCW 580": [
      "Advanced Child Welfare",
      {
        "24A": [
          "57784",
          [
            [
              234,
              "T",
              "ONLINE",
              0,
              [
                "Havlicek, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ],
        "A": [
          "32863",
          [
            [
              13,
              "T",
              "2101 1010 W Nevada",
              0,
              [
                "Havlicek, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Examines laws, scientific concepts, ethical dilemmas, and new practice directions with respect to protecting children, preserving families, regulating foster care, achieving family permanency, and assisting foster youth in transitioning to independence. Review of legislative, court, and administrative frameworks for promoting these outcomes at the city, state, and federal levels. The course analyzes and critiques historical and contemporary social science, public policy, community organization, and legal advocacy perspectives on child protection and child welfare. Contemporary topics and issues are discussed and debated.",
      []
    ],
    "SOCW 595": [
      "Quantitative Research Designs",
      {
        "A": [
          "50912",
          [
            [
              13,
              "F",
              "2019 1010 W Nevada",
              0,
              [
                "Kim, H"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Provides a doctoral level overview of quantitative designs and conceptual issues in social work research. It presents a framework for structuring the statistical analysis and systematic evaluation of the efficacy and effectiveness of social interventions in achieving desired outcomes for diverse populations. Although the purpose is not to emphasize statistical training, the course will reinforce the learning of basic concepts, mathematical foundations, and assumptions underlying advanced applications of statistical description and causal inference.",
      []
    ],
    "SOCW 584": [
      "Policy Practice and Advocacy",
      {
        "24A": [
          "57788",
          [
            [
              234,
              "T",
              "ONLINE",
              0,
              [
                "Olatunji, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ],
        "A": [
          "46596",
          [
            [
              41,
              "W",
              "2019 1010 W Nevada",
              0,
              [
                "Large, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Examines approaches for analyzing social policy development, implementation and advocacy in the United States; and development of skills to become effective policy practitioners. Involves ability to formulate viable policy options as well as skills in advocating for adoption of desired policies. Content includes knowledge about the political processes associated with policy development, the technologies needed to develop policies, communication skills need for policy advocacy, and knowledge in a specialized area. Course builds on policy material presented in SOCW 410.",
      []
    ]
  },
  "caches": {
    "periods": [
      "1300 - 1540",
      "1400 - 1520",
      "1100 - 1220",
      "0000 - 0000",
      "1530 - 1650",
      "0930 - 1210",
      "1400 - 1640",
      "0900 - 1140",
      "1600 - 1840",
      "1700 - 1940",
      "1400 - 1700",
      "1700 - 1820",
      "1130 - 1250",
      "0900 - 1150",
      "1200 - 1250",
      "1300 - 1350",
      "1230 - 1350",
      "1000 - 1050",
      "0900 - 1020",
      "0800 - 0850",
      "0900 - 0950",
      "0930 - 1050",
      "1100 - 1150",
      "1030 - 1150",
      "1400 - 1450",
      "1500 - 1550",
      "1600 - 1650",
      "1200 - 1320",
      "1500 - 1620",
      "1630 - 1750",
      "1400 - 1550",
      "1600 - 1750",
      "1930 - 2050",
      "1300 - 1420",
      "0930 - 1020",
      "0800 - 0920",
      "1700 - 1950",
      "1100 - 1250",
      "1700 - 1750",
      "0800 - 1050",
      "1530 - 1820",
      "1300 - 1550",
      "0930 - 1220",
      "1830 - 2020",
      "1500 - 1650",
      "1400 - 1720",
      "0900 - 1220",
      "1300 - 1620",
      "1100 - 1450",
      "1500 - 1850",
      "1200 - 1450",
      "1400 - 1650",
      "1600 - 1850",
      "0900 - 1050",
      "1000 - 1150",
      "1000 - 1120",
      "0800 - 0950",
      "0800 - 1150",
      "1300 - 1520",
      "1530 - 1645",
      "1100 - 1215",
      "1400 - 1515",
      "1700 - 1815",
      "1830 - 1945",
      "0930 - 1045",
      "1230 - 1345",
      "1530 - 1620",
      "1630 - 1720",
      "1600 - 1740",
      "1200 - 1350",
      "1800 - 1950",
      "1330 - 1450",
      "1300 - 1450",
      "1600 - 1720",
      "1830 - 1950",
      "1300 - 1750",
      "1700 - 1850",
      "1300 - 1650",
      "1230 - 1320",
      "1900 - 2050",
      "1530 - 1720",
      "1800 - 2100",
      "1800 - 2050",
      "0900 - 1120",
      "1800 - 1920",
      "1630 - 1920",
      "1200 - 1650",
      "1100 - 1330",
      "0930 - 1200",
      "1530 - 1800",
      "1000 - 2000",
      "1200 - 1550",
      "1300 - 1430",
      "1830 - 2130",
      "1600 - 1700",
      "1430 - 1550",
      "1830 - 2100",
      "1630 - 1745",
      "1630 - 1730",
      "1000 - 1250",
      "1600 - 1715",
      "1730 - 1845",
      "1700 - 1800",
      "1300 - 1415",
      "1500 - 1720",
      "1300 - 1600",
      "1400 - 1630",
      "1000 - 1220",
      "1430 - 1820",
      "1500 - 1700",
      "0900 - 1030",
      "1430 - 1630",
      "1035 - 1150",
      "1700 - 1900",
      "1400 - 1620",
      "1450 - 1735",
      "1145 - 1305",
      "1530 - 1750",
      "1500 - 1750",
      "1100 - 1350",
      "0830 - 0950",
      "1100 - 1230",
      "1600 - 1800",
      "1800 - 2000",
      "1900 - 1930",
      "0730 - 1530",
      "1530 - 1550",
      "1000 - 1700",
      "1600 - 1730",
      "1730 - 1850",
      "1630 - 1800",
      "1100 - 1320",
      "1230 - 1430",
      "1500 - 1730",
      "1200 - 1430",
      "1000 - 1200",
      "1700 - 2000",
      "1730 - 2030",
      "1730 - 2020",
      "0900 - 1200",
      "1730 - 2130",
      "0900 - 1600",
      "1900 - 2200",
      "1900 - 1950",
      "1500 - 1615",
      "0800 - 1220",
      "1700 - 1920",
      "1630 - 1910",
      "1600 - 2050",
      "0830 - 1350",
      "0930 - 1040",
      "1500 - 1600",
      "1600 - 1820",
      "0900 - 1145",
      "1300 - 1545",
      "1230 - 1520",
      "1430 - 1620",
      "1010 - 1100",
      "1115 - 1205",
      "1230 - 1420",
      "1800 - 1850",
      "1800 - 2020",
      "0830 - 1120",
      "1530 - 1710",
      "1900 - 2020",
      "1900 - 2030",
      "1000 - 1130",
      "1000 - 1100",
      "0800 - 0940",
      "0900 - 1040",
      "1200 - 1340",
      "1000 - 1115",
      "1330 - 1620",
      "0930 - 1120",
      "1130 - 1320",
      "1030 - 1120",
      "1430 - 1520",
      "1130 - 1220",
      "1330 - 1445",
      "1200 - 1259",
      "1030 - 1145",
      "1330 - 1520",
      "1430 - 1545",
      "0900 - 1015",
      "1330 - 1420",
      "1325 - 1445",
      "1715 - 1830",
      "1729 - 1920",
      "0830 - 1020",
      "1500 - 1659",
      "1300 - 1459",
      "0850 - 1020",
      "1730 - 1930",
      "1330 - 1535",
      "0930 - 1135",
      "1700 - 1930",
      "0900 - 1159",
      "0930 - 1130",
      "0930 - 1129",
      "0915 - 1159",
      "1600 - 1859",
      "1600 - 1810",
      "1700 - 1859",
      "1500 - 1629",
      "1800 - 1915",
      "1600 - 1759",
      "1330 - 1615",
      "1500 - 1555",
      "1330 - 1559",
      "1330 - 1640",
      "1330 - 1630",
      "1345 - 1645",
      "1630 - 1820",
      "1730 - 1920",
      "0900 - 1700",
      "0900 - 1035",
      "1325 - 1450",
      "1500 - 1745",
      "1500 - 1729",
      "1501 - 1745",
      "1330 - 1429",
      "1745 - 1925",
      "1800 - 2005",
      "1740 - 2000",
      "1700 - 1830",
      "1330 - 1529",
      "1000 - 1159",
      "1030 - 1159",
      "1700 - 1910",
      "1010 - 1125",
      "0900 - 1000",
      "0800 - 1030",
      "1830 - 2030",
      "1200 - 1330",
      "1800 - 1930",
      "1320 - 1450",
      "1400 - 1750",
      "0900 - 1250",
      "1000 - 1350",
      "1330 - 1500",
      "0600 - 0720",
      "0800 - 0930",
      "1830 - 2050",
      "1100 - 1300",
      "1730 - 1820",
      "0930 - 1100",
      "1400 - 1530",
      "1500 - 1630",
      "1730 - 1900",
      "1930 - 2130",
      "1000 - 1300",
      "1900 - 2150",
      "1200 - 1300",
      "1700 - 2050",
      "1800 - 1900",
      "0900 - 1300",
      "1900 - 2100",
      "0600 - 0750",
      "1200 - 1315",
      "1100 - 1200",
      "1400 - 1600",
      "1430 - 1530",
      "2000 - 2050",
      "1130 - 1300",
      "0930 - 1150",
      "1330 - 1550",
      "0900 - 1130",
      "0800 - 0915",
      "1800 - 2030",
      "1400 - 1540",
      "1200 - 1420",
      "1500 - 1800",
      "1300 - 1500",
      "1945 - 2115",
      "1500 - 1645",
      "1300 - 1445",
      "1800 - 1945",
      "1830 - 2000"
    ],
    "dateRanges": [],
    "scheduleTypes": [
      "Laboratory",
      "Online Lecture",
      "Lecture",
      "Online",
      "Independent Study",
      "Lecture-Discussion",
      "Internship",
      "Studio",
      "Travel",
      "Conference",
      "Seminar",
      "Discussion/ Recitation",
      "Online Discussion",
      "Online Lab",
      "Laboratory-Discussion",
      "Research",
      "Practice",
      "Study Abroad",
      "Quiz",
      "Online Lecture Discussion",
      "Packaged Section"
    ],
    "campuses": [],
    "attributes": [],
    "restrictions": [],
    "gradeBases": [],
    "locations": [
      {
        "lat": null,
        "long": null
      },
      {
        "lat": 40.106778040727896,
        "long": -88.2194617156191
      },
      {
        "lat": 40.11171215875622,
        "long": -88.22530849701589
      },
      {
        "lat": 40.107534,
        "long": -88.2281548
      },
      {
        "lat": 40.110811306674734,
        "long": -88.2248467072371
      },
      {
        "lat": 40.105732,
        "long": -88.2281018
      },
      {
        "lat": 40.1083446,
        "long": -88.2282555
      },
      {
        "lat": 40.1131317,
        "long": -88.2264552
      },
      {
        "lat": 40.1020773,
        "long": -88.2296394
      },
      {
        "lat": 40.11246109008789,
        "long": -88.22831726074219
      },
      {
        "lat": 40.11380515934119,
        "long": -88.22490788390387
      },
      {
        "lat": 40.108419421661715,
        "long": -88.2261156301609
      },
      {
        "lat": 40.1072225,
        "long": -88.2262016
      },
      {
        "lat": 40.1110937,
        "long": -88.2232348
      },
      {
        "lat": 40.103587,
        "long": -88.230606
      },
      {
        "lat": 40.1108856,
        "long": -88.2269806
      },
      {
        "lat": 40.1109722,
        "long": -88.2282631
      },
      {
        "lat": 40.107811,
        "long": -88.2260761
      },
      {
        "lat": 40.10944320239664,
        "long": -88.22602522743233
      },
      {
        "lat": 40.1065684,
        "long": -88.2281746
      },
      {
        "lat": 40.10628,
        "long": -88.22621
      },
      {
        "lat": 40.105587640130146,
        "long": -88.22025111416733
      },
      {
        "lat": 40.103620555545135,
        "long": -88.22982720445013
      },
      {
        "lat": 40.1035872,
        "long": -88.2306061
      },
      {
        "lat": 40.10593795776367,
        "long": -88.2270736694336
      },
      {
        "lat": 40.10755766472843,
        "long": -88.22995430218522
      },
      {
        "lat": 40.102726858556835,
        "long": -88.23259991223857
      },
      {
        "lat": 40.101862,
        "long": -88.231737
      },
      {
        "lat": 40.1149296,
        "long": -88.2280589
      },
      {
        "lat": 40.108570819242026,
        "long": -88.22518453938676
      },
      {
        "lat": 40.1047599,
        "long": -88.2319514
      },
      {
        "lat": 40.092875494224195,
        "long": -88.22082220247309
      },
      {
        "lat": 40.11397164321797,
        "long": -88.2265192685827
      },
      {
        "lat": 40.104794,
        "long": -88.224264
      },
      {
        "lat": 40.10783362157985,
        "long": -88.22476189569741
      },
      {
        "lat": 40.111691,
        "long": -88.2242511
      },
      {
        "lat": 40.1035833,
        "long": -88.228405
      },
      {
        "lat": 40.1033599,
        "long": -88.2292111
      },
      {
        "lat": 40.103627234541904,
        "long": -88.22601765311099
      },
      {
        "lat": 40.10127390836906,
        "long": -88.2226073524728
      },
      {
        "lat": 40.0995003,
        "long": -88.223104
      },
      {
        "lat": 40.11085653938169,
        "long": -88.22609810215927
      },
      {
        "lat": 40.1149521,
        "long": -88.2267561
      },
      {
        "lat": 40.10802885201532,
        "long": -88.22239700364068
      },
      {
        "lat": 40.11180304465921,
        "long": -88.22613003543475
      },
      {
        "lat": 40.1022093629303,
        "long": -88.22800864058527
      },
      {
        "lat": 40.10623714823253,
        "long": -88.2232659093846
      },
      {
        "lat": 40.10039170750639,
        "long": -88.21813070187608
      },
      {
        "lat": 40.1034533,
        "long": -88.2327596
      },
      {
        "lat": 40.1028373,
        "long": -88.2251326
      },
      {
        "lat": 40.1048704,
        "long": -88.2229036
      },
      {
        "lat": 40.10099,
        "long": -88.23159
      },
      {
        "lat": 40.1116416,
        "long": -88.2248868
      },
      {
        "lat": 40.10764262805109,
        "long": -88.23074052515514
      }
    ],
    "finalDates": [],
    "finalTimes": []
  }
}