{
  "subject": "SPED",
  "scrapedAt": 1768450893819,
  "courseCount": 25,
  "courses": {
    "SPED 117": [
      "The Culture of Disability",
      {
        "A": [
          "34495",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Mason, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ],
        "B": [
          "34501",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Carey, Y"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "The purpose of this course is to provide an introduction to the culture of disability across the lifespan. The impact of disabilities on an individual across the lifespan will be explored, and the unique culture that is created by having a disability will be addressed. The historical basis for the disability movement and special education will be addressed, including legislation and litigation that has had a significant impact on the field. Students also will learn about the characteristics of individuals with diverse abilities as well as current trends in educational services.",
      []
    ],
    "SPED 426": [
      "Preparing for Professional Practice",
      {
        "A": [
          "34530",
          [
            [
              52,
              "W",
              "17 Education Building",
              8,
              [
                "Zarate, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "This course provides participants with the information and strategies for effective collaboration and interactive teaming. Participants will learn effective models of collaboration and consultation, team member roles and responsibilities, collaborative practices for participating on teams, and strategies for securing appropriate resources for students with disabilities. Emphasis is placed on skills necessary for working collaboratively with parents, teachers, and other service providers.",
      []
    ],
    "SPED 412": [
      "Understanding Special Education Law & Ethics",
      {
        "A": [
          "76819",
          [
            [
              41,
              "T",
              "4G Education Building",
              8,
              [
                "Andrews, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "An introduction and overview of the continuous evolution of special education by analyzing and critiquing educational policies, legal regulations, and current cultural issues related to the individualized education program for students with disabilities. Emphasis will be placed on ethical, equitable, and just practices for understanding how students become eligible and receive special education services. Students will produce a quality and compliant IEP while learning how to advocate with and for students with disabilities.",
      []
    ],
    "SPED 442": [
      "Teaching Reading to Learners with Disabilities",
      {
        "A": [
          "77767",
          [
            [
              51,
              "T",
              "4F Education Building",
              8,
              [
                "Ray, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Students will learn the components of reading and how to design reading instruction for students with disabilities. Students will learn effective strategies for teaching and assessing the main areas of reading including phonemic awareness, phonics, fluency, vocabulary, and comprehension to learners with disabilities.",
      []
    ],
    "SPED 322": [
      "Introduction to Intellectual Disability",
      {
        "A": [
          "34522",
          [
            [
              52,
              "T",
              "W109 Turner Hall",
              0,
              [
                "Tarconish, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Study of the history and current status of the social, emotional, physical, and learning characteristics and problems of persons with an intellectual disability; identification and diagnosis; available services and provisions; and educational programs and lifelong processes of adaptation for these individuals and their families.",
      []
    ],
    "SPED 438": [
      "Collaboration with Diverse Families in Special Education",
      {
        "A": [
          "34533",
          [
            [
              52,
              "R",
              "242 Education Building",
              8,
              [
                "Oh, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "The impact of disability and cultural diversity on the collaborative relationship and roles between families and school personnel. Strategies for establishing partnerships with families and their children to optimize positive students' educational outcomes will be explored. A family systems perspective will be applied to understanding the diverse families with members with disabilities. Participants will reflect on their own culture, lived experiences, and family structure while using strategies to understand family perspectives.",
      []
    ],
    "SPED 391": [
      "Thesis",
      {
        "": [
          "10082",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Prerequisite: Senior standing.",
      []
    ],
    "SPED 395": [
      "Independent Study",
      {
        "": [
          "10081",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Study of problems not considered in other courses; designed for students who excel in self-direction and intellectual curiosity.",
      []
    ],
    "SPED 199": [
      "Undergraduate Open Seminar",
      {
        "": [
          "10075",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          5,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Topics will vary. See course schedule.",
      []
    ],
    "SPED 410": [
      "Principles of Universal Design for Learning & Models for Understanding Disability",
      {
        "A": [
          "76818",
          [
            [
              41,
              "R",
              "242 Education Building",
              8,
              [
                "Allen, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Addressing the instruction of all individuals with particular attention to those with disabilities/disabled individuals who are provided services and supports under IDEA. Topics include effective instructional practices, including the skill of planning for diversity using a universal design framework. The course begins with understanding the differing model for understanding disability, then transitions to designing inclusive instruction, and ends with learning to lesson plan using backwards design and incorporating UDL.",
      []
    ],
    "SPED 452": [
      "Teaching Mathematics and Science to Learners with Disabilities I",
      {
        "A": [
          "77769",
          [
            [
              52,
              "M",
              "4G Education Building",
              8,
              [
                "Mason, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Supports special education teacher candidates in articulating a vision for equitable mathematics and science instruction and working toward realizing that vision by designing meaningful grade-level aligned learning progressions, instructional activities, and assessments for all students with disabilities including those with extensive support needs.",
      []
    ],
    "SPED 462": [
      "Facilitating Educational Access for Students with Extensive Support Needs",
      {
        "A": [
          "77768",
          [
            [
              52,
              "W",
              "4G Education Building",
              8,
              [
                "Ross, M",
                "Schutz, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Strategies and procedures for supporting students with disabilities who have extensive support needs in accessing inclusive educational experiences. Specific areas of interest include addressing specialized healthcare needs, complex communication needs and augmentative and alternative communication (AAC), assistive technology, adaptive equipment, and task or environmental accommodations and modifications that facilitate student success in general education.",
      []
    ],
    "SPED 471": [
      "Individualized Behavior Supports for Students with Disabilities",
      {
        "A": [
          "40858",
          [
            [
              51,
              "R",
              "22 Education Building",
              8,
              [
                "Zarate, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Addresses a behavioral-analytic approach and perspective on assessment, intervention, and support of individuals with disabilities demonstrating behavioral challenges that interfere with learning and academic progress. Participants will become familiar with legal requirements within the Individualized Education Program (IEP) and the collaborative team process and procedures for 1) assessing student preferences, 2) evaluating and conducting functional behavioral assessments (FBA) and 3) developing individualized function-based and culturally-appropriate behavioral intervention plans (BIPs) within school settings",
      []
    ],
    "SPED 526": [
      "Collaborative Leaders in Special Education",
      {
        "A": [
          "34565",
          [
            [
              52,
              "W",
              "42A Education Building",
              8,
              [
                "Harrington, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ],
        "AC": [
          "49427",
          [
            [
              36,
              "M",
              "Location Pending",
              0,
              [
                "Carey, Y"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Course provides special educators and other professionals with skills and strategies to assume a leader/change agent role in their schools. Participants focus on effective leadership, collaborative practices, and innovative programs in special education that create unique learning environments, ultimately impacting all stakeholders (student with and without disabilities, teachers, families). Course readings, lectures, and activities address how leaders in the field affect change in special education through grant writing, professional development, and the implementation and evaluation of innovative programs and practices.",
      []
    ],
    "SPED 583": [
      "Single Case Experimental Design",
      {
        "A": [
          "34868",
          [
            [
              41,
              "M",
              "242 Education Building",
              8,
              [
                "Hardy, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Study of the analysis of behavior in one or a few subjects using advanced time series designs; includes making accurate and reliable assessment of objective behaviors and designing experiments that feature interpretable comparisons among interventions and credible generalizability to subjects, settings, and time periods other than those specifically studied. Classic and current exemplars of these designs are studied and critiqued in depth.",
      []
    ],
    "SPED 575": [
      "Mixed Method Inquiry",
      {
        "A": [
          "69663",
          [
            [
              41,
              "W",
              "4F Education Building",
              8,
              [
                "Stone, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as EPSY 575. See EPSY 575.",
      []
    ],
    "SPED 505": [
      "Ethics in Early Intervention",
      {
        "A": [
          "77770",
          [
            [
              123,
              "R",
              "ONLINE",
              0,
              [
                "Williams, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Overview of ethics in the field of early intervention including ethical theories, various professional organizations’ codes of ethics, common ethical dilemmas in the field, and the interrelationship of ethics with culture and trauma.",
      []
    ],
    "SPED 524": [
      "Supervised Practice in Special Education",
      {
        "ACC": [
          "58075",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Carey, Y"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          16,
          0,
          [],
          -1
        ],
        "E": [
          "34552",
          [
            [
              72,
              "T",
              "288A Education Building",
              8,
              [
                "Williams, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          16,
          0,
          [],
          -1
        ],
        "LBS": [
          "34558",
          [
            [
              79,
              "T",
              "242 Education Building",
              8,
              [
                "Andrews, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          16,
          0,
          [],
          -1
        ],
        "LBT": [
          "34560",
          [
            [
              79,
              "T",
              "242 Education Building",
              8,
              [
                "Andrews, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          16,
          0,
          [],
          -1
        ]
      },
      [],
      "Supervised practice in one or more settings in which students with disabilities are served; practicum settings may include day, residential, special, and regular schools which serve students with disabilities.",
      []
    ],
    "SPED 507": [
      "Collaboration and Teaming in Early Intervention",
      {
        "A": [
          "77771",
          [
            [
              123,
              "R",
              "ONLINE",
              0,
              [
                "Williams, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Overview of approaches, concepts, and skills related to how to team and collaborate with other professionals in early intervention.",
      []
    ],
    "SPED 566": [
      "Leadership in Early Childhood Special Education",
      {
        "A": [
          "34656",
          [
            [
              52,
              "W",
              "42A Education Building",
              8,
              [
                "Harrington, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Program issues and research on the efficacy of various program models for young children with special needs from infancy to six; implications for program organization variables such as space, personnel roles, and curriculum",
      []
    ],
    "SPED 585": [
      "Individual Differences: B to 6",
      {
        "A": [
          "55853",
          [
            [
              52,
              "M",
              "ONLINE",
              0,
              [
                "Harrington, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Examines major developmental themes in young children from birth to six. Emphasizes individual differences resulting from environmental and biological factors that influence development, including those resulting from disabilities. Focuses on integration among multiple domains of development.",
      []
    ],
    "SPED 591": [
      "Field Study and Thesis Seminar",
      {
        "": [
          "10090",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          4,
          0,
          [],
          -1
        ],
        "B": [
          "47934",
          [
            [
              31,
              "T",
              "376 Education Building",
              8,
              [
                "Allen, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Planning field studies and thesis problems by graduate students; students present their studies at each of four stages: (1) the inception, delimitation, tentative design stage; (2) the proposed design stage; (3) the revised design stage; and (4) the final design stage. Students are expected to analyze all presentations critically.",
      []
    ],
    "SPED 595": [
      "Independent Study",
      {
        "": [
          "10087",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          4,
          0,
          [],
          -1
        ]
      },
      [],
      "Self-directive, independent study, that is, develops the individual's ability as an independent student and enables the student to pursue needed study in a field in which appropriate courses are not being offered during a given term.",
      []
    ],
    "SPED 590": [
      "Seminar for Advanced Students",
      {
        "AMM": [
          "46302",
          [
            [
              41,
              "R",
              "166 Education Building",
              8,
              [
                "Corr, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          5,
          0,
          [],
          -1
        ],
        "CL": [
          "34873",
          [
            [
              72,
              "F",
              "376 Education Building",
              8,
              [
                "Lambert, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          5,
          0,
          [],
          -1
        ],
        "DEI": [
          "57966",
          [
            [
              159,
              "F",
              "389 Education Building",
              8,
              [
                "Allen, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          5,
          0,
          [],
          -1
        ],
        "ECS": [
          "34875",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Hardy, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          3,
          0,
          [],
          -1
        ],
        "IMP": [
          "48213",
          [
            [
              53,
              "F",
              "376 Education Building",
              8,
              [
                "Lambert, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          5,
          0,
          [],
          -1
        ],
        "LBS": [
          "46301",
          [
            [
              3,
              "",
              "ONLINE",
              0,
              [
                "Andrews, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          3,
          0,
          [],
          -1
        ],
        "TI3": [
          "47969",
          [
            [
              72,
              "R",
              "288A Education Building",
              8,
              [
                "Chudzik, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Seminar in the education of individuals with disabilities; open only to persons who have been admitted for graduate study.",
      []
    ],
    "SPED 593": [
      "Concepts and Issues in Special Education II",
      {
        "A": [
          "34878",
          [
            [
              13,
              "W",
              "376 Education Building",
              8,
              [
                "Lambert, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          5,
          0,
          [],
          -1
        ]
      },
      [],
      "Seminar in current concepts and issues relating to all children with special needs; introduction to grant proposal writing; and introduction to journal reviewing; requires critical review of key readings and preparation of a literature review of a topic of current research in special education.",
      []
    ]
  },
  "caches": {
    "periods": [
      "1300 - 1540",
      "1400 - 1520",
      "1100 - 1220",
      "0000 - 0000",
      "1530 - 1650",
      "0930 - 1210",
      "1400 - 1640",
      "0900 - 1140",
      "1600 - 1840",
      "1700 - 1940",
      "1400 - 1700",
      "1700 - 1820",
      "1130 - 1250",
      "0900 - 1150",
      "1200 - 1250",
      "1300 - 1350",
      "1230 - 1350",
      "1000 - 1050",
      "0900 - 1020",
      "0800 - 0850",
      "0900 - 0950",
      "0930 - 1050",
      "1100 - 1150",
      "1030 - 1150",
      "1400 - 1450",
      "1500 - 1550",
      "1600 - 1650",
      "1200 - 1320",
      "1500 - 1620",
      "1630 - 1750",
      "1400 - 1550",
      "1600 - 1750",
      "1930 - 2050",
      "1300 - 1420",
      "0930 - 1020",
      "0800 - 0920",
      "1700 - 1950",
      "1100 - 1250",
      "1700 - 1750",
      "0800 - 1050",
      "1530 - 1820",
      "1300 - 1550",
      "0930 - 1220",
      "1830 - 2020",
      "1500 - 1650",
      "1400 - 1720",
      "0900 - 1220",
      "1300 - 1620",
      "1100 - 1450",
      "1500 - 1850",
      "1200 - 1450",
      "1400 - 1650",
      "1600 - 1850",
      "0900 - 1050",
      "1000 - 1150",
      "1000 - 1120",
      "0800 - 0950",
      "0800 - 1150",
      "1300 - 1520",
      "1530 - 1645",
      "1100 - 1215",
      "1400 - 1515",
      "1700 - 1815",
      "1830 - 1945",
      "0930 - 1045",
      "1230 - 1345",
      "1530 - 1620",
      "1630 - 1720",
      "1600 - 1740",
      "1200 - 1350",
      "1800 - 1950",
      "1330 - 1450",
      "1300 - 1450",
      "1600 - 1720",
      "1830 - 1950",
      "1300 - 1750",
      "1700 - 1850",
      "1300 - 1650",
      "1230 - 1320",
      "1900 - 2050",
      "1530 - 1720",
      "1800 - 2100",
      "1800 - 2050",
      "0900 - 1120",
      "1800 - 1920",
      "1630 - 1920",
      "1200 - 1650",
      "1100 - 1330",
      "0930 - 1200",
      "1530 - 1800",
      "1000 - 2000",
      "1200 - 1550",
      "1300 - 1430",
      "1830 - 2130",
      "1600 - 1700",
      "1430 - 1550",
      "1830 - 2100",
      "1630 - 1745",
      "1630 - 1730",
      "1000 - 1250",
      "1600 - 1715",
      "1730 - 1845",
      "1700 - 1800",
      "1300 - 1415",
      "1500 - 1720",
      "1300 - 1600",
      "1400 - 1630",
      "1000 - 1220",
      "1430 - 1820",
      "1500 - 1700",
      "0900 - 1030",
      "1430 - 1630",
      "1035 - 1150",
      "1700 - 1900",
      "1400 - 1620",
      "1450 - 1735",
      "1145 - 1305",
      "1530 - 1750",
      "1500 - 1750",
      "1100 - 1350",
      "0830 - 0950",
      "1100 - 1230",
      "1600 - 1800",
      "1800 - 2000",
      "1900 - 1930",
      "0730 - 1530",
      "1530 - 1550",
      "1000 - 1700",
      "1600 - 1730",
      "1730 - 1850",
      "1630 - 1800",
      "1100 - 1320",
      "1230 - 1430",
      "1500 - 1730",
      "1200 - 1430",
      "1000 - 1200",
      "1700 - 2000",
      "1730 - 2030",
      "1730 - 2020",
      "0900 - 1200",
      "1730 - 2130",
      "0900 - 1600",
      "1900 - 2200",
      "1900 - 1950",
      "1500 - 1615",
      "0800 - 1220",
      "1700 - 1920",
      "1630 - 1910",
      "1600 - 2050",
      "0830 - 1350",
      "0930 - 1040",
      "1500 - 1600",
      "1600 - 1820",
      "0900 - 1145",
      "1300 - 1545",
      "1230 - 1520",
      "1430 - 1620",
      "1010 - 1100",
      "1115 - 1205",
      "1230 - 1420",
      "1800 - 1850",
      "1800 - 2020",
      "0830 - 1120",
      "1530 - 1710",
      "1900 - 2020",
      "1900 - 2030",
      "1000 - 1130",
      "1000 - 1100",
      "0800 - 0940",
      "0900 - 1040",
      "1200 - 1340",
      "1000 - 1115",
      "1330 - 1620",
      "0930 - 1120",
      "1130 - 1320",
      "1030 - 1120",
      "1430 - 1520",
      "1130 - 1220",
      "1330 - 1445",
      "1200 - 1259",
      "1030 - 1145",
      "1330 - 1520",
      "1430 - 1545",
      "0900 - 1015",
      "1330 - 1420",
      "1325 - 1445",
      "1715 - 1830",
      "1729 - 1920",
      "0830 - 1020",
      "1500 - 1659",
      "1300 - 1459",
      "0850 - 1020",
      "1730 - 1930",
      "1330 - 1535",
      "0930 - 1135",
      "1700 - 1930",
      "0900 - 1159",
      "0930 - 1130",
      "0930 - 1129",
      "0915 - 1159",
      "1600 - 1859",
      "1600 - 1810",
      "1700 - 1859",
      "1500 - 1629",
      "1800 - 1915",
      "1600 - 1759",
      "1330 - 1615",
      "1500 - 1555",
      "1330 - 1559",
      "1330 - 1640",
      "1330 - 1630",
      "1345 - 1645",
      "1630 - 1820",
      "1730 - 1920",
      "0900 - 1700",
      "0900 - 1035",
      "1325 - 1450",
      "1500 - 1745",
      "1500 - 1729",
      "1501 - 1745",
      "1330 - 1429",
      "1745 - 1925",
      "1800 - 2005",
      "1740 - 2000",
      "1700 - 1830",
      "1330 - 1529",
      "1000 - 1159",
      "1030 - 1159",
      "1700 - 1910",
      "1010 - 1125",
      "0900 - 1000",
      "0800 - 1030",
      "1830 - 2030",
      "1200 - 1330",
      "1800 - 1930",
      "1320 - 1450",
      "1400 - 1750",
      "0900 - 1250",
      "1000 - 1350",
      "1330 - 1500",
      "0600 - 0720",
      "0800 - 0930",
      "1830 - 2050",
      "1100 - 1300",
      "1730 - 1820",
      "0930 - 1100",
      "1400 - 1530",
      "1500 - 1630",
      "1730 - 1900",
      "1930 - 2130",
      "1000 - 1300",
      "1900 - 2150",
      "1200 - 1300",
      "1700 - 2050",
      "1800 - 1900",
      "0900 - 1300",
      "1900 - 2100",
      "0600 - 0750",
      "1200 - 1315",
      "1100 - 1200",
      "1400 - 1600",
      "1430 - 1530",
      "2000 - 2050",
      "1130 - 1300",
      "0930 - 1150",
      "1330 - 1550",
      "0900 - 1130",
      "0800 - 0915",
      "1800 - 2030",
      "1400 - 1540",
      "1200 - 1420",
      "1500 - 1800",
      "1300 - 1500",
      "1945 - 2115",
      "1500 - 1645",
      "1300 - 1445",
      "1800 - 1945",
      "1830 - 2000"
    ],
    "dateRanges": [],
    "scheduleTypes": [
      "Laboratory",
      "Online Lecture",
      "Lecture",
      "Online",
      "Independent Study",
      "Lecture-Discussion",
      "Internship",
      "Studio",
      "Travel",
      "Conference",
      "Seminar",
      "Discussion/ Recitation",
      "Online Discussion",
      "Online Lab",
      "Laboratory-Discussion",
      "Research",
      "Practice",
      "Study Abroad",
      "Quiz",
      "Online Lecture Discussion",
      "Packaged Section"
    ],
    "campuses": [],
    "attributes": [],
    "restrictions": [],
    "gradeBases": [],
    "locations": [
      {
        "lat": null,
        "long": null
      },
      {
        "lat": 40.106778040727896,
        "long": -88.2194617156191
      },
      {
        "lat": 40.11171215875622,
        "long": -88.22530849701589
      },
      {
        "lat": 40.107534,
        "long": -88.2281548
      },
      {
        "lat": 40.110811306674734,
        "long": -88.2248467072371
      },
      {
        "lat": 40.105732,
        "long": -88.2281018
      },
      {
        "lat": 40.1083446,
        "long": -88.2282555
      },
      {
        "lat": 40.1131317,
        "long": -88.2264552
      },
      {
        "lat": 40.1020773,
        "long": -88.2296394
      },
      {
        "lat": 40.11246109008789,
        "long": -88.22831726074219
      },
      {
        "lat": 40.11380515934119,
        "long": -88.22490788390387
      },
      {
        "lat": 40.108419421661715,
        "long": -88.2261156301609
      },
      {
        "lat": 40.1072225,
        "long": -88.2262016
      },
      {
        "lat": 40.1110937,
        "long": -88.2232348
      },
      {
        "lat": 40.103587,
        "long": -88.230606
      },
      {
        "lat": 40.1108856,
        "long": -88.2269806
      },
      {
        "lat": 40.1109722,
        "long": -88.2282631
      },
      {
        "lat": 40.107811,
        "long": -88.2260761
      },
      {
        "lat": 40.10944320239664,
        "long": -88.22602522743233
      },
      {
        "lat": 40.1065684,
        "long": -88.2281746
      },
      {
        "lat": 40.10628,
        "long": -88.22621
      },
      {
        "lat": 40.105587640130146,
        "long": -88.22025111416733
      },
      {
        "lat": 40.103620555545135,
        "long": -88.22982720445013
      },
      {
        "lat": 40.1035872,
        "long": -88.2306061
      },
      {
        "lat": 40.10593795776367,
        "long": -88.2270736694336
      },
      {
        "lat": 40.10755766472843,
        "long": -88.22995430218522
      },
      {
        "lat": 40.102726858556835,
        "long": -88.23259991223857
      },
      {
        "lat": 40.101862,
        "long": -88.231737
      },
      {
        "lat": 40.1149296,
        "long": -88.2280589
      },
      {
        "lat": 40.108570819242026,
        "long": -88.22518453938676
      },
      {
        "lat": 40.1047599,
        "long": -88.2319514
      },
      {
        "lat": 40.092875494224195,
        "long": -88.22082220247309
      },
      {
        "lat": 40.11397164321797,
        "long": -88.2265192685827
      },
      {
        "lat": 40.104794,
        "long": -88.224264
      },
      {
        "lat": 40.10783362157985,
        "long": -88.22476189569741
      },
      {
        "lat": 40.111691,
        "long": -88.2242511
      },
      {
        "lat": 40.1035833,
        "long": -88.228405
      },
      {
        "lat": 40.1033599,
        "long": -88.2292111
      },
      {
        "lat": 40.103627234541904,
        "long": -88.22601765311099
      },
      {
        "lat": 40.10127390836906,
        "long": -88.2226073524728
      },
      {
        "lat": 40.0995003,
        "long": -88.223104
      },
      {
        "lat": 40.11085653938169,
        "long": -88.22609810215927
      },
      {
        "lat": 40.1149521,
        "long": -88.2267561
      },
      {
        "lat": 40.10802885201532,
        "long": -88.22239700364068
      },
      {
        "lat": 40.11180304465921,
        "long": -88.22613003543475
      },
      {
        "lat": 40.1022093629303,
        "long": -88.22800864058527
      },
      {
        "lat": 40.10623714823253,
        "long": -88.2232659093846
      },
      {
        "lat": 40.10039170750639,
        "long": -88.21813070187608
      },
      {
        "lat": 40.1034533,
        "long": -88.2327596
      },
      {
        "lat": 40.1028373,
        "long": -88.2251326
      },
      {
        "lat": 40.1048704,
        "long": -88.2229036
      },
      {
        "lat": 40.10099,
        "long": -88.23159
      },
      {
        "lat": 40.1116416,
        "long": -88.2248868
      },
      {
        "lat": 40.10764262805109,
        "long": -88.23074052515514
      }
    ],
    "finalDates": [],
    "finalTimes": []
  }
}